pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
** ###################################################################
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K70P256M150SF3RM, Rev. 2, Dec 2011
**     Version:             rev. 2.0, 2013-10-29
**     Build:               b150215
**
**     Abstract:
**         Extension to the CMSIS register access layer header.
**
**     Copyright (c) 2013 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2011-08-24)
**         Initial version
**     - rev. 1.1 (2011-11-03)
**         Registers updated according to the new reference manual revision - Rev. 1, Oct 2011
**         Registers of the following modules have been updated - CAN, DDR, I2S, LCDC, MCG, MPU, NFC, RCM, RTC, SDHC, SIM, USBHS, WDOG
**     - rev. 1.2 (2012-01-04)
**         Registers updated according to the new reference manual revision - Rev. 2, Dec 2011
**         EWM - INTEN bit in EWM_CTRL register has been added.
**         PDB - register PDB_PO0EN renamed to PRB_POEN.
**         PMC - BGEN bit in PMC_REGSC register has been removed.
**         SIM - several changes in SCGC registers. Bit USBHS in SOPT2 register removed.
**         UART - new bits RXOFE in regiter CFIFO and RXOF in register SFIFO.
**         DRY - bit THYD in CR register renamed to THYS. Bit group KSL in LR register removed.
**         LCDC - bits GWLPM in LSR register, ERR_RES_EN, GW_ERR_RES_EN in LIER and ERR_RES, GW_ERR_RES in LISR removed.
**     - rev. 1.3 (2012-09-17)
**         DRY module removed.
**     - rev. 1.4 (2012-10-19)
**         RTC - security related registers removed.
**     - rev. 1.5 (2013-06-24)
**         MPU - missing region descriptor registers added.
**     - rev. 2.0 (2013-10-29)
**         Register accessor macros added to the memory map.
**         Symbols for Processor Expert memory map compatibility added to the memory map.
**         Startup file for gcc has been updated according to CMSIS 3.2.
**         System initialization updated.
**
** ###################################################################
*/

/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __MK70F12_EXTENSION_H__
#define __MK70F12_EXTENSION_H__

#include "MK70F12.h"
#include "fsl_bitaccess.h"

/*
 * MK70F12 ADC
 *
 * Analog-to-Digital Converter
 *
 * Registers defined in this header file:
 * - ADC_SC1 - ADC status and control registers 1
 * - ADC_CFG1 - ADC configuration register 1
 * - ADC_CFG2 - Configuration register 2
 * - ADC_R - ADC data result register
 * - ADC_CV1 - Compare value registers
 * - ADC_CV2 - Compare value registers
 * - ADC_SC2 - Status and control register 2
 * - ADC_SC3 - Status and control register 3
 * - ADC_OFS - ADC offset correction register
 * - ADC_PG - ADC plus-side gain register
 * - ADC_MG - ADC minus-side gain register
 * - ADC_CLPD - ADC plus-side general calibration value register
 * - ADC_CLPS - ADC plus-side general calibration value register
 * - ADC_CLP4 - ADC plus-side general calibration value register
 * - ADC_CLP3 - ADC plus-side general calibration value register
 * - ADC_CLP2 - ADC plus-side general calibration value register
 * - ADC_CLP1 - ADC plus-side general calibration value register
 * - ADC_CLP0 - ADC plus-side general calibration value register
 * - ADC_PGA - ADC PGA register
 * - ADC_CLMD - ADC minus-side general calibration value register
 * - ADC_CLMS - ADC minus-side general calibration value register
 * - ADC_CLM4 - ADC minus-side general calibration value register
 * - ADC_CLM3 - ADC minus-side general calibration value register
 * - ADC_CLM2 - ADC minus-side general calibration value register
 * - ADC_CLM1 - ADC minus-side general calibration value register
 * - ADC_CLM0 - ADC minus-side general calibration value register
 */

#define ADC_INSTANCE_COUNT (4U) /*!< Number of instances of the ADC module. */
#define ADC0_IDX (0U) /*!< Instance number for ADC0. */
#define ADC1_IDX (1U) /*!< Instance number for ADC1. */
#define ADC2_IDX (2U) /*!< Instance number for ADC2. */
#define ADC3_IDX (3U) /*!< Instance number for ADC3. */

