pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual ADC_PGA bitfields
 */

/*!
 * @name Register ADC_PGA, field PGAOFSM[14] (RW)
 *
 * When this bit is set, the PGA disconnects itself from the external inputs and
 * auto-configures into offset measurement mode. With this bit set, simply run
 * the ADC in recommended settings and enable maximum hardware averaging to get
 * the PGA offset number. The output will be (PGA offset * (64+1)) for the given
 * PGA setting.
 *
 * Values:
 * - 0 - PGA runs in normal operation.
 * - 1 - PGA runs in offset measurement mode.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGAOFSM field. */
#define ADC_RD_PGA_PGAOFSM(base) ((ADC_PGA_REG(base) & ADC_PGA_PGAOFSM_MASK) >> ADC_PGA_PGAOFSM_SHIFT)
#define ADC_BRD_PGA_PGAOFSM(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAOFSM_SHIFT))

/*! @brief Set the PGAOFSM field to a new value. */
#define ADC_WR_PGA_PGAOFSM(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGAOFSM_MASK, ADC_PGA_PGAOFSM(value)))
#define ADC_BWR_PGA_PGAOFSM(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAOFSM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGAG[19:16] (RW)
 *
 * PGA gain = 2^(PGAG)
 *
 * Values:
 * - 0000 - 1
 * - 0001 - 2
 * - 0010 - 4
 * - 0011 - 8
 * - 0100 - 16
 * - 0101 - 32
 * - 0110 - 64
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - Reserved
 * - 1011 - Reserved
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - Reserved
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGAG field. */
#define ADC_RD_PGA_PGAG(base) ((ADC_PGA_REG(base) & ADC_PGA_PGAG_MASK) >> ADC_PGA_PGAG_SHIFT)
#define ADC_BRD_PGA_PGAG(base) (ADC_RD_PGA_PGAG(base))

/*! @brief Set the PGAG field to a new value. */
#define ADC_WR_PGA_PGAG(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGAG_MASK, ADC_PGA_PGAG(value)))
#define ADC_BWR_PGA_PGAG(base, value) (ADC_WR_PGA_PGAG(base, value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGALPb[20] (RW)
 *
 * Values:
 * - 0 - PGA runs in low power mode.
 * - 1 - PGA runs in normal power mode.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGALPb field. */
#define ADC_RD_PGA_PGALPb(base) ((ADC_PGA_REG(base) & ADC_PGA_PGALPb_MASK) >> ADC_PGA_PGALPb_SHIFT)
#define ADC_BRD_PGA_PGALPb(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGALPb_SHIFT))

/*! @brief Set the PGALPb field to a new value. */
#define ADC_WR_PGA_PGALPb(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGALPb_MASK, ADC_PGA_PGALPb(value)))
#define ADC_BWR_PGA_PGALPb(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGALPb_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGACHPb[21] (RW)
 *
 * Values:
 * - 0 - Chopping enabled.
 * - 1 - Chopping disabled.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGACHPb field. */
#define ADC_RD_PGA_PGACHPb(base) ((ADC_PGA_REG(base) & ADC_PGA_PGACHPb_MASK) >> ADC_PGA_PGACHPb_SHIFT)
#define ADC_BRD_PGA_PGACHPb(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGACHPb_SHIFT))

/*! @brief Set the PGACHPb field to a new value. */
#define ADC_WR_PGA_PGACHPb(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGACHPb_MASK, ADC_PGA_PGACHPb(value)))
#define ADC_BWR_PGA_PGACHPb(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGACHPb_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PGA, field PGAEN[23] (RW)
 *
 * Values:
 * - 0 - PGA disabled.
 * - 1 - PGA enabled.
 */
/*@{*/
/*! @brief Read current value of the ADC_PGA_PGAEN field. */
#define ADC_RD_PGA_PGAEN(base) ((ADC_PGA_REG(base) & ADC_PGA_PGAEN_MASK) >> ADC_PGA_PGAEN_SHIFT)
#define ADC_BRD_PGA_PGAEN(base) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAEN_SHIFT))

/*! @brief Set the PGAEN field to a new value. */
#define ADC_WR_PGA_PGAEN(base, value) (ADC_RMW_PGA(base, ADC_PGA_PGAEN_MASK, ADC_PGA_PGAEN(value)))
#define ADC_BWR_PGA_PGAEN(base, value) (BITBAND_ACCESS32(&ADC_PGA_REG(base), ADC_PGA_PGAEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_CLMD - ADC minus-side general calibration value register
 ******************************************************************************/

/*!
 * @brief ADC_CLMD - ADC minus-side general calibration value register (RW)
 *
 * Reset value: 0x0000000AU
 *
 * CLMx contain calibration information that is generated by the calibration
 * function. These registers contain seven calibration values of varying widths:
 * CLM0[5:0], CLM1[6:0], CLM2[7:0], CLM3[8:0], CLM4[9:0], CLMS[5:0], and CLMD[5:0].
 * CLMx are automatically set once the self calibration sequence is done (CAL is
 * cleared). If these registers are written by the user after calibration, the
 * linearity error specifications may not be met.
 */
/*!
 * @name Constants and macros for entire ADC_CLMD register
 */
/*@{*/
#define ADC_RD_CLMD(base)        (ADC_CLMD_REG(base))
#define ADC_WR_CLMD(base, value) (ADC_CLMD_REG(base) = (value))
#define ADC_RMW_CLMD(base, mask, value) (ADC_WR_CLMD(base, (ADC_RD_CLMD(base) & ~(mask)) | (value)))
#define ADC_SET_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) |  (value)))
#define ADC_CLR_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) & ~(value)))
#define ADC_TOG_CLMD(base, value) (ADC_WR_CLMD(base, ADC_RD_CLMD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLMD bitfields
 */

/*!
 * @name Register ADC_CLMD, field CLMD[5:0] (RW)
 *
 * Calibration value
 */
/*@{*/
/*! @brief Read current value of the ADC_CLMD_CLMD field. */
#define ADC_RD_CLMD_CLMD(base) ((ADC_CLMD_REG(base) & ADC_CLMD_CLMD_MASK) >> ADC_CLMD_CLMD_SHIFT)
#define ADC_BRD_CLMD_CLMD(base) (ADC_RD_CLMD_CLMD(base))

/*! @brief Set the CLMD field to a new value. */
#define ADC_WR_CLMD_CLMD(base, value) (ADC_RMW_CLMD(base, ADC_CLMD_CLMD_MASK, ADC_CLMD_CLMD(value)))
#define ADC_BWR_CLMD_CLMD(base, value) (ADC_WR_CLMD_CLMD(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLMS - ADC minus-side general calibration value register
 ******************************************************************************/

/*!
 * @brief ADC_CLMS - ADC minus-side general calibration value register (RW)
 *
 * Reset value: 0x00000020U
 *
 * For more information, refer to CLMD register description.
 */
/*!
 * @name Constants and macros for entire ADC_CLMS register
 */
/*@{*/
#define ADC_RD_CLMS(base)        (ADC_CLMS_REG(base))
#define ADC_WR_CLMS(base, value) (ADC_CLMS_REG(base) = (value))
#define ADC_RMW_CLMS(base, mask, value) (ADC_WR_CLMS(base, (ADC_RD_CLMS(base) & ~(mask)) | (value)))
#define ADC_SET_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) |  (value)))
#define ADC_CLR_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) & ~(value)))
#define ADC_TOG_CLMS(base, value) (ADC_WR_CLMS(base, ADC_RD_CLMS(base) ^  (value)))
/*@}*/

