pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * CAN_IMASK2 - Interrupt Masks 2 Register
 ******************************************************************************/

/*!
 * @brief CAN_IMASK2 - Interrupt Masks 2 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register allows any number of a range of 32 Message Buffer Interrupts to
 * be enabled or disabled. It contains one interrupt mask bit per buffer,
 * enabling the CPU to determine which buffer generates an interrupt after a successful
 * transmission or reception (i.e. when the corresponding IFLAG2 bit is set).
 */
/*!
 * @name Constants and macros for entire CAN_IMASK2 register
 */
/*@{*/
#define CAN_RD_IMASK2(base)      (CAN_IMASK2_REG(base))
#define CAN_WR_IMASK2(base, value) (CAN_IMASK2_REG(base) = (value))
#define CAN_RMW_IMASK2(base, mask, value) (CAN_WR_IMASK2(base, (CAN_RD_IMASK2(base) & ~(mask)) | (value)))
#define CAN_SET_IMASK2(base, value) (CAN_WR_IMASK2(base, CAN_RD_IMASK2(base) |  (value)))
#define CAN_CLR_IMASK2(base, value) (CAN_WR_IMASK2(base, CAN_RD_IMASK2(base) & ~(value)))
#define CAN_TOG_IMASK2(base, value) (CAN_WR_IMASK2(base, CAN_RD_IMASK2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CAN_IMASK1 - Interrupt Masks 1 Register
 ******************************************************************************/

/*!
 * @brief CAN_IMASK1 - Interrupt Masks 1 Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register allows any number of a range of 32 Message Buffer Interrupts to
 * be enabled or disabled. It contains one interrupt mask bit per buffer,
 * enabling the CPU to determine which buffer generates an interrupt after a successful
 * transmission or reception (i.e. when the corresponding IFLAG1 bit is set).
 */
/*!
 * @name Constants and macros for entire CAN_IMASK1 register
 */
/*@{*/
#define CAN_RD_IMASK1(base)      (CAN_IMASK1_REG(base))
#define CAN_WR_IMASK1(base, value) (CAN_IMASK1_REG(base) = (value))
#define CAN_RMW_IMASK1(base, mask, value) (CAN_WR_IMASK1(base, (CAN_RD_IMASK1(base) & ~(mask)) | (value)))
#define CAN_SET_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) |  (value)))
#define CAN_CLR_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) & ~(value)))
#define CAN_TOG_IMASK1(base, value) (CAN_WR_IMASK1(base, CAN_RD_IMASK1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CAN_IFLAG2 - Interrupt Flags 2 Register
 ******************************************************************************/

/*!
 * @brief CAN_IFLAG2 - Interrupt Flags 2 Register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the flags for 32 Message Buffer interrupts. It contains
 * one interrupt flag bit per buffer. Each successful transmission or reception
 * sets the corresponding IFLAG2 bit. If the corresponding IMASK2 bit is set, an
 * interrupt will be generated. The interrupt flag must be cleared by writing 1
 * to it. Writing 0 has no effect. Before updating MCR[MAXMB] field, CPU must
 * service the IFLAG2 bits whose MB value is greater than the MCR[MAXMB] to be
 * updated; otherwise, they will remain set and be inconsistent with the amount of MBs
 * available.
 */
/*!
 * @name Constants and macros for entire CAN_IFLAG2 register
 */
/*@{*/
#define CAN_RD_IFLAG2(base)      (CAN_IFLAG2_REG(base))
#define CAN_WR_IFLAG2(base, value) (CAN_IFLAG2_REG(base) = (value))
#define CAN_RMW_IFLAG2(base, mask, value) (CAN_WR_IFLAG2(base, (CAN_RD_IFLAG2(base) & ~(mask)) | (value)))
#define CAN_SET_IFLAG2(base, value) (CAN_WR_IFLAG2(base, CAN_RD_IFLAG2(base) |  (value)))
#define CAN_CLR_IFLAG2(base, value) (CAN_WR_IFLAG2(base, CAN_RD_IFLAG2(base) & ~(value)))
#define CAN_TOG_IFLAG2(base, value) (CAN_WR_IFLAG2(base, CAN_RD_IFLAG2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CAN_IFLAG1 - Interrupt Flags 1 Register
 ******************************************************************************/

/*!
 * @brief CAN_IFLAG1 - Interrupt Flags 1 Register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the flags for 32 Message Buffer interrupts. It contains
 * one interrupt flag bit per buffer. Each successful transmission or reception
 * sets the corresponding IFLAG1 bit. If the corresponding IMASK1 bit is set, an
 * interrupt will be generated. The interrupt flag must be cleared by writing 1
 * to it. Writing 0 has no effect. The BUF7I to BUF5I flags are also used to
 * represent FIFO interrupts when the Rx FIFO is enabled. When the bit MCR[RFEN] is
 * set the function of the 8 least significant interrupt flags BUF[7:0]I changes:
 * BUF7I, BUF6I and BUF5I indicate operating conditions of the FIFO, and BUF4TO0I
 * are reserved. Before enabling the RFEN, the CPU must service the IFLAG bits
 * asserted in the Rx FIFO region; see Section "Rx FIFO". Otherwise, these IFLAG
 * bits will mistakenly show the related MBs now belonging to FIFO as having
 * contents to be serviced. When the RFEN bit is negated, the FIFO flags must be
 * cleared. The same care must be taken when an RFFN value is selected extending Rx
 * FIFO filters beyond MB7. For example, when RFFN is 0x8, the MB0-23 range is
 * occupied by Rx FIFO filters and related IFLAG bits must be cleared. Before updating
 * MCR[MAXMB] field, CPU must service the IFLAG1 bits whose MB value is greater
 * than the MCR[MAXMB] to be updated; otherwise, they will remain set and be
 * inconsistent with the amount of MBs available.
 */
/*!
 * @name Constants and macros for entire CAN_IFLAG1 register
 */
/*@{*/
#define CAN_RD_IFLAG1(base)      (CAN_IFLAG1_REG(base))
#define CAN_WR_IFLAG1(base, value) (CAN_IFLAG1_REG(base) = (value))
#define CAN_RMW_IFLAG1(base, mask, value) (CAN_WR_IFLAG1(base, (CAN_RD_IFLAG1(base) & ~(mask)) | (value)))
#define CAN_SET_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) |  (value)))
#define CAN_CLR_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) & ~(value)))
#define CAN_TOG_IFLAG1(base, value) (CAN_WR_IFLAG1(base, CAN_RD_IFLAG1(base) ^  (value)))
/*@}*/

