pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DAC_C1 bitfields
 */

/*!
 * @name Register DAC_C1, field DACBFEN[0] (RW)
 *
 * Values:
 * - 0 - Buffer read pointer disabled. The converted data is always the first
 *     word of the buffer.
 * - 1 - Buffer read pointer enabled. The converted data is the word that the
 *     read pointer points to. It means converted data can be from any word of the
 *     buffer.
 */
/*@{*/
/*! @brief Read current value of the DAC_C1_DACBFEN field. */
#define DAC_RD_C1_DACBFEN(base) ((DAC_C1_REG(base) & DAC_C1_DACBFEN_MASK) >> DAC_C1_DACBFEN_SHIFT)
#define DAC_BRD_C1_DACBFEN(base) (BITBAND_ACCESS8(&DAC_C1_REG(base), DAC_C1_DACBFEN_SHIFT))

/*! @brief Set the DACBFEN field to a new value. */
#define DAC_WR_C1_DACBFEN(base, value) (DAC_RMW_C1(base, DAC_C1_DACBFEN_MASK, DAC_C1_DACBFEN(value)))
#define DAC_BWR_C1_DACBFEN(base, value) (BITBAND_ACCESS8(&DAC_C1_REG(base), DAC_C1_DACBFEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DAC_C1, field DACBFMD[2:1] (RW)
 *
 * Values:
 * - 00 - Normal Mode
 * - 01 - Swing Mode
 * - 10 - One-Time Scan Mode
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DAC_C1_DACBFMD field. */
#define DAC_RD_C1_DACBFMD(base) ((DAC_C1_REG(base) & DAC_C1_DACBFMD_MASK) >> DAC_C1_DACBFMD_SHIFT)
#define DAC_BRD_C1_DACBFMD(base) (DAC_RD_C1_DACBFMD(base))

/*! @brief Set the DACBFMD field to a new value. */
#define DAC_WR_C1_DACBFMD(base, value) (DAC_RMW_C1(base, DAC_C1_DACBFMD_MASK, DAC_C1_DACBFMD(value)))
#define DAC_BWR_C1_DACBFMD(base, value) (DAC_WR_C1_DACBFMD(base, value))
/*@}*/

/*!
 * @name Register DAC_C1, field DACBFWM[4:3] (RW)
 *
 * This bitfield controls when the DAC buffer watermark flag will be set. When
 * the DAC buffer read pointer reaches the word defined by this bitfield, from 1
 * to 4 words away from the upper limit (DACBUP), the DAC buffer watermark flag
 * will be set. This allows user configuration of the watermark interrupt.
 *
 * Values:
 * - 00 - 1 word
 * - 01 - 2 words
 * - 10 - 3 words
 * - 11 - 4 words
 */
/*@{*/
/*! @brief Read current value of the DAC_C1_DACBFWM field. */
#define DAC_RD_C1_DACBFWM(base) ((DAC_C1_REG(base) & DAC_C1_DACBFWM_MASK) >> DAC_C1_DACBFWM_SHIFT)
#define DAC_BRD_C1_DACBFWM(base) (DAC_RD_C1_DACBFWM(base))

/*! @brief Set the DACBFWM field to a new value. */
#define DAC_WR_C1_DACBFWM(base, value) (DAC_RMW_C1(base, DAC_C1_DACBFWM_MASK, DAC_C1_DACBFWM(value)))
#define DAC_BWR_C1_DACBFWM(base, value) (DAC_WR_C1_DACBFWM(base, value))
/*@}*/

/*!
 * @name Register DAC_C1, field DMAEN[7] (RW)
 *
 * Values:
 * - 0 - DMA disabled.
 * - 1 - DMA enabled. When DMA enabled, DMA request will be generated by
 *     original interrupts. And interrupts will not be presented on this module at the
 *     same time.
 */
/*@{*/
/*! @brief Read current value of the DAC_C1_DMAEN field. */
#define DAC_RD_C1_DMAEN(base) ((DAC_C1_REG(base) & DAC_C1_DMAEN_MASK) >> DAC_C1_DMAEN_SHIFT)
#define DAC_BRD_C1_DMAEN(base) (BITBAND_ACCESS8(&DAC_C1_REG(base), DAC_C1_DMAEN_SHIFT))

/*! @brief Set the DMAEN field to a new value. */
#define DAC_WR_C1_DMAEN(base, value) (DAC_RMW_C1(base, DAC_C1_DMAEN_MASK, DAC_C1_DMAEN(value)))
#define DAC_BWR_C1_DMAEN(base, value) (BITBAND_ACCESS8(&DAC_C1_REG(base), DAC_C1_DMAEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DAC_C2 - DAC Control Register 2
 ******************************************************************************/

/*!
 * @brief DAC_C2 - DAC Control Register 2 (RW)
 *
 * Reset value: 0x0FU
 */
/*!
 * @name Constants and macros for entire DAC_C2 register
 */
/*@{*/
#define DAC_RD_C2(base)          (DAC_C2_REG(base))
#define DAC_WR_C2(base, value)   (DAC_C2_REG(base) = (value))
#define DAC_RMW_C2(base, mask, value) (DAC_WR_C2(base, (DAC_RD_C2(base) & ~(mask)) | (value)))
#define DAC_SET_C2(base, value)  (DAC_WR_C2(base, DAC_RD_C2(base) |  (value)))
#define DAC_CLR_C2(base, value)  (DAC_WR_C2(base, DAC_RD_C2(base) & ~(value)))
#define DAC_TOG_C2(base, value)  (DAC_WR_C2(base, DAC_RD_C2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DAC_C2 bitfields
 */

/*!
 * @name Register DAC_C2, field DACBFUP[3:0] (RW)
 *
 * These 4 bits select the buffer's upper limit. The buffer read pointer cannot
 * exceed it.
 */
/*@{*/
/*! @brief Read current value of the DAC_C2_DACBFUP field. */
#define DAC_RD_C2_DACBFUP(base) ((DAC_C2_REG(base) & DAC_C2_DACBFUP_MASK) >> DAC_C2_DACBFUP_SHIFT)
#define DAC_BRD_C2_DACBFUP(base) (DAC_RD_C2_DACBFUP(base))

/*! @brief Set the DACBFUP field to a new value. */
#define DAC_WR_C2_DACBFUP(base, value) (DAC_RMW_C2(base, DAC_C2_DACBFUP_MASK, DAC_C2_DACBFUP(value)))
#define DAC_BWR_C2_DACBFUP(base, value) (DAC_WR_C2_DACBFUP(base, value))
/*@}*/

/*!
 * @name Register DAC_C2, field DACBFRP[7:4] (RW)
 *
 * These 4 bits keep the current value of the buffer read pointer.
 */
/*@{*/
/*! @brief Read current value of the DAC_C2_DACBFRP field. */
#define DAC_RD_C2_DACBFRP(base) ((DAC_C2_REG(base) & DAC_C2_DACBFRP_MASK) >> DAC_C2_DACBFRP_SHIFT)
#define DAC_BRD_C2_DACBFRP(base) (DAC_RD_C2_DACBFRP(base))

/*! @brief Set the DACBFRP field to a new value. */
#define DAC_WR_C2_DACBFRP(base, value) (DAC_RMW_C2(base, DAC_C2_DACBFRP_MASK, DAC_C2_DACBFRP(value)))
#define DAC_BWR_C2_DACBFRP(base, value) (DAC_WR_C2_DACBFRP(base, value))
/*@}*/

/*
 * MK70F12 DDR
 *
 * DRAM Controller
 *
 * Registers defined in this header file:
 * - DDR_CR00 - DDR Control Register 0
 * - DDR_CR01 - DDR Control Register 1
 * - DDR_CR02 - DDR Control Register 2
 * - DDR_CR03 - DDR Control Register 3
 * - DDR_CR04 - DDR Control Register 4
 * - DDR_CR05 - DDR Control Register 5
 * - DDR_CR06 - DDR Control Register 6
 * - DDR_CR07 - DDR Control Register 7
 * - DDR_CR08 - DDR Control Register 8
 * - DDR_CR09 - DDR Control Register 9
 * - DDR_CR10 - DDR Control Register 10
 * - DDR_CR11 - DDR Control Register 11
 * - DDR_CR12 - DDR Control Register 12
 * - DDR_CR13 - DDR Control Register 13
 * - DDR_CR14 - DDR Control Register 14
 * - DDR_CR15 - DDR Control Register 15
 * - DDR_CR16 - DDR Control Register 16
 * - DDR_CR17 - DDR Control Register 17
 * - DDR_CR18 - DDR Control Register 18
 * - DDR_CR19 - DDR Control Register 19
 * - DDR_CR20 - DDR Control Register 20
 * - DDR_CR21 - DDR Control Register 21
 * - DDR_CR22 - DDR Control Register 22
 * - DDR_CR23 - DDR Control Register 23
 * - DDR_CR24 - DDR Control Register 24
 * - DDR_CR25 - DDR Control Register 25
 * - DDR_CR26 - DDR Control Register 26
 * - DDR_CR27 - DDR Control Register 27
 * - DDR_CR28 - DDR Control Register 28
 * - DDR_CR29 - DDR Control Register 29
 * - DDR_CR30 - DDR Control Register 30
 * - DDR_CR31 - DDR Control Register 31
 * - DDR_CR32 - DDR Control Register 32
 * - DDR_CR33 - DDR Control Register 33
 * - DDR_CR34 - DDR Control Register 34
 * - DDR_CR35 - DDR Control Register 35
 * - DDR_CR36 - DDR Control Register 36
 * - DDR_CR37 - DDR Control Register 37
 * - DDR_CR38 - DDR Control Register 38
 * - DDR_CR39 - DDR Control Register 39
 * - DDR_CR40 - DDR Control Register 40
 * - DDR_CR41 - DDR Control Register 41
 * - DDR_CR42 - DDR Control Register 42
 * - DDR_CR43 - DDR Control Register 43
 * - DDR_CR44 - DDR Control Register 44
 * - DDR_CR45 - DDR Control Register 45
 * - DDR_CR46 - DDR Control Register 46
 * - DDR_CR47 - DDR Control Register 47
 * - DDR_CR48 - DDR Control Register 48
 * - DDR_CR49 - DDR Control Register 49
 * - DDR_CR50 - DDR Control Register 50
 * - DDR_CR51 - DDR Control Register 51
 * - DDR_CR52 - DDR Control Register 52
 * - DDR_CR53 - DDR Control Register 53
 * - DDR_CR54 - DDR Control Register 54
 * - DDR_CR55 - DDR Control Register 55
 * - DDR_CR56 - DDR Control Register 56
 * - DDR_CR57 - DDR Control Register 57
 * - DDR_CR58 - DDR Control Register 58
 * - DDR_CR59 - DDR Control Register 59
 * - DDR_CR60 - DDR Control Register 60
 * - DDR_CR61 - DDR Control Register 61
 * - DDR_CR62 - DDR Control Register 62
 * - DDR_CR63 - DDR Control Register 63
 * - DDR_RCR - RCR Control Register
 * - DDR_PAD_CTRL - I/O Pad Control Register
 */

#define DDR_INSTANCE_COUNT (1U) /*!< Number of instances of the DDR module. */
#define DDR_IDX (0U) /*!< Instance number for DDR. */

