pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR00 - DDR Control Register 0
 ******************************************************************************/

/*!
 * @brief DDR_CR00 - DDR Control Register 0 (RW)
 *
 * Reset value: 0x20400000U
 */
/*!
 * @name Constants and macros for entire DDR_CR00 register
 */
/*@{*/
#define DDR_RD_CR00(base)        (DDR_CR00_REG(base))
#define DDR_WR_CR00(base, value) (DDR_CR00_REG(base) = (value))
#define DDR_RMW_CR00(base, mask, value) (DDR_WR_CR00(base, (DDR_RD_CR00(base) & ~(mask)) | (value)))
#define DDR_SET_CR00(base, value) (DDR_WR_CR00(base, DDR_RD_CR00(base) |  (value)))
#define DDR_CLR_CR00(base, value) (DDR_WR_CR00(base, DDR_RD_CR00(base) & ~(value)))
#define DDR_TOG_CR00(base, value) (DDR_WR_CR00(base, DDR_RD_CR00(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR00 bitfields
 */

/*!
 * @name Register DDR_CR00, field START[0] (RW)
 *
 * Initiates CMD processing in the memory controller.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR00_START field. */
#define DDR_RD_CR00_START(base) ((DDR_CR00_REG(base) & DDR_CR00_START_MASK) >> DDR_CR00_START_SHIFT)
#define DDR_BRD_CR00_START(base) (BITBAND_ACCESS32(&DDR_CR00_REG(base), DDR_CR00_START_SHIFT))

/*! @brief Set the START field to a new value. */
#define DDR_WR_CR00_START(base, value) (DDR_RMW_CR00(base, DDR_CR00_START_MASK, DDR_CR00_START(value)))
#define DDR_BWR_CR00_START(base, value) (BITBAND_ACCESS32(&DDR_CR00_REG(base), DDR_CR00_START_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR00, field DDRCLS[11:8] (RW)
 *
 * Defines the mode of operation of the memory controller.
 *
 * Values:
 * - 0000 - DDR
 * - 0001 - LPDDR
 * - 0010 - Reserved
 * - 0011 - Reserved
 * - 0100 - DDR2
 * - 0101 - Reserved
 * - 0110 - Reserved
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DDR_CR00_DDRCLS field. */
#define DDR_RD_CR00_DDRCLS(base) ((DDR_CR00_REG(base) & DDR_CR00_DDRCLS_MASK) >> DDR_CR00_DDRCLS_SHIFT)
#define DDR_BRD_CR00_DDRCLS(base) (DDR_RD_CR00_DDRCLS(base))

/*! @brief Set the DDRCLS field to a new value. */
#define DDR_WR_CR00_DDRCLS(base, value) (DDR_RMW_CR00(base, DDR_CR00_DDRCLS_MASK, DDR_CR00_DDRCLS(value)))
#define DDR_BWR_CR00_DDRCLS(base, value) (DDR_WR_CR00_DDRCLS(base, value))
/*@}*/

/*!
 * @name Register DDR_CR00, field VERSION[31:16] (RO)
 *
 * Shows the version number of the memory controller. Reads as 0x2040.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR00_VERSION field. */
#define DDR_RD_CR00_VERSION(base) ((DDR_CR00_REG(base) & DDR_CR00_VERSION_MASK) >> DDR_CR00_VERSION_SHIFT)
#define DDR_BRD_CR00_VERSION(base) (DDR_RD_CR00_VERSION(base))
/*@}*/

/*******************************************************************************
 * DDR_CR01 - DDR Control Register 1
 ******************************************************************************/

/*!
 * @brief DDR_CR01 - DDR Control Register 1 (RO)
 *
 * Reset value: 0x00020B10U
 */
/*!
 * @name Constants and macros for entire DDR_CR01 register
 */
/*@{*/
#define DDR_RD_CR01(base)        (DDR_CR01_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR01 bitfields
 */

/*!
 * @name Register DDR_CR01, field MAXROW[4:0] (RO)
 *
 * Maximum width of the memory address bus. This field always reads 0x10. This
 * value can be used to set the CR25[ADDPINS] field, where: ADDPINS = MAXROW minus
 * number of row bits in the memory device.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR01_MAXROW field. */
#define DDR_RD_CR01_MAXROW(base) ((DDR_CR01_REG(base) & DDR_CR01_MAXROW_MASK) >> DDR_CR01_MAXROW_SHIFT)
#define DDR_BRD_CR01_MAXROW(base) (DDR_RD_CR01_MAXROW(base))
/*@}*/

/*!
 * @name Register DDR_CR01, field MAXCOL[11:8] (RO)
 *
 * Maximum width of the column address in the DRAM devices. This value can be
 * used to set the CR25[COLSIZ] field, where: COLSIZ = MAXCOL minus number of
 * column bits in the memory device
 *
 * Values:
 * - 0000 - 0
 * - 0001 - 1
 * - 1011 - 11
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - Reserved
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DDR_CR01_MAXCOL field. */
#define DDR_RD_CR01_MAXCOL(base) ((DDR_CR01_REG(base) & DDR_CR01_MAXCOL_MASK) >> DDR_CR01_MAXCOL_SHIFT)
#define DDR_BRD_CR01_MAXCOL(base) (DDR_RD_CR01_MAXCOL(base))
/*@}*/

/*!
 * @name Register DDR_CR01, field CSMAX[17:16] (RO)
 *
 * Maximum number of chip selects supported by the memory controller. This field
 * may not necessarily indicate how many chip selects are available externally
 * on this device.
 *
 * Values:
 * - 00 - Zero
 * - 01 - One
 * - 10 - Two
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DDR_CR01_CSMAX field. */
#define DDR_RD_CR01_CSMAX(base) ((DDR_CR01_REG(base) & DDR_CR01_CSMAX_MASK) >> DDR_CR01_CSMAX_SHIFT)
#define DDR_BRD_CR01_CSMAX(base) (DDR_RD_CR01_CSMAX(base))
/*@}*/

/*******************************************************************************
 * DDR_CR02 - DDR Control Register 2
 ******************************************************************************/

/*!
 * @brief DDR_CR02 - DDR Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR02 register
 */
/*@{*/
#define DDR_RD_CR02(base)        (DDR_CR02_REG(base))
#define DDR_WR_CR02(base, value) (DDR_CR02_REG(base) = (value))
#define DDR_RMW_CR02(base, mask, value) (DDR_WR_CR02(base, (DDR_RD_CR02(base) & ~(mask)) | (value)))
#define DDR_SET_CR02(base, value) (DDR_WR_CR02(base, DDR_RD_CR02(base) |  (value)))
#define DDR_CLR_CR02(base, value) (DDR_WR_CR02(base, DDR_RD_CR02(base) & ~(value)))
#define DDR_TOG_CR02(base, value) (DDR_WR_CR02(base, DDR_RD_CR02(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR02 bitfields
 */

/*!
 * @name Register DDR_CR02, field TINIT[23:0] (RW)
 *
 * Defines the DRAM initialization time in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR02_TINIT field. */
#define DDR_RD_CR02_TINIT(base) ((DDR_CR02_REG(base) & DDR_CR02_TINIT_MASK) >> DDR_CR02_TINIT_SHIFT)
#define DDR_BRD_CR02_TINIT(base) (DDR_RD_CR02_TINIT(base))

