pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TINIT field to a new value. */
#define DDR_WR_CR02_TINIT(base, value) (DDR_RMW_CR02(base, DDR_CR02_TINIT_MASK, DDR_CR02_TINIT(value)))
#define DDR_BWR_CR02_TINIT(base, value) (DDR_WR_CR02_TINIT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR02, field INITAREF[27:24] (RW)
 *
 * Number of auto-refresh commands to execute during DRAM initialization.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR02_INITAREF field. */
#define DDR_RD_CR02_INITAREF(base) ((DDR_CR02_REG(base) & DDR_CR02_INITAREF_MASK) >> DDR_CR02_INITAREF_SHIFT)
#define DDR_BRD_CR02_INITAREF(base) (DDR_RD_CR02_INITAREF(base))

/*! @brief Set the INITAREF field to a new value. */
#define DDR_WR_CR02_INITAREF(base, value) (DDR_RMW_CR02(base, DDR_CR02_INITAREF_MASK, DDR_CR02_INITAREF(value)))
#define DDR_BWR_CR02_INITAREF(base, value) (DDR_WR_CR02_INITAREF(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR03 - DDR Control Register 3
 ******************************************************************************/

/*!
 * @brief DDR_CR03 - DDR Control Register 3 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR03 register
 */
/*@{*/
#define DDR_RD_CR03(base)        (DDR_CR03_REG(base))
#define DDR_WR_CR03(base, value) (DDR_CR03_REG(base) = (value))
#define DDR_RMW_CR03(base, mask, value) (DDR_WR_CR03(base, (DDR_RD_CR03(base) & ~(mask)) | (value)))
#define DDR_SET_CR03(base, value) (DDR_WR_CR03(base, DDR_RD_CR03(base) |  (value)))
#define DDR_CLR_CR03(base, value) (DDR_WR_CR03(base, DDR_RD_CR03(base) & ~(value)))
#define DDR_TOG_CR03(base, value) (DDR_WR_CR03(base, DDR_RD_CR03(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR03 bitfields
 */

/*!
 * @name Register DDR_CR03, field LATLIN[3:0] (RW)
 *
 * Sets the CAS latency linear value in half cycle increments. This sets an
 * internal adjustment for the delay from when the read command is sent from the
 * memory controller to when data is received back. The window of time in which the
 * data is captured is a fixed length. This field adjusts the start of this data
 * capture window. Not all linear values are supported for the memory devices
 * being used. Refer to the device's data sheet for valid values.
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - Reserved
 * - 0010 - 1 cycle
 * - 0011 - 1.5 cycles
 * - 1111 - 7.5 cycles
 */
/*@{*/
/*! @brief Read current value of the DDR_CR03_LATLIN field. */
#define DDR_RD_CR03_LATLIN(base) ((DDR_CR03_REG(base) & DDR_CR03_LATLIN_MASK) >> DDR_CR03_LATLIN_SHIFT)
#define DDR_BRD_CR03_LATLIN(base) (DDR_RD_CR03_LATLIN(base))

/*! @brief Set the LATLIN field to a new value. */
#define DDR_WR_CR03_LATLIN(base, value) (DDR_RMW_CR03(base, DDR_CR03_LATLIN_MASK, DDR_CR03_LATLIN(value)))
#define DDR_BWR_CR03_LATLIN(base, value) (DDR_WR_CR03_LATLIN(base, value))
/*@}*/

/*!
 * @name Register DDR_CR03, field LATGATE[11:8] (RW)
 *
 * Adjusts data capture gate open time by half cycles. This parameter is
 * programmed differently than LATLIN field when there are fixed offsets in the flight
 * path between the memories and the memory controller for clock gating. When this
 * field is larger than LATLIN, the data capture window becomes shorter. A value
 * smaller than LATLIN may have no effect on the data capture window, depending
 * on the fixed offsets in the ASIC and the board.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR03_LATGATE field. */
#define DDR_RD_CR03_LATGATE(base) ((DDR_CR03_REG(base) & DDR_CR03_LATGATE_MASK) >> DDR_CR03_LATGATE_SHIFT)
#define DDR_BRD_CR03_LATGATE(base) (DDR_RD_CR03_LATGATE(base))

/*! @brief Set the LATGATE field to a new value. */
#define DDR_WR_CR03_LATGATE(base, value) (DDR_RMW_CR03(base, DDR_CR03_LATGATE_MASK, DDR_CR03_LATGATE(value)))
#define DDR_BWR_CR03_LATGATE(base, value) (DDR_WR_CR03_LATGATE(base, value))
/*@}*/

/*!
 * @name Register DDR_CR03, field WRLAT[19:16] (RW)
 *
 * Defines the DRAM write latency (WRLAT) when the write command is issued to
 * the time the write data is presented to the DRAM devices in cycles. This
 * parameter must be set to 0x1 when the memory controller is in DDR1 mode.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR03_WRLAT field. */
#define DDR_RD_CR03_WRLAT(base) ((DDR_CR03_REG(base) & DDR_CR03_WRLAT_MASK) >> DDR_CR03_WRLAT_SHIFT)
#define DDR_BRD_CR03_WRLAT(base) (DDR_RD_CR03_WRLAT(base))

/*! @brief Set the WRLAT field to a new value. */
#define DDR_WR_CR03_WRLAT(base, value) (DDR_RMW_CR03(base, DDR_CR03_WRLAT_MASK, DDR_CR03_WRLAT(value)))
#define DDR_BWR_CR03_WRLAT(base, value) (DDR_WR_CR03_WRLAT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR03, field TCCD[28:24] (RW)
 *
 * DRAM CAS-to-CAS parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR03_TCCD field. */
#define DDR_RD_CR03_TCCD(base) ((DDR_CR03_REG(base) & DDR_CR03_TCCD_MASK) >> DDR_CR03_TCCD_SHIFT)
#define DDR_BRD_CR03_TCCD(base) (DDR_RD_CR03_TCCD(base))

/*! @brief Set the TCCD field to a new value. */
#define DDR_WR_CR03_TCCD(base, value) (DDR_RMW_CR03(base, DDR_CR03_TCCD_MASK, DDR_CR03_TCCD(value)))
#define DDR_BWR_CR03_TCCD(base, value) (DDR_WR_CR03_TCCD(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR04 - DDR Control Register 4
 ******************************************************************************/

/*!
 * @brief DDR_CR04 - DDR Control Register 4 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR04 register
 */
/*@{*/
#define DDR_RD_CR04(base)        (DDR_CR04_REG(base))
#define DDR_WR_CR04(base, value) (DDR_CR04_REG(base) = (value))
#define DDR_RMW_CR04(base, mask, value) (DDR_WR_CR04(base, (DDR_RD_CR04(base) & ~(mask)) | (value)))
#define DDR_SET_CR04(base, value) (DDR_WR_CR04(base, DDR_RD_CR04(base) |  (value)))
#define DDR_CLR_CR04(base, value) (DDR_WR_CR04(base, DDR_RD_CR04(base) & ~(value)))
#define DDR_TOG_CR04(base, value) (DDR_WR_CR04(base, DDR_RD_CR04(base) ^  (value)))
/*@}*/

