pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR04 bitfields
 */

/*!
 * @name Register DDR_CR04, field TBINT[2:0] (RW)
 *
 * DRAM burst interrupt interval in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR04_TBINT field. */
#define DDR_RD_CR04_TBINT(base) ((DDR_CR04_REG(base) & DDR_CR04_TBINT_MASK) >> DDR_CR04_TBINT_SHIFT)
#define DDR_BRD_CR04_TBINT(base) (DDR_RD_CR04_TBINT(base))

/*! @brief Set the TBINT field to a new value. */
#define DDR_WR_CR04_TBINT(base, value) (DDR_RMW_CR04(base, DDR_CR04_TBINT_MASK, DDR_CR04_TBINT(value)))
#define DDR_BWR_CR04_TBINT(base, value) (DDR_WR_CR04_TBINT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR04, field TRRD[10:8] (RW)
 *
 * Defines the DRAM activate-to-activate delay for different banks (TRRD) in
 * cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR04_TRRD field. */
#define DDR_RD_CR04_TRRD(base) ((DDR_CR04_REG(base) & DDR_CR04_TRRD_MASK) >> DDR_CR04_TRRD_SHIFT)
#define DDR_BRD_CR04_TRRD(base) (DDR_RD_CR04_TRRD(base))

/*! @brief Set the TRRD field to a new value. */
#define DDR_WR_CR04_TRRD(base, value) (DDR_RMW_CR04(base, DDR_CR04_TRRD_MASK, DDR_CR04_TRRD(value)))
#define DDR_BWR_CR04_TRRD(base, value) (DDR_WR_CR04_TRRD(base, value))
/*@}*/

/*!
 * @name Register DDR_CR04, field TRC[21:16] (RW)
 *
 * Defines the DRAM period between active commands for the same bank (TRC) in
 * cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR04_TRC field. */
#define DDR_RD_CR04_TRC(base) ((DDR_CR04_REG(base) & DDR_CR04_TRC_MASK) >> DDR_CR04_TRC_SHIFT)
#define DDR_BRD_CR04_TRC(base) (DDR_RD_CR04_TRC(base))

/*! @brief Set the TRC field to a new value. */
#define DDR_WR_CR04_TRC(base, value) (DDR_RMW_CR04(base, DDR_CR04_TRC_MASK, DDR_CR04_TRC(value)))
#define DDR_BWR_CR04_TRC(base, value) (DDR_WR_CR04_TRC(base, value))
/*@}*/

/*!
 * @name Register DDR_CR04, field TRASMIN[31:24] (RW)
 *
 * Defines the DRAM minimum row active time (TRAS_MIN) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR04_TRASMIN field. */
#define DDR_RD_CR04_TRASMIN(base) ((DDR_CR04_REG(base) & DDR_CR04_TRASMIN_MASK) >> DDR_CR04_TRASMIN_SHIFT)
#define DDR_BRD_CR04_TRASMIN(base) (DDR_RD_CR04_TRASMIN(base))

/*! @brief Set the TRASMIN field to a new value. */
#define DDR_WR_CR04_TRASMIN(base, value) (DDR_RMW_CR04(base, DDR_CR04_TRASMIN_MASK, DDR_CR04_TRASMIN(value)))
#define DDR_BWR_CR04_TRASMIN(base, value) (DDR_WR_CR04_TRASMIN(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR05 - DDR Control Register 5
 ******************************************************************************/

/*!
 * @brief DDR_CR05 - DDR Control Register 5 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR05 register
 */
/*@{*/
#define DDR_RD_CR05(base)        (DDR_CR05_REG(base))
#define DDR_WR_CR05(base, value) (DDR_CR05_REG(base) = (value))
#define DDR_RMW_CR05(base, mask, value) (DDR_WR_CR05(base, (DDR_RD_CR05(base) & ~(mask)) | (value)))
#define DDR_SET_CR05(base, value) (DDR_WR_CR05(base, DDR_RD_CR05(base) |  (value)))
#define DDR_CLR_CR05(base, value) (DDR_WR_CR05(base, DDR_RD_CR05(base) & ~(value)))
#define DDR_TOG_CR05(base, value) (DDR_WR_CR05(base, DDR_RD_CR05(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR05 bitfields
 */

/*!
 * @name Register DDR_CR05, field TWTR[3:0] (RW)
 *
 * Sets the number of cycles needed to switch from a write to a read operation,
 * as dictated by the DDR SDRAM specification.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR05_TWTR field. */
#define DDR_RD_CR05_TWTR(base) ((DDR_CR05_REG(base) & DDR_CR05_TWTR_MASK) >> DDR_CR05_TWTR_SHIFT)
#define DDR_BRD_CR05_TWTR(base) (DDR_RD_CR05_TWTR(base))

/*! @brief Set the TWTR field to a new value. */
#define DDR_WR_CR05_TWTR(base, value) (DDR_RMW_CR05(base, DDR_CR05_TWTR_MASK, DDR_CR05_TWTR(value)))
#define DDR_BWR_CR05_TWTR(base, value) (DDR_WR_CR05_TWTR(base, value))
/*@}*/

/*!
 * @name Register DDR_CR05, field TRP[11:8] (RW)
 *
 * Defines the DRAM precharge command time (TRP) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR05_TRP field. */
#define DDR_RD_CR05_TRP(base) ((DDR_CR05_REG(base) & DDR_CR05_TRP_MASK) >> DDR_CR05_TRP_SHIFT)
#define DDR_BRD_CR05_TRP(base) (DDR_RD_CR05_TRP(base))

/*! @brief Set the TRP field to a new value. */
#define DDR_WR_CR05_TRP(base, value) (DDR_RMW_CR05(base, DDR_CR05_TRP_MASK, DDR_CR05_TRP(value)))
#define DDR_BWR_CR05_TRP(base, value) (DDR_WR_CR05_TRP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR05, field TRTP[18:16] (RW)
 *
 * Defines the DRAM read to precharge time (TRTP) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR05_TRTP field. */
#define DDR_RD_CR05_TRTP(base) ((DDR_CR05_REG(base) & DDR_CR05_TRTP_MASK) >> DDR_CR05_TRTP_SHIFT)
#define DDR_BRD_CR05_TRTP(base) (DDR_RD_CR05_TRTP(base))

/*! @brief Set the TRTP field to a new value. */
#define DDR_WR_CR05_TRTP(base, value) (DDR_RMW_CR05(base, DDR_CR05_TRTP_MASK, DDR_CR05_TRTP(value)))
#define DDR_BWR_CR05_TRTP(base, value) (DDR_WR_CR05_TRTP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR05, field TMRD[28:24] (RW)
 *
 * DRAM TMRD parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR05_TMRD field. */
#define DDR_RD_CR05_TMRD(base) ((DDR_CR05_REG(base) & DDR_CR05_TMRD_MASK) >> DDR_CR05_TMRD_SHIFT)
#define DDR_BRD_CR05_TMRD(base) (DDR_RD_CR05_TMRD(base))

/*! @brief Set the TMRD field to a new value. */
#define DDR_WR_CR05_TMRD(base, value) (DDR_RMW_CR05(base, DDR_CR05_TMRD_MASK, DDR_CR05_TMRD(value)))
#define DDR_BWR_CR05_TMRD(base, value) (DDR_WR_CR05_TMRD(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR06 - DDR Control Register 6
 ******************************************************************************/

/*!
 * @brief DDR_CR06 - DDR Control Register 6 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR06 register
 */
/*@{*/
#define DDR_RD_CR06(base)        (DDR_CR06_REG(base))
#define DDR_WR_CR06(base, value) (DDR_CR06_REG(base) = (value))
#define DDR_RMW_CR06(base, mask, value) (DDR_WR_CR06(base, (DDR_RD_CR06(base) & ~(mask)) | (value)))
#define DDR_SET_CR06(base, value) (DDR_WR_CR06(base, DDR_RD_CR06(base) |  (value)))
#define DDR_CLR_CR06(base, value) (DDR_WR_CR06(base, DDR_RD_CR06(base) & ~(value)))
#define DDR_TOG_CR06(base, value) (DDR_WR_CR06(base, DDR_RD_CR06(base) ^  (value)))
/*@}*/

