pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR06 bitfields
 */

/*!
 * @name Register DDR_CR06, field TMOD[7:0] (RW)
 *
 * Defines the number of cycles of wait time between mode commands. For write
 * leveling, this is defined as the number of cycles of wait time after a MRS
 * command to the ODT enable.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR06_TMOD field. */
#define DDR_RD_CR06_TMOD(base) ((DDR_CR06_REG(base) & DDR_CR06_TMOD_MASK) >> DDR_CR06_TMOD_SHIFT)
#define DDR_BRD_CR06_TMOD(base) (DDR_RD_CR06_TMOD(base))

/*! @brief Set the TMOD field to a new value. */
#define DDR_WR_CR06_TMOD(base, value) (DDR_RMW_CR06(base, DDR_CR06_TMOD_MASK, DDR_CR06_TMOD(value)))
#define DDR_BWR_CR06_TMOD(base, value) (DDR_WR_CR06_TMOD(base, value))
/*@}*/

/*!
 * @name Register DDR_CR06, field TRASMAX[23:8] (RW)
 *
 * Defines the DRAM maximum row active time (TRAS_MAX) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR06_TRASMAX field. */
#define DDR_RD_CR06_TRASMAX(base) ((DDR_CR06_REG(base) & DDR_CR06_TRASMAX_MASK) >> DDR_CR06_TRASMAX_SHIFT)
#define DDR_BRD_CR06_TRASMAX(base) (DDR_RD_CR06_TRASMAX(base))

/*! @brief Set the TRASMAX field to a new value. */
#define DDR_WR_CR06_TRASMAX(base, value) (DDR_RMW_CR06(base, DDR_CR06_TRASMAX_MASK, DDR_CR06_TRASMAX(value)))
#define DDR_BWR_CR06_TRASMAX(base, value) (DDR_WR_CR06_TRASMAX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR06, field INTWBR[24] (RW)
 *
 * Allows the controller to interrupt a write burst to the DRAMs with a read
 * command. Some memory devices do not support this functionality.
 *
 * Values:
 * - 0 - Read commands cannot interrupt write commands
 * - 1 - Read commands can interrupt write commands
 */
/*@{*/
/*! @brief Read current value of the DDR_CR06_INTWBR field. */
#define DDR_RD_CR06_INTWBR(base) ((DDR_CR06_REG(base) & DDR_CR06_INTWBR_MASK) >> DDR_CR06_INTWBR_SHIFT)
#define DDR_BRD_CR06_INTWBR(base) (BITBAND_ACCESS32(&DDR_CR06_REG(base), DDR_CR06_INTWBR_SHIFT))

/*! @brief Set the INTWBR field to a new value. */
#define DDR_WR_CR06_INTWBR(base, value) (DDR_RMW_CR06(base, DDR_CR06_INTWBR_MASK, DDR_CR06_INTWBR(value)))
#define DDR_BWR_CR06_INTWBR(base, value) (BITBAND_ACCESS32(&DDR_CR06_REG(base), DDR_CR06_INTWBR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR07 - DDR Control Register 7
 ******************************************************************************/

/*!
 * @brief DDR_CR07 - DDR Control Register 7 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR07 register
 */
/*@{*/
#define DDR_RD_CR07(base)        (DDR_CR07_REG(base))
#define DDR_WR_CR07(base, value) (DDR_CR07_REG(base) = (value))
#define DDR_RMW_CR07(base, mask, value) (DDR_WR_CR07(base, (DDR_RD_CR07(base) & ~(mask)) | (value)))
#define DDR_SET_CR07(base, value) (DDR_WR_CR07(base, DDR_RD_CR07(base) |  (value)))
#define DDR_CLR_CR07(base, value) (DDR_WR_CR07(base, DDR_RD_CR07(base) & ~(value)))
#define DDR_TOG_CR07(base, value) (DDR_WR_CR07(base, DDR_RD_CR07(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR07 bitfields
 */

/*!
 * @name Register DDR_CR07, field CLKPW[2:0] (RW)
 *
 * Minimum CLK pulse width in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR07_CLKPW field. */
#define DDR_RD_CR07_CLKPW(base) ((DDR_CR07_REG(base) & DDR_CR07_CLKPW_MASK) >> DDR_CR07_CLKPW_SHIFT)
#define DDR_BRD_CR07_CLKPW(base) (DDR_RD_CR07_CLKPW(base))

/*! @brief Set the CLKPW field to a new value. */
#define DDR_WR_CR07_CLKPW(base, value) (DDR_RMW_CR07(base, DDR_CR07_CLKPW_MASK, DDR_CR07_CLKPW(value)))
#define DDR_BWR_CR07_CLKPW(base, value) (DDR_WR_CR07_CLKPW(base, value))
/*@}*/

/*!
 * @name Register DDR_CR07, field TCKESR[12:8] (RW)
 *
 * Minimum CLK low pulse width during self-refresh.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR07_TCKESR field. */
#define DDR_RD_CR07_TCKESR(base) ((DDR_CR07_REG(base) & DDR_CR07_TCKESR_MASK) >> DDR_CR07_TCKESR_SHIFT)
#define DDR_BRD_CR07_TCKESR(base) (DDR_RD_CR07_TCKESR(base))

/*! @brief Set the TCKESR field to a new value. */
#define DDR_WR_CR07_TCKESR(base, value) (DDR_RMW_CR07(base, DDR_CR07_TCKESR_MASK, DDR_CR07_TCKESR(value)))
#define DDR_BWR_CR07_TCKESR(base, value) (DDR_WR_CR07_TCKESR(base, value))
/*@}*/

/*!
 * @name Register DDR_CR07, field AP[16] (RW)
 *
 * Enables auto pre-charge mode of the memory controller.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR07_AP field. */
#define DDR_RD_CR07_AP(base) ((DDR_CR07_REG(base) & DDR_CR07_AP_MASK) >> DDR_CR07_AP_SHIFT)
#define DDR_BRD_CR07_AP(base) (BITBAND_ACCESS32(&DDR_CR07_REG(base), DDR_CR07_AP_SHIFT))

/*! @brief Set the AP field to a new value. */
#define DDR_WR_CR07_AP(base, value) (DDR_RMW_CR07(base, DDR_CR07_AP_MASK, DDR_CR07_AP(value)))
#define DDR_BWR_CR07_AP(base, value) (BITBAND_ACCESS32(&DDR_CR07_REG(base), DDR_CR07_AP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR07, field CCAPEN[24] (RW)
 *
 * Allows controller to issue commands to other banks while a bank is in auto
 * precharge. Some DRAM devices do not allow one bank to auto pre-charge while
 * another bank is reading or writing. The JEDEC standard allows concurrent auto
 * pre-charge. Set this parameter for the DRAM device being used.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR07_CCAPEN field. */
#define DDR_RD_CR07_CCAPEN(base) ((DDR_CR07_REG(base) & DDR_CR07_CCAPEN_MASK) >> DDR_CR07_CCAPEN_SHIFT)
#define DDR_BRD_CR07_CCAPEN(base) (BITBAND_ACCESS32(&DDR_CR07_REG(base), DDR_CR07_CCAPEN_SHIFT))

/*! @brief Set the CCAPEN field to a new value. */
#define DDR_WR_CR07_CCAPEN(base, value) (DDR_RMW_CR07(base, DDR_CR07_CCAPEN_MASK, DDR_CR07_CCAPEN(value)))
#define DDR_BWR_CR07_CCAPEN(base, value) (BITBAND_ACCESS32(&DDR_CR07_REG(base), DDR_CR07_CCAPEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR08 - DDR Control Register 8
 ******************************************************************************/

/*!
 * @brief DDR_CR08 - DDR Control Register 8 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR08 register
 */
/*@{*/
#define DDR_RD_CR08(base)        (DDR_CR08_REG(base))
#define DDR_WR_CR08(base, value) (DDR_CR08_REG(base) = (value))
#define DDR_RMW_CR08(base, mask, value) (DDR_WR_CR08(base, (DDR_RD_CR08(base) & ~(mask)) | (value)))
#define DDR_SET_CR08(base, value) (DDR_WR_CR08(base, DDR_RD_CR08(base) |  (value)))
#define DDR_CLR_CR08(base, value) (DDR_WR_CR08(base, DDR_RD_CR08(base) & ~(value)))
#define DDR_TOG_CR08(base, value) (DDR_WR_CR08(base, DDR_RD_CR08(base) ^  (value)))
/*@}*/

