pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR08 bitfields
 */

/*!
 * @name Register DDR_CR08, field TRAS[0] (RW)
 *
 * Defines the t RAS lockout setting for the DRAM device. t RAS lockout allows
 * the memory controller to execute auto pre-charge commands before the TRAS_MIN
 * parameter expires. 0 t RAS lockout not supported by memory device 1 t RAS
 * lockout supported by memory device
 */
/*@{*/
/*! @brief Read current value of the DDR_CR08_TRAS field. */
#define DDR_RD_CR08_TRAS(base) ((DDR_CR08_REG(base) & DDR_CR08_TRAS_MASK) >> DDR_CR08_TRAS_SHIFT)
#define DDR_BRD_CR08_TRAS(base) (BITBAND_ACCESS32(&DDR_CR08_REG(base), DDR_CR08_TRAS_SHIFT))

/*! @brief Set the TRAS field to a new value. */
#define DDR_WR_CR08_TRAS(base, value) (DDR_RMW_CR08(base, DDR_CR08_TRAS_MASK, DDR_CR08_TRAS(value)))
#define DDR_BWR_CR08_TRAS(base, value) (BITBAND_ACCESS32(&DDR_CR08_REG(base), DDR_CR08_TRAS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR08, field TRASDI[15:8] (RW)
 *
 * Defines the DRAM RAS-to-CAS delay in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR08_TRASDI field. */
#define DDR_RD_CR08_TRASDI(base) ((DDR_CR08_REG(base) & DDR_CR08_TRASDI_MASK) >> DDR_CR08_TRASDI_SHIFT)
#define DDR_BRD_CR08_TRASDI(base) (DDR_RD_CR08_TRASDI(base))

/*! @brief Set the TRASDI field to a new value. */
#define DDR_WR_CR08_TRASDI(base, value) (DDR_RMW_CR08(base, DDR_CR08_TRASDI_MASK, DDR_CR08_TRASDI(value)))
#define DDR_BWR_CR08_TRASDI(base, value) (DDR_WR_CR08_TRASDI(base, value))
/*@}*/

/*!
 * @name Register DDR_CR08, field TWR[20:16] (RW)
 *
 * Defines the DRAM write recovery time (TWR) parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR08_TWR field. */
#define DDR_RD_CR08_TWR(base) ((DDR_CR08_REG(base) & DDR_CR08_TWR_MASK) >> DDR_CR08_TWR_SHIFT)
#define DDR_BRD_CR08_TWR(base) (DDR_RD_CR08_TWR(base))

/*! @brief Set the TWR field to a new value. */
#define DDR_WR_CR08_TWR(base, value) (DDR_RMW_CR08(base, DDR_CR08_TWR_MASK, DDR_CR08_TWR(value)))
#define DDR_BWR_CR08_TWR(base, value) (DDR_WR_CR08_TWR(base, value))
/*@}*/

/*!
 * @name Register DDR_CR08, field TDAL[28:24] (RW)
 *
 * Defines the auto-precharge write recovery time when auto-precharge is enabled
 * (CR01[AP] is set), in cycles. This is defined internally as t RP (pre-charge
 * time) + auto-precharge write recovery time. Not all memories use this
 * parameter. If t DAL is defined in the memory specification, then program this
 * parameter to the specified value. If the memory does not specify a t DAL time, then
 * program this parameter to t WR + t RP . Do not program this parameter with a
 * value of 0x0. Else, the memory controller does not function properly when
 * auto-precharge is enabled.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR08_TDAL field. */
#define DDR_RD_CR08_TDAL(base) ((DDR_CR08_REG(base) & DDR_CR08_TDAL_MASK) >> DDR_CR08_TDAL_SHIFT)
#define DDR_BRD_CR08_TDAL(base) (DDR_RD_CR08_TDAL(base))

/*! @brief Set the TDAL field to a new value. */
#define DDR_WR_CR08_TDAL(base, value) (DDR_RMW_CR08(base, DDR_CR08_TDAL_MASK, DDR_CR08_TDAL(value)))
#define DDR_BWR_CR08_TDAL(base, value) (DDR_WR_CR08_TDAL(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR09 - DDR Control Register 9
 ******************************************************************************/

/*!
 * @brief DDR_CR09 - DDR Control Register 9 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR09 register
 */
/*@{*/
#define DDR_RD_CR09(base)        (DDR_CR09_REG(base))
#define DDR_WR_CR09(base, value) (DDR_CR09_REG(base) = (value))
#define DDR_RMW_CR09(base, mask, value) (DDR_WR_CR09(base, (DDR_RD_CR09(base) & ~(mask)) | (value)))
#define DDR_SET_CR09(base, value) (DDR_WR_CR09(base, DDR_RD_CR09(base) |  (value)))
#define DDR_CLR_CR09(base, value) (DDR_WR_CR09(base, DDR_RD_CR09(base) & ~(value)))
#define DDR_TOG_CR09(base, value) (DDR_WR_CR09(base, DDR_RD_CR09(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR09 bitfields
 */

/*!
 * @name Register DDR_CR09, field TDLL[15:0] (RW)
 *
 * DLL lock time in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR09_TDLL field. */
#define DDR_RD_CR09_TDLL(base) ((DDR_CR09_REG(base) & DDR_CR09_TDLL_MASK) >> DDR_CR09_TDLL_SHIFT)
#define DDR_BRD_CR09_TDLL(base) (DDR_RD_CR09_TDLL(base))

/*! @brief Set the TDLL field to a new value. */
#define DDR_WR_CR09_TDLL(base, value) (DDR_RMW_CR09(base, DDR_CR09_TDLL_MASK, DDR_CR09_TDLL(value)))
#define DDR_BWR_CR09_TDLL(base, value) (DDR_WR_CR09_TDLL(base, value))
/*@}*/

/*!
 * @name Register DDR_CR09, field NOCMD[16] (RW)
 *
 * Disable DRAM commands until DLL initialization is complete and TDLL expires.
 *
 * Values:
 * - 0 - Issue only REF and PRE commands during DLL initialization of the DRAM
 *     devices. If PRE commands are issued before DLL initialization is complete,
 *     the command is executed immediately and the DLL initialization continues.
 * - 1 - Do not issue any type of command during DLL initialization of the DRAM
 *     devices. If any other commands are issued, they are held until DLL
 *     initialization completes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR09_NOCMD field. */
#define DDR_RD_CR09_NOCMD(base) ((DDR_CR09_REG(base) & DDR_CR09_NOCMD_MASK) >> DDR_CR09_NOCMD_SHIFT)
#define DDR_BRD_CR09_NOCMD(base) (BITBAND_ACCESS32(&DDR_CR09_REG(base), DDR_CR09_NOCMD_SHIFT))

/*! @brief Set the NOCMD field to a new value. */
#define DDR_WR_CR09_NOCMD(base, value) (DDR_RMW_CR09(base, DDR_CR09_NOCMD_MASK, DDR_CR09_NOCMD(value)))
#define DDR_BWR_CR09_NOCMD(base, value) (BITBAND_ACCESS32(&DDR_CR09_REG(base), DDR_CR09_NOCMD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR09, field BSTLEN[26:24] (RW)
 *
 * Defines the memory burst length encoding that will be programmed into the
 * DRAM devices at initialization. The mode is programmed in the dram_class
 * parameter.
 *
 * Values:
 * - 000 - Reserved.
 * - 001 - Two memory words - only applicable if the reduc parameter is set to
 *     'b0 for operation in full datapath mode. Applicable for these memory
 *     systems: DDR1 (dram_class = 'b0000) LPDDR1 (dram_class = 'b0001).
 * - 010 - Four memory words. Applicable for these memory systems: DDR1
 *     (dram_class = 'b0000) LPDDR1 (dram_class = 'b0001) DDR2 (dram_class = 'b0100).
 * - 011 - Eight memory words. Applicable for these memory systems: DDR1
 *     (dram_class = 'b0000) LPDDR1 (dram_class = 'b0001).
 * - 100 - Reserved
 * - 111 - Reserved.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR09_BSTLEN field. */
#define DDR_RD_CR09_BSTLEN(base) ((DDR_CR09_REG(base) & DDR_CR09_BSTLEN_MASK) >> DDR_CR09_BSTLEN_SHIFT)
#define DDR_BRD_CR09_BSTLEN(base) (DDR_RD_CR09_BSTLEN(base))

/*! @brief Set the BSTLEN field to a new value. */
#define DDR_WR_CR09_BSTLEN(base, value) (DDR_RMW_CR09(base, DDR_CR09_BSTLEN_MASK, DDR_CR09_BSTLEN(value)))
#define DDR_BWR_CR09_BSTLEN(base, value) (DDR_WR_CR09_BSTLEN(base, value))
/*@}*/

