pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR10 - DDR Control Register 10
 ******************************************************************************/

/*!
 * @brief DDR_CR10 - DDR Control Register 10 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR10 register
 */
/*@{*/
#define DDR_RD_CR10(base)        (DDR_CR10_REG(base))
#define DDR_WR_CR10(base, value) (DDR_CR10_REG(base) = (value))
#define DDR_RMW_CR10(base, mask, value) (DDR_WR_CR10(base, (DDR_RD_CR10(base) & ~(mask)) | (value)))
#define DDR_SET_CR10(base, value) (DDR_WR_CR10(base, DDR_RD_CR10(base) |  (value)))
#define DDR_CLR_CR10(base, value) (DDR_WR_CR10(base, DDR_RD_CR10(base) & ~(value)))
#define DDR_TOG_CR10(base, value) (DDR_WR_CR10(base, DDR_RD_CR10(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR10 bitfields
 */

/*!
 * @name Register DDR_CR10, field TFAW[5:0] (RW)
 *
 * Defines the DRAM t FAW parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR10_TFAW field. */
#define DDR_RD_CR10_TFAW(base) ((DDR_CR10_REG(base) & DDR_CR10_TFAW_MASK) >> DDR_CR10_TFAW_SHIFT)
#define DDR_BRD_CR10_TFAW(base) (DDR_RD_CR10_TFAW(base))

/*! @brief Set the TFAW field to a new value. */
#define DDR_WR_CR10_TFAW(base, value) (DDR_RMW_CR10(base, DDR_CR10_TFAW_MASK, DDR_CR10_TFAW(value)))
#define DDR_BWR_CR10_TFAW(base, value) (DDR_WR_CR10_TFAW(base, value))
/*@}*/

/*!
 * @name Register DDR_CR10, field TCPD[23:8] (RW)
 *
 * Defines the DRAM TCPD (clock enable to precharge delay time) parameter in
 * cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR10_TCPD field. */
#define DDR_RD_CR10_TCPD(base) ((DDR_CR10_REG(base) & DDR_CR10_TCPD_MASK) >> DDR_CR10_TCPD_SHIFT)
#define DDR_BRD_CR10_TCPD(base) (DDR_RD_CR10_TCPD(base))

/*! @brief Set the TCPD field to a new value. */
#define DDR_WR_CR10_TCPD(base, value) (DDR_RMW_CR10(base, DDR_CR10_TCPD_MASK, DDR_CR10_TCPD(value)))
#define DDR_BWR_CR10_TCPD(base, value) (DDR_WR_CR10_TCPD(base, value))
/*@}*/

/*!
 * @name Register DDR_CR10, field TRPAB[27:24] (RW)
 *
 * DRAM TRP All Bank parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR10_TRPAB field. */
#define DDR_RD_CR10_TRPAB(base) ((DDR_CR10_REG(base) & DDR_CR10_TRPAB_MASK) >> DDR_CR10_TRPAB_SHIFT)
#define DDR_BRD_CR10_TRPAB(base) (DDR_RD_CR10_TRPAB(base))

/*! @brief Set the TRPAB field to a new value. */
#define DDR_WR_CR10_TRPAB(base, value) (DDR_RMW_CR10(base, DDR_CR10_TRPAB_MASK, DDR_CR10_TRPAB(value)))
#define DDR_BWR_CR10_TRPAB(base, value) (DDR_WR_CR10_TRPAB(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR11 - DDR Control Register 11
 ******************************************************************************/

/*!
 * @brief DDR_CR11 - DDR Control Register 11 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR11 register
 */
/*@{*/
#define DDR_RD_CR11(base)        (DDR_CR11_REG(base))
#define DDR_WR_CR11(base, value) (DDR_CR11_REG(base) = (value))
#define DDR_RMW_CR11(base, mask, value) (DDR_WR_CR11(base, (DDR_RD_CR11(base) & ~(mask)) | (value)))
#define DDR_SET_CR11(base, value) (DDR_WR_CR11(base, DDR_RD_CR11(base) |  (value)))
#define DDR_CLR_CR11(base, value) (DDR_WR_CR11(base, DDR_RD_CR11(base) & ~(value)))
#define DDR_TOG_CR11(base, value) (DDR_WR_CR11(base, DDR_RD_CR11(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR11 bitfields
 */

/*!
 * @name Register DDR_CR11, field REGDIMM[0] (RW)
 *
 * Enables registered DIMM operations to control the address and command
 * pipeline of the memory controller. 0 Normal operation 1 Enable registered DIMM
 * operation
 */
/*@{*/
/*! @brief Read current value of the DDR_CR11_REGDIMM field. */
#define DDR_RD_CR11_REGDIMM(base) ((DDR_CR11_REG(base) & DDR_CR11_REGDIMM_MASK) >> DDR_CR11_REGDIMM_SHIFT)
#define DDR_BRD_CR11_REGDIMM(base) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_REGDIMM_SHIFT))

/*! @brief Set the REGDIMM field to a new value. */
#define DDR_WR_CR11_REGDIMM(base, value) (DDR_RMW_CR11(base, DDR_CR11_REGDIMM_MASK, DDR_CR11_REGDIMM(value)))
#define DDR_BWR_CR11_REGDIMM(base, value) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_REGDIMM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR11, field AREF[8] (WO)
 *
 * Trigger auto-refresh at boundary specified by AUTO_REFRESH_MODE. This bit
 * always reads zero. If there are any open banks when this parameter is set, the
 * memory controller automatically closes these banks before issuing the
 * auto-refresh command. 0 No action 1 Issue auto-refresh to the DRAM devices
 */
/*@{*/
/*! @brief Set the AREF field to a new value. */
#define DDR_WR_CR11_AREF(base, value) (DDR_RMW_CR11(base, DDR_CR11_AREF_MASK, DDR_CR11_AREF(value)))
#define DDR_BWR_CR11_AREF(base, value) (DDR_WR_CR11_AREF(base, value))
/*@}*/

/*!
 * @name Register DDR_CR11, field AREFMODE[16] (RW)
 *
 * Define auto refresh to occur at the next burst or command boundary. 0 Issue
 * refresh on the next DRAM burst boundary, even if the current command is not
 * complete 1 Issue refresh on the next command boundary. If a refresh is required
 * to memory, the controller delays this refresh until the end of the current
 * transaction (if the transaction is fully contained inside a single page), or until
 * the current transaction hits the end of the current page.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR11_AREFMODE field. */
#define DDR_RD_CR11_AREFMODE(base) ((DDR_CR11_REG(base) & DDR_CR11_AREFMODE_MASK) >> DDR_CR11_AREFMODE_SHIFT)
#define DDR_BRD_CR11_AREFMODE(base) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_AREFMODE_SHIFT))

/*! @brief Set the AREFMODE field to a new value. */
#define DDR_WR_CR11_AREFMODE(base, value) (DDR_RMW_CR11(base, DDR_CR11_AREFMODE_MASK, DDR_CR11_AREFMODE(value)))
#define DDR_BWR_CR11_AREFMODE(base, value) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_AREFMODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR11, field TREFEN[24] (RW)
 *
 * Enables refresh commands. If command refresh mode is configured, then refresh
 * commands are automatically issued based on the internal CR31[TREF] counter
 * and any refresh commands sent through the command interface or the register
 * interface. 0 Refresh commands disabled 1 Refresh commands enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR11_TREFEN field. */
#define DDR_RD_CR11_TREFEN(base) ((DDR_CR11_REG(base) & DDR_CR11_TREFEN_MASK) >> DDR_CR11_TREFEN_SHIFT)
#define DDR_BRD_CR11_TREFEN(base) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_TREFEN_SHIFT))

