pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TREFEN field to a new value. */
#define DDR_WR_CR11_TREFEN(base, value) (DDR_RMW_CR11(base, DDR_CR11_TREFEN_MASK, DDR_CR11_TREFEN(value)))
#define DDR_BWR_CR11_TREFEN(base, value) (BITBAND_ACCESS32(&DDR_CR11_REG(base), DDR_CR11_TREFEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR12 - DDR Control Register 12
 ******************************************************************************/

/*!
 * @brief DDR_CR12 - DDR Control Register 12 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR12 register
 */
/*@{*/
#define DDR_RD_CR12(base)        (DDR_CR12_REG(base))
#define DDR_WR_CR12(base, value) (DDR_CR12_REG(base) = (value))
#define DDR_RMW_CR12(base, mask, value) (DDR_WR_CR12(base, (DDR_RD_CR12(base) & ~(mask)) | (value)))
#define DDR_SET_CR12(base, value) (DDR_WR_CR12(base, DDR_RD_CR12(base) |  (value)))
#define DDR_CLR_CR12(base, value) (DDR_WR_CR12(base, DDR_RD_CR12(base) & ~(value)))
#define DDR_TOG_CR12(base, value) (DDR_WR_CR12(base, DDR_RD_CR12(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR12 bitfields
 */

/*!
 * @name Register DDR_CR12, field TRFC[9:0] (RW)
 *
 * Defines the DRAM refresh command time (TRFC) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR12_TRFC field. */
#define DDR_RD_CR12_TRFC(base) ((DDR_CR12_REG(base) & DDR_CR12_TRFC_MASK) >> DDR_CR12_TRFC_SHIFT)
#define DDR_BRD_CR12_TRFC(base) (DDR_RD_CR12_TRFC(base))

/*! @brief Set the TRFC field to a new value. */
#define DDR_WR_CR12_TRFC(base, value) (DDR_RMW_CR12(base, DDR_CR12_TRFC_MASK, DDR_CR12_TRFC(value)))
#define DDR_BWR_CR12_TRFC(base, value) (DDR_WR_CR12_TRFC(base, value))
/*@}*/

/*!
 * @name Register DDR_CR12, field TREF[29:16] (RW)
 *
 * Defines the DRAM cycles between refresh commands (TREF) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR12_TREF field. */
#define DDR_RD_CR12_TREF(base) ((DDR_CR12_REG(base) & DDR_CR12_TREF_MASK) >> DDR_CR12_TREF_SHIFT)
#define DDR_BRD_CR12_TREF(base) (DDR_RD_CR12_TREF(base))

/*! @brief Set the TREF field to a new value. */
#define DDR_WR_CR12_TREF(base, value) (DDR_RMW_CR12(base, DDR_CR12_TREF_MASK, DDR_CR12_TREF(value)))
#define DDR_BWR_CR12_TREF(base, value) (DDR_WR_CR12_TREF(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR13 - DDR Control Register 13
 ******************************************************************************/

/*!
 * @brief DDR_CR13 - DDR Control Register 13 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR13 register
 */
/*@{*/
#define DDR_RD_CR13(base)        (DDR_CR13_REG(base))
#define DDR_WR_CR13(base, value) (DDR_CR13_REG(base) = (value))
#define DDR_RMW_CR13(base, mask, value) (DDR_WR_CR13(base, (DDR_RD_CR13(base) & ~(mask)) | (value)))
#define DDR_SET_CR13(base, value) (DDR_WR_CR13(base, DDR_RD_CR13(base) |  (value)))
#define DDR_CLR_CR13(base, value) (DDR_WR_CR13(base, DDR_RD_CR13(base) & ~(value)))
#define DDR_TOG_CR13(base, value) (DDR_WR_CR13(base, DDR_RD_CR13(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR13 bitfields
 */

/*!
 * @name Register DDR_CR13, field TREFINT[13:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR13_TREFINT field. */
#define DDR_RD_CR13_TREFINT(base) ((DDR_CR13_REG(base) & DDR_CR13_TREFINT_MASK) >> DDR_CR13_TREFINT_SHIFT)
#define DDR_BRD_CR13_TREFINT(base) (DDR_RD_CR13_TREFINT(base))

/*! @brief Set the TREFINT field to a new value. */
#define DDR_WR_CR13_TREFINT(base, value) (DDR_RMW_CR13(base, DDR_CR13_TREFINT_MASK, DDR_CR13_TREFINT(value)))
#define DDR_BWR_CR13_TREFINT(base, value) (DDR_WR_CR13_TREFINT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR13, field PD[16] (RW)
 *
 * Disable clock enable and set DRAMs into the power-down state.
 *
 * Values:
 * - 0 - Enable full power state
 * - 1 - The memory controller completes processing of the current burst for the
 *     current transaction (if any), issues a precharge all command, and
 *     disables the clock enable signal to the DRAM devices. Any subsequent commands in
 *     the command queue are suspended until this bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR13_PD field. */
#define DDR_RD_CR13_PD(base) ((DDR_CR13_REG(base) & DDR_CR13_PD_MASK) >> DDR_CR13_PD_SHIFT)
#define DDR_BRD_CR13_PD(base) (BITBAND_ACCESS32(&DDR_CR13_REG(base), DDR_CR13_PD_SHIFT))

/*! @brief Set the PD field to a new value. */
#define DDR_WR_CR13_PD(base, value) (DDR_RMW_CR13(base, DDR_CR13_PD_MASK, DDR_CR13_PD(value)))
#define DDR_BWR_CR13_PD(base, value) (BITBAND_ACCESS32(&DDR_CR13_REG(base), DDR_CR13_PD_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR14 - DDR Control Register 14
 ******************************************************************************/

/*!
 * @brief DDR_CR14 - DDR Control Register 14 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR14 register
 */
/*@{*/
#define DDR_RD_CR14(base)        (DDR_CR14_REG(base))
#define DDR_WR_CR14(base, value) (DDR_CR14_REG(base) = (value))
#define DDR_RMW_CR14(base, mask, value) (DDR_WR_CR14(base, (DDR_RD_CR14(base) & ~(mask)) | (value)))
#define DDR_SET_CR14(base, value) (DDR_WR_CR14(base, DDR_RD_CR14(base) |  (value)))
#define DDR_CLR_CR14(base, value) (DDR_WR_CR14(base, DDR_RD_CR14(base) & ~(value)))
#define DDR_TOG_CR14(base, value) (DDR_WR_CR14(base, DDR_RD_CR14(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR14 bitfields
 */

/*!
 * @name Register DDR_CR14, field TPDEX[15:0] (RW)
 *
 * Defines the DRAM power-down exit command period in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR14_TPDEX field. */
#define DDR_RD_CR14_TPDEX(base) ((DDR_CR14_REG(base) & DDR_CR14_TPDEX_MASK) >> DDR_CR14_TPDEX_SHIFT)
#define DDR_BRD_CR14_TPDEX(base) (DDR_RD_CR14_TPDEX(base))

