pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TPDEX field to a new value. */
#define DDR_WR_CR14_TPDEX(base, value) (DDR_RMW_CR14(base, DDR_CR14_TPDEX_MASK, DDR_CR14_TPDEX(value)))
#define DDR_BWR_CR14_TPDEX(base, value) (DDR_WR_CR14_TPDEX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR14, field TXSR[31:16] (RW)
 *
 * Defines the DRAM self-refresh exit time (TXSR) in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR14_TXSR field. */
#define DDR_RD_CR14_TXSR(base) ((DDR_CR14_REG(base) & DDR_CR14_TXSR_MASK) >> DDR_CR14_TXSR_SHIFT)
#define DDR_BRD_CR14_TXSR(base) (DDR_RD_CR14_TXSR(base))

/*! @brief Set the TXSR field to a new value. */
#define DDR_WR_CR14_TXSR(base, value) (DDR_RMW_CR14(base, DDR_CR14_TXSR_MASK, DDR_CR14_TXSR(value)))
#define DDR_BWR_CR14_TXSR(base, value) (DDR_WR_CR14_TXSR(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR15 - DDR Control Register 15
 ******************************************************************************/

/*!
 * @brief DDR_CR15 - DDR Control Register 15 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR15 register
 */
/*@{*/
#define DDR_RD_CR15(base)        (DDR_CR15_REG(base))
#define DDR_WR_CR15(base, value) (DDR_CR15_REG(base) = (value))
#define DDR_RMW_CR15(base, mask, value) (DDR_WR_CR15(base, (DDR_RD_CR15(base) & ~(mask)) | (value)))
#define DDR_SET_CR15(base, value) (DDR_WR_CR15(base, DDR_RD_CR15(base) |  (value)))
#define DDR_CLR_CR15(base, value) (DDR_WR_CR15(base, DDR_RD_CR15(base) & ~(value)))
#define DDR_TOG_CR15(base, value) (DDR_WR_CR15(base, DDR_RD_CR15(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR15 bitfields
 */

/*!
 * @name Register DDR_CR15, field TXSNR[15:0] (RW)
 *
 * Defines the DRAM TXSNR parameter in cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR15_TXSNR field. */
#define DDR_RD_CR15_TXSNR(base) ((DDR_CR15_REG(base) & DDR_CR15_TXSNR_MASK) >> DDR_CR15_TXSNR_SHIFT)
#define DDR_BRD_CR15_TXSNR(base) (DDR_RD_CR15_TXSNR(base))

/*! @brief Set the TXSNR field to a new value. */
#define DDR_WR_CR15_TXSNR(base, value) (DDR_RMW_CR15(base, DDR_CR15_TXSNR_MASK, DDR_CR15_TXSNR(value)))
#define DDR_BWR_CR15_TXSNR(base, value) (DDR_WR_CR15_TXSNR(base, value))
/*@}*/

/*!
 * @name Register DDR_CR15, field SREF[16] (RW)
 *
 * Place DRAMs into self-refresh mode. 0 Disable self-refresh mode 1 Initiate
 * self-refresh mode of the DRAM devices. The burst of the current transaction (if
 * any) completes, all banks are closed, the self-refresh command is issued to
 * the DRAM, and the clock enable signal is negated. The system remains in
 * self-refresh mode until this bit is cleared. The DRAM devices return to normal
 * operating mode after the self-refresh exit time (TXSR) of the device . The memory
 * controller resumes processing of the commands from the interruption point.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR15_SREF field. */
#define DDR_RD_CR15_SREF(base) ((DDR_CR15_REG(base) & DDR_CR15_SREF_MASK) >> DDR_CR15_SREF_SHIFT)
#define DDR_BRD_CR15_SREF(base) (BITBAND_ACCESS32(&DDR_CR15_REG(base), DDR_CR15_SREF_SHIFT))

/*! @brief Set the SREF field to a new value. */
#define DDR_WR_CR15_SREF(base, value) (DDR_RMW_CR15(base, DDR_CR15_SREF_MASK, DDR_CR15_SREF(value)))
#define DDR_BWR_CR15_SREF(base, value) (BITBAND_ACCESS32(&DDR_CR15_REG(base), DDR_CR15_SREF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR15, field PUREF[24] (RW)
 *
 * Allows controller to exit power-down mode by executing a self-refresh instead
 * of full memory initialization. This fields allows you to skip full
 * initialization when the DRAM devices are in a known self-refresh state. For this silicon
 * revision, clear this bit. This may result in a t XSNR violation. Consult your
 * memory vendor to understand the exact implications of this.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR15_PUREF field. */
#define DDR_RD_CR15_PUREF(base) ((DDR_CR15_REG(base) & DDR_CR15_PUREF_MASK) >> DDR_CR15_PUREF_SHIFT)
#define DDR_BRD_CR15_PUREF(base) (BITBAND_ACCESS32(&DDR_CR15_REG(base), DDR_CR15_PUREF_SHIFT))

/*! @brief Set the PUREF field to a new value. */
#define DDR_WR_CR15_PUREF(base, value) (DDR_RMW_CR15(base, DDR_CR15_PUREF_MASK, DDR_CR15_PUREF(value)))
#define DDR_BWR_CR15_PUREF(base, value) (BITBAND_ACCESS32(&DDR_CR15_REG(base), DDR_CR15_PUREF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR16 - DDR Control Register 16
 ******************************************************************************/

/*!
 * @brief DDR_CR16 - DDR Control Register 16 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR16 register
 */
/*@{*/
#define DDR_RD_CR16(base)        (DDR_CR16_REG(base))
#define DDR_WR_CR16(base, value) (DDR_CR16_REG(base) = (value))
#define DDR_RMW_CR16(base, mask, value) (DDR_WR_CR16(base, (DDR_RD_CR16(base) & ~(mask)) | (value)))
#define DDR_SET_CR16(base, value) (DDR_WR_CR16(base, DDR_RD_CR16(base) |  (value)))
#define DDR_CLR_CR16(base, value) (DDR_WR_CR16(base, DDR_RD_CR16(base) & ~(value)))
#define DDR_TOG_CR16(base, value) (DDR_WR_CR16(base, DDR_RD_CR16(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR16 bitfields
 */

/*!
 * @name Register DDR_CR16, field QKREF[0] (RW)
 *
 * Enable quick self-refresh. Allows user to interrupt memory initialization to
 * enter self-refresh mode when a power loss is detected during the
 * initialization process.
 *
 * Values:
 * - 0 - Continue memory initialization
 * - 1 - Interrupt memory initialization and enter self-refresh mode
 */
/*@{*/
/*! @brief Read current value of the DDR_CR16_QKREF field. */
#define DDR_RD_CR16_QKREF(base) ((DDR_CR16_REG(base) & DDR_CR16_QKREF_MASK) >> DDR_CR16_QKREF_SHIFT)
#define DDR_BRD_CR16_QKREF(base) (BITBAND_ACCESS32(&DDR_CR16_REG(base), DDR_CR16_QKREF_SHIFT))

