pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the QKREF field to a new value. */
#define DDR_WR_CR16_QKREF(base, value) (DDR_RMW_CR16(base, DDR_CR16_QKREF_MASK, DDR_CR16_QKREF(value)))
#define DDR_BWR_CR16_QKREF(base, value) (BITBAND_ACCESS32(&DDR_CR16_REG(base), DDR_CR16_QKREF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR16, field CLKDLY[10:8] (RW)
 *
 * Additional cycles to delay CLK for status reporting.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR16_CLKDLY field. */
#define DDR_RD_CR16_CLKDLY(base) ((DDR_CR16_REG(base) & DDR_CR16_CLKDLY_MASK) >> DDR_CR16_CLKDLY_SHIFT)
#define DDR_BRD_CR16_CLKDLY(base) (DDR_RD_CR16_CLKDLY(base))

/*! @brief Set the CLKDLY field to a new value. */
#define DDR_WR_CR16_CLKDLY(base, value) (DDR_RMW_CR16(base, DDR_CR16_CLKDLY_MASK, DDR_CR16_CLKDLY(value)))
#define DDR_BWR_CR16_CLKDLY(base, value) (DDR_WR_CR16_CLKDLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR16, field LPCTRL[20:16] (RW)
 *
 * Controls entry into the low power modes. Bit[20]: Memory power-down mode
 * (mode 1) Bit[19]: Memory power-down with memory clock gating mode (mode 2)
 * Bit[18]: Memory self-refresh mode (mode 3) Bit[17]: Memory self-refresh with memory
 * clock gating mode (mode 4) Bit[16]: Memory self-refresh with memory and
 * controller clock gating mode (mode 5)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR16_LPCTRL field. */
#define DDR_RD_CR16_LPCTRL(base) ((DDR_CR16_REG(base) & DDR_CR16_LPCTRL_MASK) >> DDR_CR16_LPCTRL_SHIFT)
#define DDR_BRD_CR16_LPCTRL(base) (DDR_RD_CR16_LPCTRL(base))

/*! @brief Set the LPCTRL field to a new value. */
#define DDR_WR_CR16_LPCTRL(base, value) (DDR_RMW_CR16(base, DDR_CR16_LPCTRL_MASK, DDR_CR16_LPCTRL(value)))
#define DDR_BWR_CR16_LPCTRL(base, value) (DDR_WR_CR16_LPCTRL(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR17 - DDR Control Register 17
 ******************************************************************************/

/*!
 * @brief DDR_CR17 - DDR Control Register 17 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR17 register
 */
/*@{*/
#define DDR_RD_CR17(base)        (DDR_CR17_REG(base))
#define DDR_WR_CR17(base, value) (DDR_CR17_REG(base) = (value))
#define DDR_RMW_CR17(base, mask, value) (DDR_WR_CR17(base, (DDR_RD_CR17(base) & ~(mask)) | (value)))
#define DDR_SET_CR17(base, value) (DDR_WR_CR17(base, DDR_RD_CR17(base) |  (value)))
#define DDR_CLR_CR17(base, value) (DDR_WR_CR17(base, DDR_RD_CR17(base) & ~(value)))
#define DDR_TOG_CR17(base, value) (DDR_WR_CR17(base, DDR_RD_CR17(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR17 bitfields
 */

/*!
 * @name Register DDR_CR17, field LPPDCNT[15:0] (RW)
 *
 * Counts the number of idle cycles before memory power-down or power-down in
 * memory clock gating low power modes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR17_LPPDCNT field. */
#define DDR_RD_CR17_LPPDCNT(base) ((DDR_CR17_REG(base) & DDR_CR17_LPPDCNT_MASK) >> DDR_CR17_LPPDCNT_SHIFT)
#define DDR_BRD_CR17_LPPDCNT(base) (DDR_RD_CR17_LPPDCNT(base))

/*! @brief Set the LPPDCNT field to a new value. */
#define DDR_WR_CR17_LPPDCNT(base, value) (DDR_RMW_CR17(base, DDR_CR17_LPPDCNT_MASK, DDR_CR17_LPPDCNT(value)))
#define DDR_BWR_CR17_LPPDCNT(base, value) (DDR_WR_CR17_LPPDCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR17, field LPRFCNT[31:16] (RW)
 *
 * Counts the number of idle cycles to the next memory self-refresh low power
 * mode.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR17_LPRFCNT field. */
#define DDR_RD_CR17_LPRFCNT(base) ((DDR_CR17_REG(base) & DDR_CR17_LPRFCNT_MASK) >> DDR_CR17_LPRFCNT_SHIFT)
#define DDR_BRD_CR17_LPRFCNT(base) (DDR_RD_CR17_LPRFCNT(base))

/*! @brief Set the LPRFCNT field to a new value. */
#define DDR_WR_CR17_LPRFCNT(base, value) (DDR_RMW_CR17(base, DDR_CR17_LPRFCNT_MASK, DDR_CR17_LPRFCNT(value)))
#define DDR_BWR_CR17_LPRFCNT(base, value) (DDR_WR_CR17_LPRFCNT(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR18 - DDR Control Register 18
 ******************************************************************************/

/*!
 * @brief DDR_CR18 - DDR Control Register 18 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR18 register
 */
/*@{*/
#define DDR_RD_CR18(base)        (DDR_CR18_REG(base))
#define DDR_WR_CR18(base, value) (DDR_CR18_REG(base) = (value))
#define DDR_RMW_CR18(base, mask, value) (DDR_WR_CR18(base, (DDR_RD_CR18(base) & ~(mask)) | (value)))
#define DDR_SET_CR18(base, value) (DDR_WR_CR18(base, DDR_RD_CR18(base) |  (value)))
#define DDR_CLR_CR18(base, value) (DDR_WR_CR18(base, DDR_RD_CR18(base) & ~(value)))
#define DDR_TOG_CR18(base, value) (DDR_WR_CR18(base, DDR_RD_CR18(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR18 bitfields
 */

/*!
 * @name Register DDR_CR18, field LPEXTCNT[15:0] (RW)
 *
 * Counts the number of idle cycles before memory self-refresh in memory clock
 * gating low power mode.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR18_LPEXTCNT field. */
#define DDR_RD_CR18_LPEXTCNT(base) ((DDR_CR18_REG(base) & DDR_CR18_LPEXTCNT_MASK) >> DDR_CR18_LPEXTCNT_SHIFT)
#define DDR_BRD_CR18_LPEXTCNT(base) (DDR_RD_CR18_LPEXTCNT(base))

/*! @brief Set the LPEXTCNT field to a new value. */
#define DDR_WR_CR18_LPEXTCNT(base, value) (DDR_RMW_CR18(base, DDR_CR18_LPEXTCNT_MASK, DDR_CR18_LPEXTCNT(value)))
#define DDR_BWR_CR18_LPEXTCNT(base, value) (DDR_WR_CR18_LPEXTCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR18, field LPAUTO[20:16] (RW)
 *
 * Enables automatic entry into the low power mode on idle. Bit[20]: Memory
 * power-down mode (mode 1) Bit[19]: Memory power-down with memory clock gating mode
 * (mode 2) Bit[18]: Memory self-refresh mode (mode 3) Bit[17]: Memory
 * self-refresh with memory clock gating mode (mode 4) Bit[16]: Memory self-refresh with
 * memory and controller clock gating mode (mode 5) 0 Automatic entry into this
 * mode is disabled. You may enter the modes manually by setting the associated
 * LPCTRL bit. 1 The controller/memory automatically enters this mode when the proper
 * counters expire, and only if the associated LPCTRL is set.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR18_LPAUTO field. */
#define DDR_RD_CR18_LPAUTO(base) ((DDR_CR18_REG(base) & DDR_CR18_LPAUTO_MASK) >> DDR_CR18_LPAUTO_SHIFT)
#define DDR_BRD_CR18_LPAUTO(base) (DDR_RD_CR18_LPAUTO(base))

/*! @brief Set the LPAUTO field to a new value. */
#define DDR_WR_CR18_LPAUTO(base, value) (DDR_RMW_CR18(base, DDR_CR18_LPAUTO_MASK, DDR_CR18_LPAUTO(value)))
#define DDR_BWR_CR18_LPAUTO(base, value) (DDR_WR_CR18_LPAUTO(base, value))
/*@}*/

