pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR19 - DDR Control Register 19
 ******************************************************************************/

/*!
 * @brief DDR_CR19 - DDR Control Register 19 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR19 register
 */
/*@{*/
#define DDR_RD_CR19(base)        (DDR_CR19_REG(base))
#define DDR_WR_CR19(base, value) (DDR_CR19_REG(base) = (value))
#define DDR_RMW_CR19(base, mask, value) (DDR_WR_CR19(base, (DDR_RD_CR19(base) & ~(mask)) | (value)))
#define DDR_SET_CR19(base, value) (DDR_WR_CR19(base, DDR_RD_CR19(base) |  (value)))
#define DDR_CLR_CR19(base, value) (DDR_WR_CR19(base, DDR_RD_CR19(base) & ~(value)))
#define DDR_TOG_CR19(base, value) (DDR_WR_CR19(base, DDR_RD_CR19(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR19 bitfields
 */

/*!
 * @name Register DDR_CR19, field LPINTCNT[15:0] (RW)
 *
 * Counts the number of idle cycles before memory self-refresh in memory and
 * controller clock gating low power mode. This parameter must be programmed to a
 * non-zero value for proper operation.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR19_LPINTCNT field. */
#define DDR_RD_CR19_LPINTCNT(base) ((DDR_CR19_REG(base) & DDR_CR19_LPINTCNT_MASK) >> DDR_CR19_LPINTCNT_SHIFT)
#define DDR_BRD_CR19_LPINTCNT(base) (DDR_RD_CR19_LPINTCNT(base))

/*! @brief Set the LPINTCNT field to a new value. */
#define DDR_WR_CR19_LPINTCNT(base, value) (DDR_RMW_CR19(base, DDR_CR19_LPINTCNT_MASK, DDR_CR19_LPINTCNT(value)))
#define DDR_BWR_CR19_LPINTCNT(base, value) (DDR_WR_CR19_LPINTCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR19, field LPRFHOLD[31:16] (RW)
 *
 * Re-sync counter for DLL in clock gate mode. Sets the number of cycles that
 * the memory controller waits before attempting to re-lock the DLL when using the
 * controller clock gating mode low power mode. This counter is only used in this
 * mode, the deepest low power mode. When this counter expires, the DLL is
 * ungated for at least 16 cycles during which the DLL attempts to re-lock. After 16
 * cycles elapse and the DLL locks, the DLL controller clock is gated again and
 * the counter resets to this value. If the DLL requires more than 16 cycles to
 * re-lock, then the ungated time is longer.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR19_LPRFHOLD field. */
#define DDR_RD_CR19_LPRFHOLD(base) ((DDR_CR19_REG(base) & DDR_CR19_LPRFHOLD_MASK) >> DDR_CR19_LPRFHOLD_SHIFT)
#define DDR_BRD_CR19_LPRFHOLD(base) (DDR_RD_CR19_LPRFHOLD(base))

/*! @brief Set the LPRFHOLD field to a new value. */
#define DDR_WR_CR19_LPRFHOLD(base, value) (DDR_RMW_CR19(base, DDR_CR19_LPRFHOLD_MASK, DDR_CR19_LPRFHOLD(value)))
#define DDR_BWR_CR19_LPRFHOLD(base, value) (DDR_WR_CR19_LPRFHOLD(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR20 - DDR Control Register 20
 ******************************************************************************/

/*!
 * @brief DDR_CR20 - DDR Control Register 20 (RW)
 *
 * Reset value: 0x0C000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR20 register
 */
/*@{*/
#define DDR_RD_CR20(base)        (DDR_CR20_REG(base))
#define DDR_WR_CR20(base, value) (DDR_CR20_REG(base) = (value))
#define DDR_RMW_CR20(base, mask, value) (DDR_WR_CR20(base, (DDR_RD_CR20(base) & ~(mask)) | (value)))
#define DDR_SET_CR20(base, value) (DDR_WR_CR20(base, DDR_RD_CR20(base) |  (value)))
#define DDR_CLR_CR20(base, value) (DDR_WR_CR20(base, DDR_RD_CR20(base) & ~(value)))
#define DDR_TOG_CR20(base, value) (DDR_WR_CR20(base, DDR_RD_CR20(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR20 bitfields
 */

/*!
 * @name Register DDR_CR20, field LPRE[1:0] (RW)
 *
 * Sets whether refreshes will occur while the memory controller is in one of
 * the power-down modes. The refreshes will not occur while in any of the
 * self-refresh modes. This parameter is active low.
 *
 * Values:
 * - 00 - Refreshes occur
 * - 01 - Refreshes do not occur
 * - 10 - Reserved
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the DDR_CR20_LPRE field. */
#define DDR_RD_CR20_LPRE(base) ((DDR_CR20_REG(base) & DDR_CR20_LPRE_MASK) >> DDR_CR20_LPRE_SHIFT)
#define DDR_BRD_CR20_LPRE(base) (DDR_RD_CR20_LPRE(base))

/*! @brief Set the LPRE field to a new value. */
#define DDR_WR_CR20_LPRE(base, value) (DDR_RMW_CR20(base, DDR_CR20_LPRE_MASK, DDR_CR20_LPRE(value)))
#define DDR_BWR_CR20_LPRE(base, value) (DDR_WR_CR20_LPRE(base, value))
/*@}*/

/*!
 * @name Register DDR_CR20, field CKSRE[11:8] (RW)
 *
 * Clock hold delay on self refresh entry. Sets the number of cycles to hold the
 * clock stable after entering self-refresh mode. The clock will run for a
 * minimum of cksre cycles after CLK falls.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR20_CKSRE field. */
#define DDR_RD_CR20_CKSRE(base) ((DDR_CR20_REG(base) & DDR_CR20_CKSRE_MASK) >> DDR_CR20_CKSRE_SHIFT)
#define DDR_BRD_CR20_CKSRE(base) (DDR_RD_CR20_CKSRE(base))

/*! @brief Set the CKSRE field to a new value. */
#define DDR_WR_CR20_CKSRE(base, value) (DDR_RMW_CR20(base, DDR_CR20_CKSRE_MASK, DDR_CR20_CKSRE(value)))
#define DDR_BWR_CR20_CKSRE(base, value) (DDR_WR_CR20_CKSRE(base, value))
/*@}*/

/*!
 * @name Register DDR_CR20, field CKSRX[19:16] (RW)
 *
 * Clock stable delay on self refresh exit. Sets the number of cycles to hold
 * the clock stable before exiting self-refresh mode. The clock will run for a
 * minimum of cksrx cycles before CLK rises.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR20_CKSRX field. */
#define DDR_RD_CR20_CKSRX(base) ((DDR_CR20_REG(base) & DDR_CR20_CKSRX_MASK) >> DDR_CR20_CKSRX_SHIFT)
#define DDR_BRD_CR20_CKSRX(base) (DDR_RD_CR20_CKSRX(base))

/*! @brief Set the CKSRX field to a new value. */
#define DDR_WR_CR20_CKSRX(base, value) (DDR_RMW_CR20(base, DDR_CR20_CKSRX_MASK, DDR_CR20_CKSRX(value)))
#define DDR_BWR_CR20_CKSRX(base, value) (DDR_WR_CR20_CKSRX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR20, field WRMD[24] (WO)
 *
 * Write mode register data to the DRAMs. The mode registers are automatically
 * written at initialization of the memory controller. There is no need to
 * initiate a mode register write after setting CR00[START], unless the values in these
 * registers needs to be changed after initialization. This parameter may not be
 * changed when the memory is in power-down mode (CLK is negated). 0 No write
 * occurs 1 Write the mode parameters (EMRS register) in the DRAM devices. This
 * parameter always reads zero.
 */
/*@{*/
/*! @brief Set the WRMD field to a new value. */
#define DDR_WR_CR20_WRMD(base, value) (DDR_RMW_CR20(base, DDR_CR20_WRMD_MASK, DDR_CR20_WRMD(value)))
#define DDR_BWR_CR20_WRMD(base, value) (DDR_WR_CR20_WRMD(base, value))
/*@}*/

