pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR21 - DDR Control Register 21
 ******************************************************************************/

/*!
 * @brief DDR_CR21 - DDR Control Register 21 (RW)
 *
 * Reset value: 0x00000400U
 */
/*!
 * @name Constants and macros for entire DDR_CR21 register
 */
/*@{*/
#define DDR_RD_CR21(base)        (DDR_CR21_REG(base))
#define DDR_WR_CR21(base, value) (DDR_CR21_REG(base) = (value))
#define DDR_RMW_CR21(base, mask, value) (DDR_WR_CR21(base, (DDR_RD_CR21(base) & ~(mask)) | (value)))
#define DDR_SET_CR21(base, value) (DDR_WR_CR21(base, DDR_RD_CR21(base) |  (value)))
#define DDR_CLR_CR21(base, value) (DDR_WR_CR21(base, DDR_RD_CR21(base) & ~(value)))
#define DDR_TOG_CR21(base, value) (DDR_WR_CR21(base, DDR_RD_CR21(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR21 bitfields
 */

/*!
 * @name Register DDR_CR21, field MR0DAT0[15:0] (RW)
 *
 * Data to program into memory mode register 0 for chip select .
 */
/*@{*/
/*! @brief Read current value of the DDR_CR21_MR0DAT0 field. */
#define DDR_RD_CR21_MR0DAT0(base) ((DDR_CR21_REG(base) & DDR_CR21_MR0DAT0_MASK) >> DDR_CR21_MR0DAT0_SHIFT)
#define DDR_BRD_CR21_MR0DAT0(base) (DDR_RD_CR21_MR0DAT0(base))

/*! @brief Set the MR0DAT0 field to a new value. */
#define DDR_WR_CR21_MR0DAT0(base, value) (DDR_RMW_CR21(base, DDR_CR21_MR0DAT0_MASK, DDR_CR21_MR0DAT0(value)))
#define DDR_BWR_CR21_MR0DAT0(base, value) (DDR_WR_CR21_MR0DAT0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR21, field MR1DAT0[31:16] (RW)
 *
 * Data to program into memory mode register 1 for chip select .
 */
/*@{*/
/*! @brief Read current value of the DDR_CR21_MR1DAT0 field. */
#define DDR_RD_CR21_MR1DAT0(base) ((DDR_CR21_REG(base) & DDR_CR21_MR1DAT0_MASK) >> DDR_CR21_MR1DAT0_SHIFT)
#define DDR_BRD_CR21_MR1DAT0(base) (DDR_RD_CR21_MR1DAT0(base))

/*! @brief Set the MR1DAT0 field to a new value. */
#define DDR_WR_CR21_MR1DAT0(base, value) (DDR_RMW_CR21(base, DDR_CR21_MR1DAT0_MASK, DDR_CR21_MR1DAT0(value)))
#define DDR_BWR_CR21_MR1DAT0(base, value) (DDR_WR_CR21_MR1DAT0(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR22 - DDR Control Register 22
 ******************************************************************************/

/*!
 * @brief DDR_CR22 - DDR Control Register 22 (RW)
 *
 * Reset value: 0x00000400U
 */
/*!
 * @name Constants and macros for entire DDR_CR22 register
 */
/*@{*/
#define DDR_RD_CR22(base)        (DDR_CR22_REG(base))
#define DDR_WR_CR22(base, value) (DDR_CR22_REG(base) = (value))
#define DDR_RMW_CR22(base, mask, value) (DDR_WR_CR22(base, (DDR_RD_CR22(base) & ~(mask)) | (value)))
#define DDR_SET_CR22(base, value) (DDR_WR_CR22(base, DDR_RD_CR22(base) |  (value)))
#define DDR_CLR_CR22(base, value) (DDR_WR_CR22(base, DDR_RD_CR22(base) & ~(value)))
#define DDR_TOG_CR22(base, value) (DDR_WR_CR22(base, DDR_RD_CR22(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR22 bitfields
 */

/*!
 * @name Register DDR_CR22, field MR2DATA0[15:0] (RW)
 *
 * Data to program into memory mode register 2 for chip select .
 */
/*@{*/
/*! @brief Read current value of the DDR_CR22_MR2DATA0 field. */
#define DDR_RD_CR22_MR2DATA0(base) ((DDR_CR22_REG(base) & DDR_CR22_MR2DATA0_MASK) >> DDR_CR22_MR2DATA0_SHIFT)
#define DDR_BRD_CR22_MR2DATA0(base) (DDR_RD_CR22_MR2DATA0(base))

/*! @brief Set the MR2DATA0 field to a new value. */
#define DDR_WR_CR22_MR2DATA0(base, value) (DDR_RMW_CR22(base, DDR_CR22_MR2DATA0_MASK, DDR_CR22_MR2DATA0(value)))
#define DDR_BWR_CR22_MR2DATA0(base, value) (DDR_WR_CR22_MR2DATA0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR22, field MR3DAT0[31:16] (RW)
 *
 * Data to program into memory mode register 3 for chip select .
 */
/*@{*/
/*! @brief Read current value of the DDR_CR22_MR3DAT0 field. */
#define DDR_RD_CR22_MR3DAT0(base) ((DDR_CR22_REG(base) & DDR_CR22_MR3DAT0_MASK) >> DDR_CR22_MR3DAT0_SHIFT)
#define DDR_BRD_CR22_MR3DAT0(base) (DDR_RD_CR22_MR3DAT0(base))

/*! @brief Set the MR3DAT0 field to a new value. */
#define DDR_WR_CR22_MR3DAT0(base, value) (DDR_RMW_CR22(base, DDR_CR22_MR3DAT0_MASK, DDR_CR22_MR3DAT0(value)))
#define DDR_BWR_CR22_MR3DAT0(base, value) (DDR_WR_CR22_MR3DAT0(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR23 - DDR Control Register 23
 ******************************************************************************/

/*!
 * @brief DDR_CR23 - DDR Control Register 23 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR23 register
 */
/*@{*/
#define DDR_RD_CR23(base)        (DDR_CR23_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR23 bitfields
 */

/*!
 * @name Register DDR_CR23, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR23_Not_Used field. */
#define DDR_RD_CR23_Not_Used(base) ((DDR_CR23_REG(base) & DDR_CR23_Not_Used_MASK) >> DDR_CR23_Not_Used_SHIFT)
#define DDR_BRD_CR23_Not_Used(base) (DDR_RD_CR23_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR23, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR23_NOT_USED field. */
#define DDR_RD_CR23_NOT_USED(base) ((DDR_CR23_REG(base) & DDR_CR23_NOT_USED_MASK) >> DDR_CR23_NOT_USED_SHIFT)
#define DDR_BRD_CR23_NOT_USED(base) (DDR_RD_CR23_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR24 - DDR Control Register 24
 ******************************************************************************/

/*!
 * @brief DDR_CR24 - DDR Control Register 24 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR24 register
 */
/*@{*/
#define DDR_RD_CR24(base)        (DDR_CR24_REG(base))
/*@}*/

/*******************************************************************************
 * DDR_CR25 - DDR Control Register 25
 ******************************************************************************/

/*!
 * @brief DDR_CR25 - DDR Control Register 25 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR25 register
 */
/*@{*/
#define DDR_RD_CR25(base)        (DDR_CR25_REG(base))
#define DDR_WR_CR25(base, value) (DDR_CR25_REG(base) = (value))
#define DDR_RMW_CR25(base, mask, value) (DDR_WR_CR25(base, (DDR_RD_CR25(base) & ~(mask)) | (value)))
#define DDR_SET_CR25(base, value) (DDR_WR_CR25(base, DDR_RD_CR25(base) |  (value)))
#define DDR_CLR_CR25(base, value) (DDR_WR_CR25(base, DDR_RD_CR25(base) & ~(value)))
#define DDR_TOG_CR25(base, value) (DDR_WR_CR25(base, DDR_RD_CR25(base) ^  (value)))
/*@}*/

