pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR25 bitfields
 */

/*!
 * @name Register DDR_CR25, field BNK8[0] (RW)
 *
 * Number of banks on the DRAMs.
 *
 * Values:
 * - 0 - 4 banks
 * - 1 - 8 banks
 */
/*@{*/
/*! @brief Read current value of the DDR_CR25_BNK8 field. */
#define DDR_RD_CR25_BNK8(base) ((DDR_CR25_REG(base) & DDR_CR25_BNK8_MASK) >> DDR_CR25_BNK8_SHIFT)
#define DDR_BRD_CR25_BNK8(base) (BITBAND_ACCESS32(&DDR_CR25_REG(base), DDR_CR25_BNK8_SHIFT))

/*! @brief Set the BNK8 field to a new value. */
#define DDR_WR_CR25_BNK8(base, value) (DDR_RMW_CR25(base, DDR_CR25_BNK8_MASK, DDR_CR25_BNK8(value)))
#define DDR_BWR_CR25_BNK8(base, value) (BITBAND_ACCESS32(&DDR_CR25_REG(base), DDR_CR25_BNK8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR25, field ADDPINS[10:8] (RW)
 *
 * Defines the difference between the maximum number of address pins configured
 * (16) and the actual number of pins used. The user address is automatically
 * shifted so that the user address space is mapped contiguously into the memory map
 * based on the value of this parameter. For details, refer to section "DDR
 * SDRAM Address Mapping Options".
 */
/*@{*/
/*! @brief Read current value of the DDR_CR25_ADDPINS field. */
#define DDR_RD_CR25_ADDPINS(base) ((DDR_CR25_REG(base) & DDR_CR25_ADDPINS_MASK) >> DDR_CR25_ADDPINS_SHIFT)
#define DDR_BRD_CR25_ADDPINS(base) (DDR_RD_CR25_ADDPINS(base))

/*! @brief Set the ADDPINS field to a new value. */
#define DDR_WR_CR25_ADDPINS(base, value) (DDR_RMW_CR25(base, DDR_CR25_ADDPINS_MASK, DDR_CR25_ADDPINS(value)))
#define DDR_BWR_CR25_ADDPINS(base, value) (DDR_WR_CR25_ADDPINS(base, value))
/*@}*/

/*!
 * @name Register DDR_CR25, field COLSIZ[18:16] (RW)
 *
 * Difference between the 11 column pins available and the number being used.
 * The user address is automatically shifted so that the user address space is
 * mapped contiguously into the memory map based on the value of this parameter. For
 * details, refer to section "DDR SDRAM Address Mapping Options".
 */
/*@{*/
/*! @brief Read current value of the DDR_CR25_COLSIZ field. */
#define DDR_RD_CR25_COLSIZ(base) ((DDR_CR25_REG(base) & DDR_CR25_COLSIZ_MASK) >> DDR_CR25_COLSIZ_SHIFT)
#define DDR_BRD_CR25_COLSIZ(base) (DDR_RD_CR25_COLSIZ(base))

/*! @brief Set the COLSIZ field to a new value. */
#define DDR_WR_CR25_COLSIZ(base, value) (DDR_RMW_CR25(base, DDR_CR25_COLSIZ_MASK, DDR_CR25_COLSIZ(value)))
#define DDR_BWR_CR25_COLSIZ(base, value) (DDR_WR_CR25_COLSIZ(base, value))
/*@}*/

/*!
 * @name Register DDR_CR25, field APREBIT[27:24] (RW)
 *
 * Location of the auto precharge bit in the DRAM address in decimal encoding.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR25_APREBIT field. */
#define DDR_RD_CR25_APREBIT(base) ((DDR_CR25_REG(base) & DDR_CR25_APREBIT_MASK) >> DDR_CR25_APREBIT_SHIFT)
#define DDR_BRD_CR25_APREBIT(base) (DDR_RD_CR25_APREBIT(base))

/*! @brief Set the APREBIT field to a new value. */
#define DDR_WR_CR25_APREBIT(base, value) (DDR_RMW_CR25(base, DDR_CR25_APREBIT_MASK, DDR_CR25_APREBIT(value)))
#define DDR_BWR_CR25_APREBIT(base, value) (DDR_WR_CR25_APREBIT(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR26 - DDR Control Register 26
 ******************************************************************************/

/*!
 * @brief DDR_CR26 - DDR Control Register 26 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR26 register
 */
/*@{*/
#define DDR_RD_CR26(base)        (DDR_CR26_REG(base))
#define DDR_WR_CR26(base, value) (DDR_CR26_REG(base) = (value))
#define DDR_RMW_CR26(base, mask, value) (DDR_WR_CR26(base, (DDR_RD_CR26(base) & ~(mask)) | (value)))
#define DDR_SET_CR26(base, value) (DDR_WR_CR26(base, DDR_RD_CR26(base) |  (value)))
#define DDR_CLR_CR26(base, value) (DDR_WR_CR26(base, DDR_RD_CR26(base) & ~(value)))
#define DDR_TOG_CR26(base, value) (DDR_WR_CR26(base, DDR_RD_CR26(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR26 bitfields
 */

/*!
 * @name Register DDR_CR26, field AGECNT[7:0] (RW)
 *
 * Initial value of master aging-rate counter for command aging. When using the
 * placement logic to fill the command queue, the command aging counters are
 * decremented one each time the master aging-rate counter counts down AGECNT cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR26_AGECNT field. */
#define DDR_RD_CR26_AGECNT(base) ((DDR_CR26_REG(base) & DDR_CR26_AGECNT_MASK) >> DDR_CR26_AGECNT_SHIFT)
#define DDR_BRD_CR26_AGECNT(base) (DDR_RD_CR26_AGECNT(base))

/*! @brief Set the AGECNT field to a new value. */
#define DDR_WR_CR26_AGECNT(base, value) (DDR_RMW_CR26(base, DDR_CR26_AGECNT_MASK, DDR_CR26_AGECNT(value)))
#define DDR_BWR_CR26_AGECNT(base, value) (DDR_WR_CR26_AGECNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR26, field CMDAGE[15:8] (RW)
 *
 * Initial value of individual command aging counters associated with each
 * command in the command queue. When using the placement logic to fill the command
 * queue, the command aging counters decrement one each time the master aging-rate
 * counter counts down CR26[AGECNT] cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR26_CMDAGE field. */
#define DDR_RD_CR26_CMDAGE(base) ((DDR_CR26_REG(base) & DDR_CR26_CMDAGE_MASK) >> DDR_CR26_CMDAGE_SHIFT)
#define DDR_BRD_CR26_CMDAGE(base) (DDR_RD_CR26_CMDAGE(base))

/*! @brief Set the CMDAGE field to a new value. */
#define DDR_WR_CR26_CMDAGE(base, value) (DDR_RMW_CR26(base, DDR_CR26_CMDAGE_MASK, DDR_CR26_CMDAGE(value)))
#define DDR_BWR_CR26_CMDAGE(base, value) (DDR_WR_CR26_CMDAGE(base, value))
/*@}*/

/*!
 * @name Register DDR_CR26, field ADDCOL[16] (RW)
 *
 * Enables address collision/data coherency detection as a condition when using
 * the placement logic to fill the command queue.
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR26_ADDCOL field. */
#define DDR_RD_CR26_ADDCOL(base) ((DDR_CR26_REG(base) & DDR_CR26_ADDCOL_MASK) >> DDR_CR26_ADDCOL_SHIFT)
#define DDR_BRD_CR26_ADDCOL(base) (BITBAND_ACCESS32(&DDR_CR26_REG(base), DDR_CR26_ADDCOL_SHIFT))

/*! @brief Set the ADDCOL field to a new value. */
#define DDR_WR_CR26_ADDCOL(base, value) (DDR_RMW_CR26(base, DDR_CR26_ADDCOL_MASK, DDR_CR26_ADDCOL(value)))
#define DDR_BWR_CR26_ADDCOL(base, value) (BITBAND_ACCESS32(&DDR_CR26_REG(base), DDR_CR26_ADDCOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR26, field BNKSPT[24] (RW)
 *
 * For command queue placement logic.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR26_BNKSPT field. */
#define DDR_RD_CR26_BNKSPT(base) ((DDR_CR26_REG(base) & DDR_CR26_BNKSPT_MASK) >> DDR_CR26_BNKSPT_SHIFT)
#define DDR_BRD_CR26_BNKSPT(base) (BITBAND_ACCESS32(&DDR_CR26_REG(base), DDR_CR26_BNKSPT_SHIFT))

/*! @brief Set the BNKSPT field to a new value. */
#define DDR_WR_CR26_BNKSPT(base, value) (DDR_RMW_CR26(base, DDR_CR26_BNKSPT_MASK, DDR_CR26_BNKSPT(value)))
#define DDR_BWR_CR26_BNKSPT(base, value) (BITBAND_ACCESS32(&DDR_CR26_REG(base), DDR_CR26_BNKSPT_SHIFT) = (value))
/*@}*/

