pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR27 - DDR Control Register 27
 ******************************************************************************/

/*!
 * @brief DDR_CR27 - DDR Control Register 27 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR27 register
 */
/*@{*/
#define DDR_RD_CR27(base)        (DDR_CR27_REG(base))
#define DDR_WR_CR27(base, value) (DDR_CR27_REG(base) = (value))
#define DDR_RMW_CR27(base, mask, value) (DDR_WR_CR27(base, (DDR_RD_CR27(base) & ~(mask)) | (value)))
#define DDR_SET_CR27(base, value) (DDR_WR_CR27(base, DDR_RD_CR27(base) |  (value)))
#define DDR_CLR_CR27(base, value) (DDR_WR_CR27(base, DDR_RD_CR27(base) & ~(value)))
#define DDR_TOG_CR27(base, value) (DDR_WR_CR27(base, DDR_RD_CR27(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR27 bitfields
 */

/*!
 * @name Register DDR_CR27, field PLEN[0] (RW)
 *
 * Enable placement logic to fill the command queue.
 *
 * Values:
 * - 0 - Disabled. The command queue is a straight FIFO.
 * - 1 - Enabled. The command queue is filled according to the placement logic
 *     factors.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR27_PLEN field. */
#define DDR_RD_CR27_PLEN(base) ((DDR_CR27_REG(base) & DDR_CR27_PLEN_MASK) >> DDR_CR27_PLEN_SHIFT)
#define DDR_BRD_CR27_PLEN(base) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_PLEN_SHIFT))

/*! @brief Set the PLEN field to a new value. */
#define DDR_WR_CR27_PLEN(base, value) (DDR_RMW_CR27(base, DDR_CR27_PLEN_MASK, DDR_CR27_PLEN(value)))
#define DDR_BWR_CR27_PLEN(base, value) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_PLEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR27, field PRIEN[8] (RW)
 *
 * Enable priority for command queue placement logic.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR27_PRIEN field. */
#define DDR_RD_CR27_PRIEN(base) ((DDR_CR27_REG(base) & DDR_CR27_PRIEN_MASK) >> DDR_CR27_PRIEN_SHIFT)
#define DDR_BRD_CR27_PRIEN(base) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_PRIEN_SHIFT))

/*! @brief Set the PRIEN field to a new value. */
#define DDR_WR_CR27_PRIEN(base, value) (DDR_RMW_CR27(base, DDR_CR27_PRIEN_MASK, DDR_CR27_PRIEN(value)))
#define DDR_BWR_CR27_PRIEN(base, value) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_PRIEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR27, field RWEN[16] (RW)
 *
 * Enable read/write grouping for command queue placement logic.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR27_RWEN field. */
#define DDR_RD_CR27_RWEN(base) ((DDR_CR27_REG(base) & DDR_CR27_RWEN_MASK) >> DDR_CR27_RWEN_SHIFT)
#define DDR_BRD_CR27_RWEN(base) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_RWEN_SHIFT))

/*! @brief Set the RWEN field to a new value. */
#define DDR_WR_CR27_RWEN(base, value) (DDR_RMW_CR27(base, DDR_CR27_RWEN_MASK, DDR_CR27_RWEN(value)))
#define DDR_BWR_CR27_RWEN(base, value) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_RWEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR27, field SWPEN[24] (RW)
 *
 * Enables swapping of the active command for a new higher-priority command when
 * using the placement logic.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR27_SWPEN field. */
#define DDR_RD_CR27_SWPEN(base) ((DDR_CR27_REG(base) & DDR_CR27_SWPEN_MASK) >> DDR_CR27_SWPEN_SHIFT)
#define DDR_BRD_CR27_SWPEN(base) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_SWPEN_SHIFT))

/*! @brief Set the SWPEN field to a new value. */
#define DDR_WR_CR27_SWPEN(base, value) (DDR_RMW_CR27(base, DDR_CR27_SWPEN_MASK, DDR_CR27_SWPEN(value)))
#define DDR_BWR_CR27_SWPEN(base, value) (BITBAND_ACCESS32(&DDR_CR27_REG(base), DDR_CR27_SWPEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR28 - DDR Control Register 28
 ******************************************************************************/

/*!
 * @brief DDR_CR28 - DDR Control Register 28 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR28 register
 */
/*@{*/
#define DDR_RD_CR28(base)        (DDR_CR28_REG(base))
#define DDR_WR_CR28(base, value) (DDR_CR28_REG(base) = (value))
#define DDR_RMW_CR28(base, mask, value) (DDR_WR_CR28(base, (DDR_RD_CR28(base) & ~(mask)) | (value)))
#define DDR_SET_CR28(base, value) (DDR_WR_CR28(base, DDR_RD_CR28(base) |  (value)))
#define DDR_CLR_CR28(base, value) (DDR_WR_CR28(base, DDR_RD_CR28(base) & ~(value)))
#define DDR_TOG_CR28(base, value) (DDR_WR_CR28(base, DDR_RD_CR28(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR28 bitfields
 */

/*!
 * @name Register DDR_CR28, field CSMAP[0] (RW)
 *
 * Defines if the chip select is enabled. 0 Chip select disabled 1 Chip select
 * enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR28_CSMAP field. */
#define DDR_RD_CR28_CSMAP(base) ((DDR_CR28_REG(base) & DDR_CR28_CSMAP_MASK) >> DDR_CR28_CSMAP_SHIFT)
#define DDR_BRD_CR28_CSMAP(base) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_CSMAP_SHIFT))

/*! @brief Set the CSMAP field to a new value. */
#define DDR_WR_CR28_CSMAP(base, value) (DDR_RMW_CR28(base, DDR_CR28_CSMAP_MASK, DDR_CR28_CSMAP(value)))
#define DDR_BWR_CR28_CSMAP(base, value) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_CSMAP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR28, field REDUC[8] (RW)
 *
 * Controls the width of the memory datapath. The entire user datapath is used
 * regardless of this setting. When operating in half datapath mode, only burst
 * length value of 4 and 8 are supported.
 *
 * Values:
 * - 0 - 16-bit - standard operation using full memory bus
 * - 1 - 8-bit - Memory datapath width is half of the maximum size. The upper
 *     half of the memory busses (DQ, DQS, and DM) are unused and relevant data
 *     only exists in the lower half of the busses.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR28_REDUC field. */
#define DDR_RD_CR28_REDUC(base) ((DDR_CR28_REG(base) & DDR_CR28_REDUC_MASK) >> DDR_CR28_REDUC_SHIFT)
#define DDR_BRD_CR28_REDUC(base) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_REDUC_SHIFT))

/*! @brief Set the REDUC field to a new value. */
#define DDR_WR_CR28_REDUC(base, value) (DDR_RMW_CR28(base, DDR_CR28_REDUC_MASK, DDR_CR28_REDUC(value)))
#define DDR_BWR_CR28_REDUC(base, value) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_REDUC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR28, field BIGEND[16] (RW)
 *
 * Set byte ordering as little endian or big endian.
 *
 * Values:
 * - 0 - Little endian
 * - 1 - Big endian
 */
/*@{*/
/*! @brief Read current value of the DDR_CR28_BIGEND field. */
#define DDR_RD_CR28_BIGEND(base) ((DDR_CR28_REG(base) & DDR_CR28_BIGEND_MASK) >> DDR_CR28_BIGEND_SHIFT)
#define DDR_BRD_CR28_BIGEND(base) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_BIGEND_SHIFT))

