pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the BIGEND field to a new value. */
#define DDR_WR_CR28_BIGEND(base, value) (DDR_RMW_CR28(base, DDR_CR28_BIGEND_MASK, DDR_CR28_BIGEND(value)))
#define DDR_BWR_CR28_BIGEND(base, value) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_BIGEND_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR28, field CMDLATR[24] (RW)
 *
 * Enable latency reduction within I/O cells of the PHY.
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR28_CMDLATR field. */
#define DDR_RD_CR28_CMDLATR(base) ((DDR_CR28_REG(base) & DDR_CR28_CMDLATR_MASK) >> DDR_CR28_CMDLATR_SHIFT)
#define DDR_BRD_CR28_CMDLATR(base) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_CMDLATR_SHIFT))

/*! @brief Set the CMDLATR field to a new value. */
#define DDR_WR_CR28_CMDLATR(base, value) (DDR_RMW_CR28(base, DDR_CR28_CMDLATR_MASK, DDR_CR28_CMDLATR(value)))
#define DDR_BWR_CR28_CMDLATR(base, value) (BITBAND_ACCESS32(&DDR_CR28_REG(base), DDR_CR28_CMDLATR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR29 - DDR Control Register 29
 ******************************************************************************/

/*!
 * @brief DDR_CR29 - DDR Control Register 29 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR29 register
 */
/*@{*/
#define DDR_RD_CR29(base)        (DDR_CR29_REG(base))
#define DDR_WR_CR29(base, value) (DDR_CR29_REG(base) = (value))
#define DDR_RMW_CR29(base, mask, value) (DDR_WR_CR29(base, (DDR_RD_CR29(base) & ~(mask)) | (value)))
#define DDR_SET_CR29(base, value) (DDR_WR_CR29(base, DDR_RD_CR29(base) |  (value)))
#define DDR_CLR_CR29(base, value) (DDR_WR_CR29(base, DDR_RD_CR29(base) & ~(value)))
#define DDR_TOG_CR29(base, value) (DDR_WR_CR29(base, DDR_RD_CR29(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR29 bitfields
 */

/*!
 * @name Register DDR_CR29, field WRLATR[0] (RW)
 *
 * Enable latency reduction in data path within the I/O cells of the PHY.
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR29_WRLATR field. */
#define DDR_RD_CR29_WRLATR(base) ((DDR_CR29_REG(base) & DDR_CR29_WRLATR_MASK) >> DDR_CR29_WRLATR_SHIFT)
#define DDR_BRD_CR29_WRLATR(base) (BITBAND_ACCESS32(&DDR_CR29_REG(base), DDR_CR29_WRLATR_SHIFT))

/*! @brief Set the WRLATR field to a new value. */
#define DDR_WR_CR29_WRLATR(base, value) (DDR_RMW_CR29(base, DDR_CR29_WRLATR_MASK, DDR_CR29_WRLATR(value)))
#define DDR_BWR_CR29_WRLATR(base, value) (BITBAND_ACCESS32(&DDR_CR29_REG(base), DDR_CR29_WRLATR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR29, field FSTWR[8] (RW)
 *
 * Defines when write commands are issued to DRAM devices.
 *
 * Values:
 * - 0 - The memory controller issues a write command to the DRAM devices when
 *     it has received enough data for one DRAM burst. Write data can be sent in
 *     any cycle relative to the write command. This mode also allows for
 *     multi-word write command data to arrive in non-sequential cycles.
 * - 1 - The memory controller issues a write command to the DRAM devices after
 *     the first word of the write data is received by the memory controller. The
 *     first word can be sent at any time relative to the write command. In this
 *     mode, multi-word write command data must be available to the memory
 *     controller in sequential cycles.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR29_FSTWR field. */
#define DDR_RD_CR29_FSTWR(base) ((DDR_CR29_REG(base) & DDR_CR29_FSTWR_MASK) >> DDR_CR29_FSTWR_SHIFT)
#define DDR_BRD_CR29_FSTWR(base) (BITBAND_ACCESS32(&DDR_CR29_REG(base), DDR_CR29_FSTWR_SHIFT))

/*! @brief Set the FSTWR field to a new value. */
#define DDR_WR_CR29_FSTWR(base, value) (DDR_RMW_CR29(base, DDR_CR29_FSTWR_MASK, DDR_CR29_FSTWR(value)))
#define DDR_BWR_CR29_FSTWR(base, value) (BITBAND_ACCESS32(&DDR_CR29_REG(base), DDR_CR29_FSTWR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR29, field QFULL[17:16] (RW)
 *
 * Defines quantity of data that will be considered full for the command queue.
 * When this value is reached, the g_almost_full signal will be driven to the
 * user interface.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR29_QFULL field. */
#define DDR_RD_CR29_QFULL(base) ((DDR_CR29_REG(base) & DDR_CR29_QFULL_MASK) >> DDR_CR29_QFULL_SHIFT)
#define DDR_BRD_CR29_QFULL(base) (DDR_RD_CR29_QFULL(base))

/*! @brief Set the QFULL field to a new value. */
#define DDR_WR_CR29_QFULL(base, value) (DDR_RMW_CR29(base, DDR_CR29_QFULL_MASK, DDR_CR29_QFULL(value)))
#define DDR_BWR_CR29_QFULL(base, value) (DDR_WR_CR29_QFULL(base, value))
/*@}*/

/*!
 * @name Register DDR_CR29, field RESYNC[24] (WO)
 *
 * Initiate a DLL resync.
 *
 * Values:
 * - 0 - No effect
 * - 1 - Initiate
 */
/*@{*/
/*! @brief Set the RESYNC field to a new value. */
#define DDR_WR_CR29_RESYNC(base, value) (DDR_RMW_CR29(base, DDR_CR29_RESYNC_MASK, DDR_CR29_RESYNC(value)))
#define DDR_BWR_CR29_RESYNC(base, value) (DDR_WR_CR29_RESYNC(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR30 - DDR Control Register 30
 ******************************************************************************/

/*!
 * @brief DDR_CR30 - DDR Control Register 30 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR30 register
 */
/*@{*/
#define DDR_RD_CR30(base)        (DDR_CR30_REG(base))
#define DDR_WR_CR30(base, value) (DDR_CR30_REG(base) = (value))
#define DDR_RMW_CR30(base, mask, value) (DDR_WR_CR30(base, (DDR_RD_CR30(base) & ~(mask)) | (value)))
#define DDR_SET_CR30(base, value) (DDR_WR_CR30(base, DDR_RD_CR30(base) |  (value)))
#define DDR_CLR_CR30(base, value) (DDR_WR_CR30(base, DDR_RD_CR30(base) & ~(value)))
#define DDR_TOG_CR30(base, value) (DDR_WR_CR30(base, DDR_RD_CR30(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR30 bitfields
 */

/*!
 * @name Register DDR_CR30, field RSYNCRF[0] (RW)
 *
 * Enables automatic DLL resync after every refresh.
 *
 * Values:
 * - 0 - No effect
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR30_RSYNCRF field. */
#define DDR_RD_CR30_RSYNCRF(base) ((DDR_CR30_REG(base) & DDR_CR30_RSYNCRF_MASK) >> DDR_CR30_RSYNCRF_SHIFT)
#define DDR_BRD_CR30_RSYNCRF(base) (BITBAND_ACCESS32(&DDR_CR30_REG(base), DDR_CR30_RSYNCRF_SHIFT))

