pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the RSYNCRF field to a new value. */
#define DDR_WR_CR30_RSYNCRF(base, value) (DDR_RMW_CR30(base, DDR_CR30_RSYNCRF_MASK, DDR_CR30_RSYNCRF(value)))
#define DDR_BWR_CR30_RSYNCRF(base, value) (BITBAND_ACCESS32(&DDR_CR30_REG(base), DDR_CR30_RSYNCRF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR30, field INTSTAT[16:8] (RO)
 *
 * Status of interrupt features in the controller. Bit[16]: Logical OR of
 * INTSTATUS[7:0] Bit[15]: User-initiated DLL resync is finished Bit[14]:
 * dfi_int_complete state change detected Bit[13]: Indicates that a register interface mode
 * register write has finished and that another register interface mode register
 * write may be issued Bit[12]: ODT enabled and CAS Latency 3 programmed error
 * detected. This is an unsupported programming option Bit[11]: Both DDR2 and Mobile
 * modes have been enabled Bit[10]: DRAM initialization complete Bit[9]: Multiple
 * accesses outside the defined physical memory space detected Bit[8]: A single
 * access outside the defined physical memory space detected
 */
/*@{*/
/*! @brief Read current value of the DDR_CR30_INTSTAT field. */
#define DDR_RD_CR30_INTSTAT(base) ((DDR_CR30_REG(base) & DDR_CR30_INTSTAT_MASK) >> DDR_CR30_INTSTAT_SHIFT)
#define DDR_BRD_CR30_INTSTAT(base) (DDR_RD_CR30_INTSTAT(base))
/*@}*/

/*!
 * @name Register DDR_CR30, field INTACK[31:24] (WORZ)
 *
 * Clear the INTSTATUS parameter. This parameter will always read back as 0x0.
 *
 * Values:
 * - 0 - No effect
 * - 1 - Clear the corresponding bit in INTSTATUS
 */
/*@{*/
/*! @brief Set the INTACK field to a new value. */
#define DDR_WR_CR30_INTACK(base, value) (DDR_RMW_CR30(base, DDR_CR30_INTACK_MASK, DDR_CR30_INTACK(value)))
#define DDR_BWR_CR30_INTACK(base, value) (DDR_WR_CR30_INTACK(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR31 - DDR Control Register 31
 ******************************************************************************/

/*!
 * @brief DDR_CR31 - DDR Control Register 31 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR31 register
 */
/*@{*/
#define DDR_RD_CR31(base)        (DDR_CR31_REG(base))
#define DDR_WR_CR31(base, value) (DDR_CR31_REG(base) = (value))
#define DDR_RMW_CR31(base, mask, value) (DDR_WR_CR31(base, (DDR_RD_CR31(base) & ~(mask)) | (value)))
#define DDR_SET_CR31(base, value) (DDR_WR_CR31(base, DDR_RD_CR31(base) |  (value)))
#define DDR_CLR_CR31(base, value) (DDR_WR_CR31(base, DDR_RD_CR31(base) & ~(value)))
#define DDR_TOG_CR31(base, value) (DDR_WR_CR31(base, DDR_RD_CR31(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR31 bitfields
 */

/*!
 * @name Register DDR_CR31, field INTMASK[8:0] (RW)
 *
 * Masks for controller interrupt signals from the INTSTATUS parameter.
 *
 * Values:
 * - 0 - No mask
 * - 1 - Mask corresponding interrupt signal
 */
/*@{*/
/*! @brief Read current value of the DDR_CR31_INTMASK field. */
#define DDR_RD_CR31_INTMASK(base) ((DDR_CR31_REG(base) & DDR_CR31_INTMASK_MASK) >> DDR_CR31_INTMASK_SHIFT)
#define DDR_BRD_CR31_INTMASK(base) (DDR_RD_CR31_INTMASK(base))

/*! @brief Set the INTMASK field to a new value. */
#define DDR_WR_CR31_INTMASK(base, value) (DDR_RMW_CR31(base, DDR_CR31_INTMASK_MASK, DDR_CR31_INTMASK(value)))
#define DDR_BWR_CR31_INTMASK(base, value) (DDR_WR_CR31_INTMASK(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR32 - DDR Control Register 32
 ******************************************************************************/

/*!
 * @brief DDR_CR32 - DDR Control Register 32 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR32 register
 */
/*@{*/
#define DDR_RD_CR32(base)        (DDR_CR32_REG(base))
/*@}*/

/*******************************************************************************
 * DDR_CR33 - DDR Control Register 33
 ******************************************************************************/

/*!
 * @brief DDR_CR33 - DDR Control Register 33 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR33 register
 */
/*@{*/
#define DDR_RD_CR33(base)        (DDR_CR33_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR33 bitfields
 */

/*!
 * @name Register DDR_CR33, field OORLEN[9:0] (RO)
 *
 * Length of command that caused an out-of-range interrupt request.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR33_OORLEN field. */
#define DDR_RD_CR33_OORLEN(base) ((DDR_CR33_REG(base) & DDR_CR33_OORLEN_MASK) >> DDR_CR33_OORLEN_SHIFT)
#define DDR_BRD_CR33_OORLEN(base) (DDR_RD_CR33_OORLEN(base))
/*@}*/

/*!
 * @name Register DDR_CR33, field OORTYP[21:16] (RO)
 *
 * Type of command that caused an out-of-range interrupt request.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR33_OORTYP field. */
#define DDR_RD_CR33_OORTYP(base) ((DDR_CR33_REG(base) & DDR_CR33_OORTYP_MASK) >> DDR_CR33_OORTYP_SHIFT)
#define DDR_BRD_CR33_OORTYP(base) (DDR_RD_CR33_OORTYP(base))
/*@}*/

/*!
 * @name Register DDR_CR33, field OORID[25:24] (RO)
 *
 * Source ID of the command that caused an out-of-range interrupt request.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR33_OORID field. */
#define DDR_RD_CR33_OORID(base) ((DDR_CR33_REG(base) & DDR_CR33_OORID_MASK) >> DDR_CR33_OORID_SHIFT)
#define DDR_BRD_CR33_OORID(base) (DDR_RD_CR33_OORID(base))
/*@}*/

/*******************************************************************************
 * DDR_CR34 - DDR Control Register 34
 ******************************************************************************/

/*!
 * @brief DDR_CR34 - DDR Control Register 34 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR34 register
 */
/*@{*/
#define DDR_RD_CR34(base)        (DDR_CR34_REG(base))
#define DDR_WR_CR34(base, value) (DDR_CR34_REG(base) = (value))
#define DDR_RMW_CR34(base, mask, value) (DDR_WR_CR34(base, (DDR_RD_CR34(base) & ~(mask)) | (value)))
#define DDR_SET_CR34(base, value) (DDR_WR_CR34(base, DDR_RD_CR34(base) |  (value)))
#define DDR_CLR_CR34(base, value) (DDR_WR_CR34(base, DDR_RD_CR34(base) & ~(value)))
#define DDR_TOG_CR34(base, value) (DDR_WR_CR34(base, DDR_RD_CR34(base) ^  (value)))
/*@}*/

