pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR34 bitfields
 */

/*!
 * @name Register DDR_CR34, field ODTRDC[0] (RW)
 *
 * Determines if the chip select has termination when a read occurs on the chip
 * select . 0 Reserved ODT termination when CS performs a read 1 CS has active
 * ODT termination when CS performs a read
 */
/*@{*/
/*! @brief Read current value of the DDR_CR34_ODTRDC field. */
#define DDR_RD_CR34_ODTRDC(base) ((DDR_CR34_REG(base) & DDR_CR34_ODTRDC_MASK) >> DDR_CR34_ODTRDC_SHIFT)
#define DDR_BRD_CR34_ODTRDC(base) (BITBAND_ACCESS32(&DDR_CR34_REG(base), DDR_CR34_ODTRDC_SHIFT))

/*! @brief Set the ODTRDC field to a new value. */
#define DDR_WR_CR34_ODTRDC(base, value) (DDR_RMW_CR34(base, DDR_CR34_ODTRDC_MASK, DDR_CR34_ODTRDC(value)))
#define DDR_BWR_CR34_ODTRDC(base, value) (BITBAND_ACCESS32(&DDR_CR34_REG(base), DDR_CR34_ODTRDC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR34, field ODTWRCS[8] (RW)
 *
 * Determines if the chip select has termination when a write occurs on the chip
 * select . 0 No ODT termination when CS performs a write 1 CS has active ODT
 * termination when CS performs a write
 */
/*@{*/
/*! @brief Read current value of the DDR_CR34_ODTWRCS field. */
#define DDR_RD_CR34_ODTWRCS(base) ((DDR_CR34_REG(base) & DDR_CR34_ODTWRCS_MASK) >> DDR_CR34_ODTWRCS_SHIFT)
#define DDR_BRD_CR34_ODTWRCS(base) (BITBAND_ACCESS32(&DDR_CR34_REG(base), DDR_CR34_ODTWRCS_SHIFT))

/*! @brief Set the ODTWRCS field to a new value. */
#define DDR_WR_CR34_ODTWRCS(base, value) (DDR_RMW_CR34(base, DDR_CR34_ODTWRCS_MASK, DDR_CR34_ODTWRCS(value)))
#define DDR_BWR_CR34_ODTWRCS(base, value) (BITBAND_ACCESS32(&DDR_CR34_REG(base), DDR_CR34_ODTWRCS_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR35 - DDR Control Register 35
 ******************************************************************************/

/*!
 * @brief DDR_CR35 - DDR Control Register 35 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR35 register
 */
/*@{*/
#define DDR_RD_CR35(base)        (DDR_CR35_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR35 bitfields
 */

/*!
 * @name Register DDR_CR35, field R2WSMCS[3:0] (RO)
 *
 * Additional clocks of delay to insert between RD and WR transaction types to
 * chip select to meet ODT timing requirements.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR35_R2WSMCS field. */
#define DDR_RD_CR35_R2WSMCS(base) ((DDR_CR35_REG(base) & DDR_CR35_R2WSMCS_MASK) >> DDR_CR35_R2WSMCS_SHIFT)
#define DDR_BRD_CR35_R2WSMCS(base) (DDR_RD_CR35_R2WSMCS(base))
/*@}*/

/*!
 * @name Register DDR_CR35, field W2RSMCS[11:8] (RO)
 *
 * Additional clocks of delay to insert between WR and RD transaction types to
 * chip select to meet ODT timing requirements.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR35_W2RSMCS field. */
#define DDR_RD_CR35_W2RSMCS(base) ((DDR_CR35_REG(base) & DDR_CR35_W2RSMCS_MASK) >> DDR_CR35_W2RSMCS_SHIFT)
#define DDR_BRD_CR35_W2RSMCS(base) (DDR_RD_CR35_W2RSMCS(base))
/*@}*/

/*******************************************************************************
 * DDR_CR36 - DDR Control Register 36
 ******************************************************************************/

/*!
 * @brief DDR_CR36 - DDR Control Register 36 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR36 register
 */
/*@{*/
#define DDR_RD_CR36(base)        (DDR_CR36_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR36 bitfields
 */

/*!
 * @name Register DDR_CR36, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR36_Not_Used field. */
#define DDR_RD_CR36_Not_Used(base) ((DDR_CR36_REG(base) & DDR_CR36_Not_Used_MASK) >> DDR_CR36_Not_Used_SHIFT)
#define DDR_BRD_CR36_Not_Used(base) (DDR_RD_CR36_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR36, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR36_NOT_USED field. */
#define DDR_RD_CR36_NOT_USED(base) ((DDR_CR36_REG(base) & DDR_CR36_NOT_USED_MASK) >> DDR_CR36_NOT_USED_SHIFT)
#define DDR_BRD_CR36_NOT_USED(base) (DDR_RD_CR36_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR37 - DDR Control Register 37
 ******************************************************************************/

/*!
 * @brief DDR_CR37 - DDR Control Register 37 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR37 register
 */
/*@{*/
#define DDR_RD_CR37(base)        (DDR_CR37_REG(base))
#define DDR_WR_CR37(base, value) (DDR_CR37_REG(base) = (value))
#define DDR_RMW_CR37(base, mask, value) (DDR_WR_CR37(base, (DDR_RD_CR37(base) & ~(mask)) | (value)))
#define DDR_SET_CR37(base, value) (DDR_WR_CR37(base, DDR_RD_CR37(base) |  (value)))
#define DDR_CLR_CR37(base, value) (DDR_WR_CR37(base, DDR_RD_CR37(base) & ~(value)))
#define DDR_TOG_CR37(base, value) (DDR_WR_CR37(base, DDR_RD_CR37(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR37 bitfields
 */

/*!
 * @name Register DDR_CR37, field R2RSAME[2:0] (RW)
 *
 * Additional clocks of delay to insert between reads and reads to the chip
 * select.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR37_R2RSAME field. */
#define DDR_RD_CR37_R2RSAME(base) ((DDR_CR37_REG(base) & DDR_CR37_R2RSAME_MASK) >> DDR_CR37_R2RSAME_SHIFT)
#define DDR_BRD_CR37_R2RSAME(base) (DDR_RD_CR37_R2RSAME(base))

/*! @brief Set the R2RSAME field to a new value. */
#define DDR_WR_CR37_R2RSAME(base, value) (DDR_RMW_CR37(base, DDR_CR37_R2RSAME_MASK, DDR_CR37_R2RSAME(value)))
#define DDR_BWR_CR37_R2RSAME(base, value) (DDR_WR_CR37_R2RSAME(base, value))
/*@}*/

/*!
 * @name Register DDR_CR37, field R2WSAME[10:8] (RW)
 *
 * Additional clocks of delay to insert between reads and writes to the chip
 * select.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR37_R2WSAME field. */
#define DDR_RD_CR37_R2WSAME(base) ((DDR_CR37_REG(base) & DDR_CR37_R2WSAME_MASK) >> DDR_CR37_R2WSAME_SHIFT)
#define DDR_BRD_CR37_R2WSAME(base) (DDR_RD_CR37_R2WSAME(base))

/*! @brief Set the R2WSAME field to a new value. */
#define DDR_WR_CR37_R2WSAME(base, value) (DDR_RMW_CR37(base, DDR_CR37_R2WSAME_MASK, DDR_CR37_R2WSAME(value)))
#define DDR_BWR_CR37_R2WSAME(base, value) (DDR_WR_CR37_R2WSAME(base, value))
/*@}*/

/*!
 * @name Register DDR_CR37, field W2RSAME[18:16] (RW)
 *
 * Additional clocks of delay to insert between writes and reads to the chip
 * select.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR37_W2RSAME field. */
#define DDR_RD_CR37_W2RSAME(base) ((DDR_CR37_REG(base) & DDR_CR37_W2RSAME_MASK) >> DDR_CR37_W2RSAME_SHIFT)
#define DDR_BRD_CR37_W2RSAME(base) (DDR_RD_CR37_W2RSAME(base))

/*! @brief Set the W2RSAME field to a new value. */
#define DDR_WR_CR37_W2RSAME(base, value) (DDR_RMW_CR37(base, DDR_CR37_W2RSAME_MASK, DDR_CR37_W2RSAME(value)))
#define DDR_BWR_CR37_W2RSAME(base, value) (DDR_WR_CR37_W2RSAME(base, value))
/*@}*/

/*!
 * @name Register DDR_CR37, field W2WSAME[26:24] (RW)
 *
 * Additional clocks of delay to insert between writes and writes to the chip
 * select.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR37_W2WSAME field. */
#define DDR_RD_CR37_W2WSAME(base) ((DDR_CR37_REG(base) & DDR_CR37_W2WSAME_MASK) >> DDR_CR37_W2WSAME_SHIFT)
#define DDR_BRD_CR37_W2WSAME(base) (DDR_RD_CR37_W2WSAME(base))

/*! @brief Set the W2WSAME field to a new value. */
#define DDR_WR_CR37_W2WSAME(base, value) (DDR_RMW_CR37(base, DDR_CR37_W2WSAME_MASK, DDR_CR37_W2WSAME(value)))
#define DDR_BWR_CR37_W2WSAME(base, value) (DDR_WR_CR37_W2WSAME(base, value))
/*@}*/

