pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR38 - DDR Control Register 38
 ******************************************************************************/

/*!
 * @brief DDR_CR38 - DDR Control Register 38 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR38 register
 */
/*@{*/
#define DDR_RD_CR38(base)        (DDR_CR38_REG(base))
#define DDR_WR_CR38(base, value) (DDR_CR38_REG(base) = (value))
#define DDR_RMW_CR38(base, mask, value) (DDR_WR_CR38(base, (DDR_RD_CR38(base) & ~(mask)) | (value)))
#define DDR_SET_CR38(base, value) (DDR_WR_CR38(base, DDR_RD_CR38(base) |  (value)))
#define DDR_CLR_CR38(base, value) (DDR_WR_CR38(base, DDR_RD_CR38(base) & ~(value)))
#define DDR_TOG_CR38(base, value) (DDR_WR_CR38(base, DDR_RD_CR38(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR38 bitfields
 */

/*!
 * @name Register DDR_CR38, field PDNCS[4:0] (RW)
 *
 * Off-chip driver (OCD) pull-down adjustment setting for DRAMs for the chip
 * select . The memory controller issues OCD adjustment commands during power-up.
 * Bit[4] 0 Decrement OCD settings 1 Increment OCD settings Bit[3:0] Number of OCD
 * adjustment commands to issue
 */
/*@{*/
/*! @brief Read current value of the DDR_CR38_PDNCS field. */
#define DDR_RD_CR38_PDNCS(base) ((DDR_CR38_REG(base) & DDR_CR38_PDNCS_MASK) >> DDR_CR38_PDNCS_SHIFT)
#define DDR_BRD_CR38_PDNCS(base) (DDR_RD_CR38_PDNCS(base))

/*! @brief Set the PDNCS field to a new value. */
#define DDR_WR_CR38_PDNCS(base, value) (DDR_RMW_CR38(base, DDR_CR38_PDNCS_MASK, DDR_CR38_PDNCS(value)))
#define DDR_BWR_CR38_PDNCS(base, value) (DDR_WR_CR38_PDNCS(base, value))
/*@}*/

/*!
 * @name Register DDR_CR38, field PUPCS[12:8] (RW)
 *
 * Off-chip driver (OCD) pull-up adjustment setting for DRAMs for the chip
 * select . The memory controller issues OCD adjustment commands during power-up.
 * Bit[12] 0 Decrement OCD settings 1 Increment OCD settings Bit[11:8] Number of OCD
 * adjustment commands to issue
 */
/*@{*/
/*! @brief Read current value of the DDR_CR38_PUPCS field. */
#define DDR_RD_CR38_PUPCS(base) ((DDR_CR38_REG(base) & DDR_CR38_PUPCS_MASK) >> DDR_CR38_PUPCS_SHIFT)
#define DDR_BRD_CR38_PUPCS(base) (DDR_RD_CR38_PUPCS(base))

/*! @brief Set the PUPCS field to a new value. */
#define DDR_WR_CR38_PUPCS(base, value) (DDR_RMW_CR38(base, DDR_CR38_PUPCS_MASK, DDR_CR38_PUPCS(value)))
#define DDR_BWR_CR38_PUPCS(base, value) (DDR_WR_CR38_PUPCS(base, value))
/*@}*/

/*!
 * @name Register DDR_CR38, field PWRCNT[26:16] (RW)
 *
 * Number of bytes for INCR write command on port 0. The logic subdivides an
 * INCR request into memory controller core commands of the size of this parameter.
 * The logic continues sending bursts of this size as the previous request is
 * transmitted by the port. If the INCR command is terminated on an unnatural
 * boundary, the logic discards the unnecessary words. The value defined in this
 * parameter must be a multiple of four . Clearing this parameter causes the port to
 * issue commands of zero length to the memory controller core, which the core
 * interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR38_PWRCNT field. */
#define DDR_RD_CR38_PWRCNT(base) ((DDR_CR38_REG(base) & DDR_CR38_PWRCNT_MASK) >> DDR_CR38_PWRCNT_SHIFT)
#define DDR_BRD_CR38_PWRCNT(base) (DDR_RD_CR38_PWRCNT(base))

/*! @brief Set the PWRCNT field to a new value. */
#define DDR_WR_CR38_PWRCNT(base, value) (DDR_RMW_CR38(base, DDR_CR38_PWRCNT_MASK, DDR_CR38_PWRCNT(value)))
#define DDR_BWR_CR38_PWRCNT(base, value) (DDR_WR_CR38_PWRCNT(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR39 - DDR Control Register 39
 ******************************************************************************/

/*!
 * @brief DDR_CR39 - DDR Control Register 39 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR39 register
 */
/*@{*/
#define DDR_RD_CR39(base)        (DDR_CR39_REG(base))
#define DDR_WR_CR39(base, value) (DDR_CR39_REG(base) = (value))
#define DDR_RMW_CR39(base, mask, value) (DDR_WR_CR39(base, (DDR_RD_CR39(base) & ~(mask)) | (value)))
#define DDR_SET_CR39(base, value) (DDR_WR_CR39(base, DDR_RD_CR39(base) |  (value)))
#define DDR_CLR_CR39(base, value) (DDR_WR_CR39(base, DDR_RD_CR39(base) & ~(value)))
#define DDR_TOG_CR39(base, value) (DDR_WR_CR39(base, DDR_RD_CR39(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR39 bitfields
 */

/*!
 * @name Register DDR_CR39, field P0RDCNT[10:0] (RW)
 *
 * Number of bytes for INCR read command on port 0. The logic subdivides an INCR
 * request into memory controller core commands of the size of this parameter.
 * The logic continues requesting bursts of this size as soon as the previous
 * request is received by the crossbar port. If the INCR command is terminated on an
 * unnatural boundary, the logic discards the unnecessary words. The value
 * defined in this parameter must be a multiple of four . Clearing this parameter
 * causes the port to issue commands of zero length to the memory controller core,
 * which the core interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR39_P0RDCNT field. */
#define DDR_RD_CR39_P0RDCNT(base) ((DDR_CR39_REG(base) & DDR_CR39_P0RDCNT_MASK) >> DDR_CR39_P0RDCNT_SHIFT)
#define DDR_BRD_CR39_P0RDCNT(base) (DDR_RD_CR39_P0RDCNT(base))

/*! @brief Set the P0RDCNT field to a new value. */
#define DDR_WR_CR39_P0RDCNT(base, value) (DDR_RMW_CR39(base, DDR_CR39_P0RDCNT_MASK, DDR_CR39_P0RDCNT(value)))
#define DDR_BWR_CR39_P0RDCNT(base, value) (DDR_WR_CR39_P0RDCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR39, field RP0[17:16] (RW)
 *
 * Sets port 0 read command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR39_RP0 field. */
#define DDR_RD_CR39_RP0(base) ((DDR_CR39_REG(base) & DDR_CR39_RP0_MASK) >> DDR_CR39_RP0_SHIFT)
#define DDR_BRD_CR39_RP0(base) (DDR_RD_CR39_RP0(base))

