pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the RP0 field to a new value. */
#define DDR_WR_CR39_RP0(base, value) (DDR_RMW_CR39(base, DDR_CR39_RP0_MASK, DDR_CR39_RP0(value)))
#define DDR_BWR_CR39_RP0(base, value) (DDR_WR_CR39_RP0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR39, field WP0[25:24] (RW)
 *
 * Sets port 0 write command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR39_WP0 field. */
#define DDR_RD_CR39_WP0(base) ((DDR_CR39_REG(base) & DDR_CR39_WP0_MASK) >> DDR_CR39_WP0_SHIFT)
#define DDR_BRD_CR39_WP0(base) (DDR_RD_CR39_WP0(base))

/*! @brief Set the WP0 field to a new value. */
#define DDR_WR_CR39_WP0(base, value) (DDR_RMW_CR39(base, DDR_CR39_WP0_MASK, DDR_CR39_WP0(value)))
#define DDR_BWR_CR39_WP0(base, value) (DDR_WR_CR39_WP0(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR40 - DDR Control Register 40
 ******************************************************************************/

/*!
 * @brief DDR_CR40 - DDR Control Register 40 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR40 register
 */
/*@{*/
#define DDR_RD_CR40(base)        (DDR_CR40_REG(base))
#define DDR_WR_CR40(base, value) (DDR_CR40_REG(base) = (value))
#define DDR_RMW_CR40(base, mask, value) (DDR_WR_CR40(base, (DDR_RD_CR40(base) & ~(mask)) | (value)))
#define DDR_SET_CR40(base, value) (DDR_WR_CR40(base, DDR_RD_CR40(base) |  (value)))
#define DDR_CLR_CR40(base, value) (DDR_WR_CR40(base, DDR_RD_CR40(base) & ~(value)))
#define DDR_TOG_CR40(base, value) (DDR_WR_CR40(base, DDR_RD_CR40(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR40 bitfields
 */

/*!
 * @name Register DDR_CR40, field P0TYP[1:0] (RW)
 *
 * Clock domain relativity between port 0 and the controller core. 00
 * Asynchronous 01 Reserved 01 Reserved 11 Synchronous
 */
/*@{*/
/*! @brief Read current value of the DDR_CR40_P0TYP field. */
#define DDR_RD_CR40_P0TYP(base) ((DDR_CR40_REG(base) & DDR_CR40_P0TYP_MASK) >> DDR_CR40_P0TYP_SHIFT)
#define DDR_BRD_CR40_P0TYP(base) (DDR_RD_CR40_P0TYP(base))

/*! @brief Set the P0TYP field to a new value. */
#define DDR_WR_CR40_P0TYP(base, value) (DDR_RMW_CR40(base, DDR_CR40_P0TYP_MASK, DDR_CR40_P0TYP(value)))
#define DDR_BWR_CR40_P0TYP(base, value) (DDR_WR_CR40_P0TYP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR40, field P1WRCNT[18:8] (RW)
 *
 * Number of bytes for INCR write command on port 1. The logic subdivides an
 * INCR request into memory controller core commands of the size of this parameter.
 * The logic continues sending bursts of this size as the previous request is
 * transmitted by the crossbar port. If the INCR command is terminated on an
 * unnatural boundary, the logic discards the unnecessary words. The value defined in
 * this parameter must be a multiple of four . Clearing this parameter causes the
 * port to issue commands of zero length to the memory controller core, which the
 * core interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR40_P1WRCNT field. */
#define DDR_RD_CR40_P1WRCNT(base) ((DDR_CR40_REG(base) & DDR_CR40_P1WRCNT_MASK) >> DDR_CR40_P1WRCNT_SHIFT)
#define DDR_BRD_CR40_P1WRCNT(base) (DDR_RD_CR40_P1WRCNT(base))

/*! @brief Set the P1WRCNT field to a new value. */
#define DDR_WR_CR40_P1WRCNT(base, value) (DDR_RMW_CR40(base, DDR_CR40_P1WRCNT_MASK, DDR_CR40_P1WRCNT(value)))
#define DDR_BWR_CR40_P1WRCNT(base, value) (DDR_WR_CR40_P1WRCNT(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR41 - DDR Control Register 41
 ******************************************************************************/

/*!
 * @brief DDR_CR41 - DDR Control Register 41 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR41 register
 */
/*@{*/
#define DDR_RD_CR41(base)        (DDR_CR41_REG(base))
#define DDR_WR_CR41(base, value) (DDR_CR41_REG(base) = (value))
#define DDR_RMW_CR41(base, mask, value) (DDR_WR_CR41(base, (DDR_RD_CR41(base) & ~(mask)) | (value)))
#define DDR_SET_CR41(base, value) (DDR_WR_CR41(base, DDR_RD_CR41(base) |  (value)))
#define DDR_CLR_CR41(base, value) (DDR_WR_CR41(base, DDR_RD_CR41(base) & ~(value)))
#define DDR_TOG_CR41(base, value) (DDR_WR_CR41(base, DDR_RD_CR41(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR41 bitfields
 */

/*!
 * @name Register DDR_CR41, field P1RDCNT[10:0] (RW)
 *
 * Number of bytes for INCR read command on port 1. The logic subdivides an INCR
 * request into memory controller core commands of the size of this parameter.
 * The logic continues requesting bursts of this size as soon as the previous
 * request is received by the crossbar port. If the INCR command is terminated on an
 * unnatural boundary, the logic discards the unnecessary words. The value
 * defined in this parameter must be a multiple of four . Clearing this parameter
 * causes the port to issue commands of zero length to the controller core, which the
 * core interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR41_P1RDCNT field. */
#define DDR_RD_CR41_P1RDCNT(base) ((DDR_CR41_REG(base) & DDR_CR41_P1RDCNT_MASK) >> DDR_CR41_P1RDCNT_SHIFT)
#define DDR_BRD_CR41_P1RDCNT(base) (DDR_RD_CR41_P1RDCNT(base))

/*! @brief Set the P1RDCNT field to a new value. */
#define DDR_WR_CR41_P1RDCNT(base, value) (DDR_RMW_CR41(base, DDR_CR41_P1RDCNT_MASK, DDR_CR41_P1RDCNT(value)))
#define DDR_BWR_CR41_P1RDCNT(base, value) (DDR_WR_CR41_P1RDCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR41, field RP1[17:16] (RW)
 *
 * Sets the port 1 read command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR41_RP1 field. */
#define DDR_RD_CR41_RP1(base) ((DDR_CR41_REG(base) & DDR_CR41_RP1_MASK) >> DDR_CR41_RP1_SHIFT)
#define DDR_BRD_CR41_RP1(base) (DDR_RD_CR41_RP1(base))

/*! @brief Set the RP1 field to a new value. */
#define DDR_WR_CR41_RP1(base, value) (DDR_RMW_CR41(base, DDR_CR41_RP1_MASK, DDR_CR41_RP1(value)))
#define DDR_BWR_CR41_RP1(base, value) (DDR_WR_CR41_RP1(base, value))
/*@}*/

/*!
 * @name Register DDR_CR41, field WP1[25:24] (RW)
 *
 * Sets the port 1 write command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR41_WP1 field. */
#define DDR_RD_CR41_WP1(base) ((DDR_CR41_REG(base) & DDR_CR41_WP1_MASK) >> DDR_CR41_WP1_SHIFT)
#define DDR_BRD_CR41_WP1(base) (DDR_RD_CR41_WP1(base))

/*! @brief Set the WP1 field to a new value. */
#define DDR_WR_CR41_WP1(base, value) (DDR_RMW_CR41(base, DDR_CR41_WP1_MASK, DDR_CR41_WP1(value)))
#define DDR_BWR_CR41_WP1(base, value) (DDR_WR_CR41_WP1(base, value))
/*@}*/

