pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR42 - DDR Control Register 42
 ******************************************************************************/

/*!
 * @brief DDR_CR42 - DDR Control Register 42 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR42 register
 */
/*@{*/
#define DDR_RD_CR42(base)        (DDR_CR42_REG(base))
#define DDR_WR_CR42(base, value) (DDR_CR42_REG(base) = (value))
#define DDR_RMW_CR42(base, mask, value) (DDR_WR_CR42(base, (DDR_RD_CR42(base) & ~(mask)) | (value)))
#define DDR_SET_CR42(base, value) (DDR_WR_CR42(base, DDR_RD_CR42(base) |  (value)))
#define DDR_CLR_CR42(base, value) (DDR_WR_CR42(base, DDR_RD_CR42(base) & ~(value)))
#define DDR_TOG_CR42(base, value) (DDR_WR_CR42(base, DDR_RD_CR42(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR42 bitfields
 */

/*!
 * @name Register DDR_CR42, field P1TYP[1:0] (RW)
 *
 * Clock domain relativity between port 1 and the controller core. 00
 * Asynchronous 01 Reserved 01 Reserved 11 Synchronous
 */
/*@{*/
/*! @brief Read current value of the DDR_CR42_P1TYP field. */
#define DDR_RD_CR42_P1TYP(base) ((DDR_CR42_REG(base) & DDR_CR42_P1TYP_MASK) >> DDR_CR42_P1TYP_SHIFT)
#define DDR_BRD_CR42_P1TYP(base) (DDR_RD_CR42_P1TYP(base))

/*! @brief Set the P1TYP field to a new value. */
#define DDR_WR_CR42_P1TYP(base, value) (DDR_RMW_CR42(base, DDR_CR42_P1TYP_MASK, DDR_CR42_P1TYP(value)))
#define DDR_BWR_CR42_P1TYP(base, value) (DDR_WR_CR42_P1TYP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR42, field P2WRCNT[18:8] (RW)
 *
 * Number of bytes for INCR write command on port 2. The logic subdivides an
 * INCR request into memory controller core commands of the size of this parameter.
 * The logic continues sending bursts of this size as the previous request is
 * transmitted by the crossbar port. If the INCR command is terminated on an
 * unnatural boundary, the logic discards the unnecessary words. The value defined in
 * this parameter must be a multiple of four . Clearing this parameter causes the
 * port to issue commands of zero length to the memory controller core, which the
 * core interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR42_P2WRCNT field. */
#define DDR_RD_CR42_P2WRCNT(base) ((DDR_CR42_REG(base) & DDR_CR42_P2WRCNT_MASK) >> DDR_CR42_P2WRCNT_SHIFT)
#define DDR_BRD_CR42_P2WRCNT(base) (DDR_RD_CR42_P2WRCNT(base))

/*! @brief Set the P2WRCNT field to a new value. */
#define DDR_WR_CR42_P2WRCNT(base, value) (DDR_RMW_CR42(base, DDR_CR42_P2WRCNT_MASK, DDR_CR42_P2WRCNT(value)))
#define DDR_BWR_CR42_P2WRCNT(base, value) (DDR_WR_CR42_P2WRCNT(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR43 - DDR Control Register 43
 ******************************************************************************/

/*!
 * @brief DDR_CR43 - DDR Control Register 43 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR43 register
 */
/*@{*/
#define DDR_RD_CR43(base)        (DDR_CR43_REG(base))
#define DDR_WR_CR43(base, value) (DDR_CR43_REG(base) = (value))
#define DDR_RMW_CR43(base, mask, value) (DDR_WR_CR43(base, (DDR_RD_CR43(base) & ~(mask)) | (value)))
#define DDR_SET_CR43(base, value) (DDR_WR_CR43(base, DDR_RD_CR43(base) |  (value)))
#define DDR_CLR_CR43(base, value) (DDR_WR_CR43(base, DDR_RD_CR43(base) & ~(value)))
#define DDR_TOG_CR43(base, value) (DDR_WR_CR43(base, DDR_RD_CR43(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR43 bitfields
 */

/*!
 * @name Register DDR_CR43, field P2RDCNT[10:0] (RW)
 *
 * Number of bytes for INCR read command on port 2. The logic subdivides an INCR
 * request into memory controller core commands of the size of this parameter.
 * The logic continues requesting bursts of this size as soon as the previous
 * request is received by the crossbar port. If the INCR command is terminated on an
 * unnatural boundary, the logic discards the unnecessary words. The value
 * defined in this parameter must be a multiple of four . Clearing this parameter
 * causes the port to issue commands of zero length to the controller core, which the
 * core interprets as the pre-configured value of 128 bytes.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR43_P2RDCNT field. */
#define DDR_RD_CR43_P2RDCNT(base) ((DDR_CR43_REG(base) & DDR_CR43_P2RDCNT_MASK) >> DDR_CR43_P2RDCNT_SHIFT)
#define DDR_BRD_CR43_P2RDCNT(base) (DDR_RD_CR43_P2RDCNT(base))

/*! @brief Set the P2RDCNT field to a new value. */
#define DDR_WR_CR43_P2RDCNT(base, value) (DDR_RMW_CR43(base, DDR_CR43_P2RDCNT_MASK, DDR_CR43_P2RDCNT(value)))
#define DDR_BWR_CR43_P2RDCNT(base, value) (DDR_WR_CR43_P2RDCNT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR43, field RP2[17:16] (RW)
 *
 * Sets the port 2 read command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR43_RP2 field. */
#define DDR_RD_CR43_RP2(base) ((DDR_CR43_REG(base) & DDR_CR43_RP2_MASK) >> DDR_CR43_RP2_SHIFT)
#define DDR_BRD_CR43_RP2(base) (DDR_RD_CR43_RP2(base))

/*! @brief Set the RP2 field to a new value. */
#define DDR_WR_CR43_RP2(base, value) (DDR_RMW_CR43(base, DDR_CR43_RP2_MASK, DDR_CR43_RP2(value)))
#define DDR_BWR_CR43_RP2(base, value) (DDR_WR_CR43_RP2(base, value))
/*@}*/

/*!
 * @name Register DDR_CR43, field WP2[25:24] (RW)
 *
 * Sets the port 2 write command priority.
 *
 * Values:
 * - 00 - Highest
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR43_WP2 field. */
#define DDR_RD_CR43_WP2(base) ((DDR_CR43_REG(base) & DDR_CR43_WP2_MASK) >> DDR_CR43_WP2_SHIFT)
#define DDR_BRD_CR43_WP2(base) (DDR_RD_CR43_WP2(base))

/*! @brief Set the WP2 field to a new value. */
#define DDR_WR_CR43_WP2(base, value) (DDR_RMW_CR43(base, DDR_CR43_WP2_MASK, DDR_CR43_WP2(value)))
#define DDR_BWR_CR43_WP2(base, value) (DDR_WR_CR43_WP2(base, value))
/*@}*/

