pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR44 - DDR Control Register 44
 ******************************************************************************/

/*!
 * @brief DDR_CR44 - DDR Control Register 44 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR44 register
 */
/*@{*/
#define DDR_RD_CR44(base)        (DDR_CR44_REG(base))
#define DDR_WR_CR44(base, value) (DDR_CR44_REG(base) = (value))
#define DDR_RMW_CR44(base, mask, value) (DDR_WR_CR44(base, (DDR_RD_CR44(base) & ~(mask)) | (value)))
#define DDR_SET_CR44(base, value) (DDR_WR_CR44(base, DDR_RD_CR44(base) |  (value)))
#define DDR_CLR_CR44(base, value) (DDR_WR_CR44(base, DDR_RD_CR44(base) & ~(value)))
#define DDR_TOG_CR44(base, value) (DDR_WR_CR44(base, DDR_RD_CR44(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR44 bitfields
 */

/*!
 * @name Register DDR_CR44, field P2TYP[1:0] (RW)
 *
 * Clock domain relativity between port 2 and the controller core. 00
 * Asynchronous 01 Reserved 01 Reserved 11 Synchronous
 */
/*@{*/
/*! @brief Read current value of the DDR_CR44_P2TYP field. */
#define DDR_RD_CR44_P2TYP(base) ((DDR_CR44_REG(base) & DDR_CR44_P2TYP_MASK) >> DDR_CR44_P2TYP_SHIFT)
#define DDR_BRD_CR44_P2TYP(base) (DDR_RD_CR44_P2TYP(base))

/*! @brief Set the P2TYP field to a new value. */
#define DDR_WR_CR44_P2TYP(base, value) (DDR_RMW_CR44(base, DDR_CR44_P2TYP_MASK, DDR_CR44_P2TYP(value)))
#define DDR_BWR_CR44_P2TYP(base, value) (DDR_WR_CR44_P2TYP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR44, field WRRLAT[8] (RW)
 *
 * Free-running or limited weighted-round-robin (WRR) latency control.
 *
 * Values:
 * - 0 - Free-running
 * - 1 - Limited
 */
/*@{*/
/*! @brief Read current value of the DDR_CR44_WRRLAT field. */
#define DDR_RD_CR44_WRRLAT(base) ((DDR_CR44_REG(base) & DDR_CR44_WRRLAT_MASK) >> DDR_CR44_WRRLAT_SHIFT)
#define DDR_BRD_CR44_WRRLAT(base) (BITBAND_ACCESS32(&DDR_CR44_REG(base), DDR_CR44_WRRLAT_SHIFT))

/*! @brief Set the WRRLAT field to a new value. */
#define DDR_WR_CR44_WRRLAT(base, value) (DDR_RMW_CR44(base, DDR_CR44_WRRLAT_MASK, DDR_CR44_WRRLAT(value)))
#define DDR_BWR_CR44_WRRLAT(base, value) (BITBAND_ACCESS32(&DDR_CR44_REG(base), DDR_CR44_WRRLAT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR44, field WRRSHARE[16] (RW)
 *
 * Per-port pair shared arbitration for weighted-round-robin (WRR). Port 2 is
 * treated independently from port 0 or port 1 for arbitration.
 *
 * Values:
 * - 0 - Port 0 and port 1 are treated independently for arbitration
 * - 1 - Port 0 and port 1 are grouped together for arbitration
 */
/*@{*/
/*! @brief Read current value of the DDR_CR44_WRRSHARE field. */
#define DDR_RD_CR44_WRRSHARE(base) ((DDR_CR44_REG(base) & DDR_CR44_WRRSHARE_MASK) >> DDR_CR44_WRRSHARE_SHIFT)
#define DDR_BRD_CR44_WRRSHARE(base) (BITBAND_ACCESS32(&DDR_CR44_REG(base), DDR_CR44_WRRSHARE_SHIFT))

/*! @brief Set the WRRSHARE field to a new value. */
#define DDR_WR_CR44_WRRSHARE(base, value) (DDR_RMW_CR44(base, DDR_CR44_WRRSHARE_MASK, DDR_CR44_WRRSHARE(value)))
#define DDR_BWR_CR44_WRRSHARE(base, value) (BITBAND_ACCESS32(&DDR_CR44_REG(base), DDR_CR44_WRRSHARE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR44, field WRRERR[27:24] (RO)
 *
 * Error/warnings related to weighted-round-robin (WRR) parameters. Bit[27]: The
 * port ordering parameter values for paired ports is not sequential. Bit[26]:
 * The relative priority values for any of the ports paired through the
 * weighted_round_robin_weight_sharing parameter are not identical. Bit[25]: Any of the
 * relative priority parameters have been programmed with a zero value. Bit[24] The
 * port ordering parameters do not all contain unique values.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR44_WRRERR field. */
#define DDR_RD_CR44_WRRERR(base) ((DDR_CR44_REG(base) & DDR_CR44_WRRERR_MASK) >> DDR_CR44_WRRERR_SHIFT)
#define DDR_BRD_CR44_WRRERR(base) (DDR_RD_CR44_WRRERR(base))
/*@}*/

/*******************************************************************************
 * DDR_CR45 - DDR Control Register 45
 ******************************************************************************/

/*!
 * @brief DDR_CR45 - DDR Control Register 45 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR45 register
 */
/*@{*/
#define DDR_RD_CR45(base)        (DDR_CR45_REG(base))
#define DDR_WR_CR45(base, value) (DDR_CR45_REG(base) = (value))
#define DDR_RMW_CR45(base, mask, value) (DDR_WR_CR45(base, (DDR_RD_CR45(base) & ~(mask)) | (value)))
#define DDR_SET_CR45(base, value) (DDR_WR_CR45(base, DDR_RD_CR45(base) |  (value)))
#define DDR_CLR_CR45(base, value) (DDR_WR_CR45(base, DDR_RD_CR45(base) & ~(value)))
#define DDR_TOG_CR45(base, value) (DDR_WR_CR45(base, DDR_RD_CR45(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR45 bitfields
 */

/*!
 * @name Register DDR_CR45, field P0PRI0[3:0] (RW)
 *
 * Relative priority of priority 0 commands from port 0.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR45_P0PRI0 field. */
#define DDR_RD_CR45_P0PRI0(base) ((DDR_CR45_REG(base) & DDR_CR45_P0PRI0_MASK) >> DDR_CR45_P0PRI0_SHIFT)
#define DDR_BRD_CR45_P0PRI0(base) (DDR_RD_CR45_P0PRI0(base))

/*! @brief Set the P0PRI0 field to a new value. */
#define DDR_WR_CR45_P0PRI0(base, value) (DDR_RMW_CR45(base, DDR_CR45_P0PRI0_MASK, DDR_CR45_P0PRI0(value)))
#define DDR_BWR_CR45_P0PRI0(base, value) (DDR_WR_CR45_P0PRI0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR45, field P0PRI1[11:8] (RW)
 *
 * Relative priority of priority 1 commands from port 0.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR45_P0PRI1 field. */
#define DDR_RD_CR45_P0PRI1(base) ((DDR_CR45_REG(base) & DDR_CR45_P0PRI1_MASK) >> DDR_CR45_P0PRI1_SHIFT)
#define DDR_BRD_CR45_P0PRI1(base) (DDR_RD_CR45_P0PRI1(base))

/*! @brief Set the P0PRI1 field to a new value. */
#define DDR_WR_CR45_P0PRI1(base, value) (DDR_RMW_CR45(base, DDR_CR45_P0PRI1_MASK, DDR_CR45_P0PRI1(value)))
#define DDR_BWR_CR45_P0PRI1(base, value) (DDR_WR_CR45_P0PRI1(base, value))
/*@}*/

/*!
 * @name Register DDR_CR45, field P0PRI2[19:16] (RW)
 *
 * Relative priority of priority 2 commands from port 0.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR45_P0PRI2 field. */
#define DDR_RD_CR45_P0PRI2(base) ((DDR_CR45_REG(base) & DDR_CR45_P0PRI2_MASK) >> DDR_CR45_P0PRI2_SHIFT)
#define DDR_BRD_CR45_P0PRI2(base) (DDR_RD_CR45_P0PRI2(base))

/*! @brief Set the P0PRI2 field to a new value. */
#define DDR_WR_CR45_P0PRI2(base, value) (DDR_RMW_CR45(base, DDR_CR45_P0PRI2_MASK, DDR_CR45_P0PRI2(value)))
#define DDR_BWR_CR45_P0PRI2(base, value) (DDR_WR_CR45_P0PRI2(base, value))
/*@}*/

/*!
 * @name Register DDR_CR45, field P0PRI3[27:24] (RW)
 *
 * Relative priority of priority 3 commands from port 0.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR45_P0PRI3 field. */
#define DDR_RD_CR45_P0PRI3(base) ((DDR_CR45_REG(base) & DDR_CR45_P0PRI3_MASK) >> DDR_CR45_P0PRI3_SHIFT)
#define DDR_BRD_CR45_P0PRI3(base) (DDR_RD_CR45_P0PRI3(base))

/*! @brief Set the P0PRI3 field to a new value. */
#define DDR_WR_CR45_P0PRI3(base, value) (DDR_RMW_CR45(base, DDR_CR45_P0PRI3_MASK, DDR_CR45_P0PRI3(value)))
#define DDR_BWR_CR45_P0PRI3(base, value) (DDR_WR_CR45_P0PRI3(base, value))
/*@}*/

