pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR46 - DDR Control Register 46
 ******************************************************************************/

/*!
 * @brief DDR_CR46 - DDR Control Register 46 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR46 register
 */
/*@{*/
#define DDR_RD_CR46(base)        (DDR_CR46_REG(base))
#define DDR_WR_CR46(base, value) (DDR_CR46_REG(base) = (value))
#define DDR_RMW_CR46(base, mask, value) (DDR_WR_CR46(base, (DDR_RD_CR46(base) & ~(mask)) | (value)))
#define DDR_SET_CR46(base, value) (DDR_WR_CR46(base, DDR_RD_CR46(base) |  (value)))
#define DDR_CLR_CR46(base, value) (DDR_WR_CR46(base, DDR_RD_CR46(base) & ~(value)))
#define DDR_TOG_CR46(base, value) (DDR_WR_CR46(base, DDR_RD_CR46(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR46 bitfields
 */

/*!
 * @name Register DDR_CR46, field P0ORD[1:0] (RW)
 *
 * Reassigned port order for port 0. ahbY_port_ordering parameters are used to
 * set this new scan order. If the three ahbY_port_ordering parameters are
 * programmed with unique values, then the scan order will be modified to proceed
 * sequentially in this new order. If any of the port ordering parameters have the same
 * value, then those ports will still be equal in the arbitration test. In this
 * case, the port number will select between these ports, with the lower-numbered
 * port automatically being selected first.
 *
 * Values:
 * - 00 - Highest listing in the scan order
 * - 01 - ------
 * - 10 - ------
 * - 11 - Lowest listing in the scan order
 */
/*@{*/
/*! @brief Read current value of the DDR_CR46_P0ORD field. */
#define DDR_RD_CR46_P0ORD(base) ((DDR_CR46_REG(base) & DDR_CR46_P0ORD_MASK) >> DDR_CR46_P0ORD_SHIFT)
#define DDR_BRD_CR46_P0ORD(base) (DDR_RD_CR46_P0ORD(base))

/*! @brief Set the P0ORD field to a new value. */
#define DDR_WR_CR46_P0ORD(base, value) (DDR_RMW_CR46(base, DDR_CR46_P0ORD_MASK, DDR_CR46_P0ORD(value)))
#define DDR_BWR_CR46_P0ORD(base, value) (DDR_WR_CR46_P0ORD(base, value))
/*@}*/

/*!
 * @name Register DDR_CR46, field P0PRIRLX[17:8] (RW)
 *
 * Counter value to trigger prioity relax on port 0.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR46_P0PRIRLX field. */
#define DDR_RD_CR46_P0PRIRLX(base) ((DDR_CR46_REG(base) & DDR_CR46_P0PRIRLX_MASK) >> DDR_CR46_P0PRIRLX_SHIFT)
#define DDR_BRD_CR46_P0PRIRLX(base) (DDR_RD_CR46_P0PRIRLX(base))

/*! @brief Set the P0PRIRLX field to a new value. */
#define DDR_WR_CR46_P0PRIRLX(base, value) (DDR_RMW_CR46(base, DDR_CR46_P0PRIRLX_MASK, DDR_CR46_P0PRIRLX(value)))
#define DDR_BWR_CR46_P0PRIRLX(base, value) (DDR_WR_CR46_P0PRIRLX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR46, field P1PRI0[27:24] (RW)
 *
 * Relative priority of priority 0 commands from port 1.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR46_P1PRI0 field. */
#define DDR_RD_CR46_P1PRI0(base) ((DDR_CR46_REG(base) & DDR_CR46_P1PRI0_MASK) >> DDR_CR46_P1PRI0_SHIFT)
#define DDR_BRD_CR46_P1PRI0(base) (DDR_RD_CR46_P1PRI0(base))

/*! @brief Set the P1PRI0 field to a new value. */
#define DDR_WR_CR46_P1PRI0(base, value) (DDR_RMW_CR46(base, DDR_CR46_P1PRI0_MASK, DDR_CR46_P1PRI0(value)))
#define DDR_BWR_CR46_P1PRI0(base, value) (DDR_WR_CR46_P1PRI0(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR47 - DDR Control Register 47
 ******************************************************************************/

/*!
 * @brief DDR_CR47 - DDR Control Register 47 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR47 register
 */
/*@{*/
#define DDR_RD_CR47(base)        (DDR_CR47_REG(base))
#define DDR_WR_CR47(base, value) (DDR_CR47_REG(base) = (value))
#define DDR_RMW_CR47(base, mask, value) (DDR_WR_CR47(base, (DDR_RD_CR47(base) & ~(mask)) | (value)))
#define DDR_SET_CR47(base, value) (DDR_WR_CR47(base, DDR_RD_CR47(base) |  (value)))
#define DDR_CLR_CR47(base, value) (DDR_WR_CR47(base, DDR_RD_CR47(base) & ~(value)))
#define DDR_TOG_CR47(base, value) (DDR_WR_CR47(base, DDR_RD_CR47(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR47 bitfields
 */

/*!
 * @name Register DDR_CR47, field P1PRI1[3:0] (RW)
 *
 * Relative priority of priority 1 commands from port 1.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR47_P1PRI1 field. */
#define DDR_RD_CR47_P1PRI1(base) ((DDR_CR47_REG(base) & DDR_CR47_P1PRI1_MASK) >> DDR_CR47_P1PRI1_SHIFT)
#define DDR_BRD_CR47_P1PRI1(base) (DDR_RD_CR47_P1PRI1(base))

/*! @brief Set the P1PRI1 field to a new value. */
#define DDR_WR_CR47_P1PRI1(base, value) (DDR_RMW_CR47(base, DDR_CR47_P1PRI1_MASK, DDR_CR47_P1PRI1(value)))
#define DDR_BWR_CR47_P1PRI1(base, value) (DDR_WR_CR47_P1PRI1(base, value))
/*@}*/

/*!
 * @name Register DDR_CR47, field P1PRI2[11:8] (RW)
 *
 * Relative priority of priority 2 commands from port 1.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR47_P1PRI2 field. */
#define DDR_RD_CR47_P1PRI2(base) ((DDR_CR47_REG(base) & DDR_CR47_P1PRI2_MASK) >> DDR_CR47_P1PRI2_SHIFT)
#define DDR_BRD_CR47_P1PRI2(base) (DDR_RD_CR47_P1PRI2(base))

/*! @brief Set the P1PRI2 field to a new value. */
#define DDR_WR_CR47_P1PRI2(base, value) (DDR_RMW_CR47(base, DDR_CR47_P1PRI2_MASK, DDR_CR47_P1PRI2(value)))
#define DDR_BWR_CR47_P1PRI2(base, value) (DDR_WR_CR47_P1PRI2(base, value))
/*@}*/

/*!
 * @name Register DDR_CR47, field P1PRI3[19:16] (RW)
 *
 * Relative priority of priority 3 commands from port 1.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR47_P1PRI3 field. */
#define DDR_RD_CR47_P1PRI3(base) ((DDR_CR47_REG(base) & DDR_CR47_P1PRI3_MASK) >> DDR_CR47_P1PRI3_SHIFT)
#define DDR_BRD_CR47_P1PRI3(base) (DDR_RD_CR47_P1PRI3(base))

/*! @brief Set the P1PRI3 field to a new value. */
#define DDR_WR_CR47_P1PRI3(base, value) (DDR_RMW_CR47(base, DDR_CR47_P1PRI3_MASK, DDR_CR47_P1PRI3(value)))
#define DDR_BWR_CR47_P1PRI3(base, value) (DDR_WR_CR47_P1PRI3(base, value))
/*@}*/

/*!
 * @name Register DDR_CR47, field P1ORD[25:24] (RW)
 *
 * Reassigned port order for port 1. ahbY_port_ordering parameters are used to
 * set this new scan order. If the three ahbY_port_ordering parameters are
 * programmed with unique values, then the scan order will be modified to proceed
 * sequentially in this new order. If any of the port ordering parameters have the same
 * value, then those ports will still be equal in the arbitration test. In this
 * case, the port number will select between these ports, with the lower-numbered
 * port automatically being selected first.
 *
 * Values:
 * - 00 - Highest listing in the scan order
 * - 01 -
 * - 10 -
 * - 11 - Lowest listing in the scan order
 */
/*@{*/
/*! @brief Read current value of the DDR_CR47_P1ORD field. */
#define DDR_RD_CR47_P1ORD(base) ((DDR_CR47_REG(base) & DDR_CR47_P1ORD_MASK) >> DDR_CR47_P1ORD_SHIFT)
#define DDR_BRD_CR47_P1ORD(base) (DDR_RD_CR47_P1ORD(base))

/*! @brief Set the P1ORD field to a new value. */
#define DDR_WR_CR47_P1ORD(base, value) (DDR_RMW_CR47(base, DDR_CR47_P1ORD_MASK, DDR_CR47_P1ORD(value)))
#define DDR_BWR_CR47_P1ORD(base, value) (DDR_WR_CR47_P1ORD(base, value))
/*@}*/

