pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR48 - DDR Control Register 48
 ******************************************************************************/

/*!
 * @brief DDR_CR48 - DDR Control Register 48 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR48 register
 */
/*@{*/
#define DDR_RD_CR48(base)        (DDR_CR48_REG(base))
#define DDR_WR_CR48(base, value) (DDR_CR48_REG(base) = (value))
#define DDR_RMW_CR48(base, mask, value) (DDR_WR_CR48(base, (DDR_RD_CR48(base) & ~(mask)) | (value)))
#define DDR_SET_CR48(base, value) (DDR_WR_CR48(base, DDR_RD_CR48(base) |  (value)))
#define DDR_CLR_CR48(base, value) (DDR_WR_CR48(base, DDR_RD_CR48(base) & ~(value)))
#define DDR_TOG_CR48(base, value) (DDR_WR_CR48(base, DDR_RD_CR48(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR48 bitfields
 */

/*!
 * @name Register DDR_CR48, field P1PRIRLX[9:0] (RW)
 *
 * Counter value to trigger priority relax on port 1.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR48_P1PRIRLX field. */
#define DDR_RD_CR48_P1PRIRLX(base) ((DDR_CR48_REG(base) & DDR_CR48_P1PRIRLX_MASK) >> DDR_CR48_P1PRIRLX_SHIFT)
#define DDR_BRD_CR48_P1PRIRLX(base) (DDR_RD_CR48_P1PRIRLX(base))

/*! @brief Set the P1PRIRLX field to a new value. */
#define DDR_WR_CR48_P1PRIRLX(base, value) (DDR_RMW_CR48(base, DDR_CR48_P1PRIRLX_MASK, DDR_CR48_P1PRIRLX(value)))
#define DDR_BWR_CR48_P1PRIRLX(base, value) (DDR_WR_CR48_P1PRIRLX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR48, field P2PRI0[19:16] (RW)
 *
 * Relative priority of priority 0 commands from port 2.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR48_P2PRI0 field. */
#define DDR_RD_CR48_P2PRI0(base) ((DDR_CR48_REG(base) & DDR_CR48_P2PRI0_MASK) >> DDR_CR48_P2PRI0_SHIFT)
#define DDR_BRD_CR48_P2PRI0(base) (DDR_RD_CR48_P2PRI0(base))

/*! @brief Set the P2PRI0 field to a new value. */
#define DDR_WR_CR48_P2PRI0(base, value) (DDR_RMW_CR48(base, DDR_CR48_P2PRI0_MASK, DDR_CR48_P2PRI0(value)))
#define DDR_BWR_CR48_P2PRI0(base, value) (DDR_WR_CR48_P2PRI0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR48, field P2PRI1[27:24] (RW)
 *
 * Relative priority of priority 1 commands from port 2.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR48_P2PRI1 field. */
#define DDR_RD_CR48_P2PRI1(base) ((DDR_CR48_REG(base) & DDR_CR48_P2PRI1_MASK) >> DDR_CR48_P2PRI1_SHIFT)
#define DDR_BRD_CR48_P2PRI1(base) (DDR_RD_CR48_P2PRI1(base))

/*! @brief Set the P2PRI1 field to a new value. */
#define DDR_WR_CR48_P2PRI1(base, value) (DDR_RMW_CR48(base, DDR_CR48_P2PRI1_MASK, DDR_CR48_P2PRI1(value)))
#define DDR_BWR_CR48_P2PRI1(base, value) (DDR_WR_CR48_P2PRI1(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR49 - DDR Control Register 49
 ******************************************************************************/

/*!
 * @brief DDR_CR49 - DDR Control Register 49 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR49 register
 */
/*@{*/
#define DDR_RD_CR49(base)        (DDR_CR49_REG(base))
#define DDR_WR_CR49(base, value) (DDR_CR49_REG(base) = (value))
#define DDR_RMW_CR49(base, mask, value) (DDR_WR_CR49(base, (DDR_RD_CR49(base) & ~(mask)) | (value)))
#define DDR_SET_CR49(base, value) (DDR_WR_CR49(base, DDR_RD_CR49(base) |  (value)))
#define DDR_CLR_CR49(base, value) (DDR_WR_CR49(base, DDR_RD_CR49(base) & ~(value)))
#define DDR_TOG_CR49(base, value) (DDR_WR_CR49(base, DDR_RD_CR49(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR49 bitfields
 */

/*!
 * @name Register DDR_CR49, field P2PRI2[3:0] (RW)
 *
 * Relative priority of priority 2 commands from port 2.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR49_P2PRI2 field. */
#define DDR_RD_CR49_P2PRI2(base) ((DDR_CR49_REG(base) & DDR_CR49_P2PRI2_MASK) >> DDR_CR49_P2PRI2_SHIFT)
#define DDR_BRD_CR49_P2PRI2(base) (DDR_RD_CR49_P2PRI2(base))

/*! @brief Set the P2PRI2 field to a new value. */
#define DDR_WR_CR49_P2PRI2(base, value) (DDR_RMW_CR49(base, DDR_CR49_P2PRI2_MASK, DDR_CR49_P2PRI2(value)))
#define DDR_BWR_CR49_P2PRI2(base, value) (DDR_WR_CR49_P2PRI2(base, value))
/*@}*/

/*!
 * @name Register DDR_CR49, field P2PRI3[11:8] (RW)
 *
 * Relative priority of priority 3 commands from port 2.
 *
 * Values:
 * - 0000 - Lowest
 * - 0001 - -----
 * - 1110 - -----
 * - 1111 - Highest
 */
/*@{*/
/*! @brief Read current value of the DDR_CR49_P2PRI3 field. */
#define DDR_RD_CR49_P2PRI3(base) ((DDR_CR49_REG(base) & DDR_CR49_P2PRI3_MASK) >> DDR_CR49_P2PRI3_SHIFT)
#define DDR_BRD_CR49_P2PRI3(base) (DDR_RD_CR49_P2PRI3(base))

/*! @brief Set the P2PRI3 field to a new value. */
#define DDR_WR_CR49_P2PRI3(base, value) (DDR_RMW_CR49(base, DDR_CR49_P2PRI3_MASK, DDR_CR49_P2PRI3(value)))
#define DDR_BWR_CR49_P2PRI3(base, value) (DDR_WR_CR49_P2PRI3(base, value))
/*@}*/

/*!
 * @name Register DDR_CR49, field P2ORD[17:16] (RW)
 *
 * Reassigned port order for port 2. ahbY_port_ordering parameters are used to
 * set this new scan order. If the three ahbY_port_ordering parameters are
 * programmed with unique values, then the scan order will be modified to proceed
 * sequentially in this new order. If any of the port ordering parameters have the same
 * value, then those ports will still be equal in the arbitration test. In this
 * case, the port number will select between these ports, with the lower-numbered
 * port automatically being selected first.
 *
 * Values:
 * - 00 - Highest listing in the scan order
 * - 01 - -----
 * - 10 - -----
 * - 11 - Lowest listing in the scan order
 */
/*@{*/
/*! @brief Read current value of the DDR_CR49_P2ORD field. */
#define DDR_RD_CR49_P2ORD(base) ((DDR_CR49_REG(base) & DDR_CR49_P2ORD_MASK) >> DDR_CR49_P2ORD_SHIFT)
#define DDR_BRD_CR49_P2ORD(base) (DDR_RD_CR49_P2ORD(base))

/*! @brief Set the P2ORD field to a new value. */
#define DDR_WR_CR49_P2ORD(base, value) (DDR_RMW_CR49(base, DDR_CR49_P2ORD_MASK, DDR_CR49_P2ORD(value)))
#define DDR_BWR_CR49_P2ORD(base, value) (DDR_WR_CR49_P2ORD(base, value))
/*@}*/

