pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR50 - DDR Control Register 50
 ******************************************************************************/

/*!
 * @brief DDR_CR50 - DDR Control Register 50 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR50 register
 */
/*@{*/
#define DDR_RD_CR50(base)        (DDR_CR50_REG(base))
#define DDR_WR_CR50(base, value) (DDR_CR50_REG(base) = (value))
#define DDR_RMW_CR50(base, mask, value) (DDR_WR_CR50(base, (DDR_RD_CR50(base) & ~(mask)) | (value)))
#define DDR_SET_CR50(base, value) (DDR_WR_CR50(base, DDR_RD_CR50(base) |  (value)))
#define DDR_CLR_CR50(base, value) (DDR_WR_CR50(base, DDR_RD_CR50(base) & ~(value)))
#define DDR_TOG_CR50(base, value) (DDR_WR_CR50(base, DDR_RD_CR50(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR50 bitfields
 */

/*!
 * @name Register DDR_CR50, field P2PRIRLX[9:0] (RW)
 *
 * Counter value to trigger priority relax on port 2.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR50_P2PRIRLX field. */
#define DDR_RD_CR50_P2PRIRLX(base) ((DDR_CR50_REG(base) & DDR_CR50_P2PRIRLX_MASK) >> DDR_CR50_P2PRIRLX_SHIFT)
#define DDR_BRD_CR50_P2PRIRLX(base) (DDR_RD_CR50_P2PRIRLX(base))

/*! @brief Set the P2PRIRLX field to a new value. */
#define DDR_WR_CR50_P2PRIRLX(base, value) (DDR_RMW_CR50(base, DDR_CR50_P2PRIRLX_MASK, DDR_CR50_P2PRIRLX(value)))
#define DDR_BWR_CR50_P2PRIRLX(base, value) (DDR_WR_CR50_P2PRIRLX(base, value))
/*@}*/

/*!
 * @name Register DDR_CR50, field CLKSTATUS[16] (RO)
 *
 * Register access to clkstatus signal.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR50_CLKSTATUS field. */
#define DDR_RD_CR50_CLKSTATUS(base) ((DDR_CR50_REG(base) & DDR_CR50_CLKSTATUS_MASK) >> DDR_CR50_CLKSTATUS_SHIFT)
#define DDR_BRD_CR50_CLKSTATUS(base) (BITBAND_ACCESS32(&DDR_CR50_REG(base), DDR_CR50_CLKSTATUS_SHIFT))
/*@}*/

/*******************************************************************************
 * DDR_CR51 - DDR Control Register 51
 ******************************************************************************/

/*!
 * @brief DDR_CR51 - DDR Control Register 51 (RW)
 *
 * Reset value: 0x00000400U
 */
/*!
 * @name Constants and macros for entire DDR_CR51 register
 */
/*@{*/
#define DDR_RD_CR51(base)        (DDR_CR51_REG(base))
#define DDR_WR_CR51(base, value) (DDR_CR51_REG(base) = (value))
#define DDR_RMW_CR51(base, mask, value) (DDR_WR_CR51(base, (DDR_RD_CR51(base) & ~(mask)) | (value)))
#define DDR_SET_CR51(base, value) (DDR_WR_CR51(base, DDR_RD_CR51(base) |  (value)))
#define DDR_CLR_CR51(base, value) (DDR_WR_CR51(base, DDR_RD_CR51(base) & ~(value)))
#define DDR_TOG_CR51(base, value) (DDR_WR_CR51(base, DDR_RD_CR51(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR51 bitfields
 */

/*!
 * @name Register DDR_CR51, field DLLRSTDLY[15:0] (RW)
 *
 * Minimum number of cycles required for DLL reset.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR51_DLLRSTDLY field. */
#define DDR_RD_CR51_DLLRSTDLY(base) ((DDR_CR51_REG(base) & DDR_CR51_DLLRSTDLY_MASK) >> DDR_CR51_DLLRSTDLY_SHIFT)
#define DDR_BRD_CR51_DLLRSTDLY(base) (DDR_RD_CR51_DLLRSTDLY(base))

/*! @brief Set the DLLRSTDLY field to a new value. */
#define DDR_WR_CR51_DLLRSTDLY(base, value) (DDR_RMW_CR51(base, DDR_CR51_DLLRSTDLY_MASK, DDR_CR51_DLLRSTDLY(value)))
#define DDR_BWR_CR51_DLLRSTDLY(base, value) (DDR_WR_CR51_DLLRSTDLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR51, field DLLRADLY[23:16] (RW)
 *
 * Minimum number of cycles after setting master delay in DLL until reset is
 * released.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR51_DLLRADLY field. */
#define DDR_RD_CR51_DLLRADLY(base) ((DDR_CR51_REG(base) & DDR_CR51_DLLRADLY_MASK) >> DDR_CR51_DLLRADLY_SHIFT)
#define DDR_BRD_CR51_DLLRADLY(base) (DDR_RD_CR51_DLLRADLY(base))

/*! @brief Set the DLLRADLY field to a new value. */
#define DDR_WR_CR51_DLLRADLY(base, value) (DDR_RMW_CR51(base, DDR_CR51_DLLRADLY_MASK, DDR_CR51_DLLRADLY(value)))
#define DDR_BWR_CR51_DLLRADLY(base, value) (DDR_WR_CR51_DLLRADLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR51, field PHYWRLAT[27:24] (RO)
 *
 * Holds the calculated value of the t phy_wrlat timing parameter, the number of
 * DFI PHY clock cycles between when a write command is sent on the DFI control
 * interface and when the dfi_wrdata_en signal is asserted. This parameter is
 * used to adjust the dfi_wrdata_en signal timing. t dfi_phy_wrlat = t
 * dfi_phy_wrlat_base + wrlat_adj + reg_dimm_enable minus WRLAT_WIDTH'h3 Values of t
 * dfi_phy_wrlat_base + wrlat_adj that are less than 3 are not supported. All DFI timing
 * parameters must be programmed relative to the DFI clock.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR51_PHYWRLAT field. */
#define DDR_RD_CR51_PHYWRLAT(base) ((DDR_CR51_REG(base) & DDR_CR51_PHYWRLAT_MASK) >> DDR_CR51_PHYWRLAT_SHIFT)
#define DDR_BRD_CR51_PHYWRLAT(base) (DDR_RD_CR51_PHYWRLAT(base))
/*@}*/

/*******************************************************************************
 * DDR_CR52 - DDR Control Register 52
 ******************************************************************************/

/*!
 * @brief DDR_CR52 - DDR Control Register 52 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR52 register
 */
/*@{*/
#define DDR_RD_CR52(base)        (DDR_CR52_REG(base))
#define DDR_WR_CR52(base, value) (DDR_CR52_REG(base) = (value))
#define DDR_RMW_CR52(base, mask, value) (DDR_WR_CR52(base, (DDR_RD_CR52(base) & ~(mask)) | (value)))
#define DDR_SET_CR52(base, value) (DDR_WR_CR52(base, DDR_RD_CR52(base) |  (value)))
#define DDR_CLR_CR52(base, value) (DDR_WR_CR52(base, DDR_RD_CR52(base) & ~(value)))
#define DDR_TOG_CR52(base, value) (DDR_WR_CR52(base, DDR_RD_CR52(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR52 bitfields
 */

/*!
 * @name Register DDR_CR52, field PYWRLTBS[3:0] (RW)
 *
 * Sets DFI base value for the t PHY_RWLAT timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR52_PYWRLTBS field. */
#define DDR_RD_CR52_PYWRLTBS(base) ((DDR_CR52_REG(base) & DDR_CR52_PYWRLTBS_MASK) >> DDR_CR52_PYWRLTBS_SHIFT)
#define DDR_BRD_CR52_PYWRLTBS(base) (DDR_RD_CR52_PYWRLTBS(base))

