pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the PYWRLTBS field to a new value. */
#define DDR_WR_CR52_PYWRLTBS(base, value) (DDR_RMW_CR52(base, DDR_CR52_PYWRLTBS_MASK, DDR_CR52_PYWRLTBS(value)))
#define DDR_BWR_CR52_PYWRLTBS(base, value) (DDR_WR_CR52_PYWRLTBS(base, value))
/*@}*/

/*!
 * @name Register DDR_CR52, field PHYRDLAT[11:8] (RW)
 *
 * Holds the t PHY_RDLAT timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR52_PHYRDLAT field. */
#define DDR_RD_CR52_PHYRDLAT(base) ((DDR_CR52_REG(base) & DDR_CR52_PHYRDLAT_MASK) >> DDR_CR52_PHYRDLAT_SHIFT)
#define DDR_BRD_CR52_PHYRDLAT(base) (DDR_RD_CR52_PHYRDLAT(base))

/*! @brief Set the PHYRDLAT field to a new value. */
#define DDR_WR_CR52_PHYRDLAT(base, value) (DDR_RMW_CR52(base, DDR_CR52_PHYRDLAT_MASK, DDR_CR52_PHYRDLAT(value)))
#define DDR_BWR_CR52_PHYRDLAT(base, value) (DDR_WR_CR52_PHYRDLAT(base, value))
/*@}*/

/*!
 * @name Register DDR_CR52, field RDDATAEN[19:16] (RO)
 *
 * Holds the calculated DFI t RDDATA_EN timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR52_RDDATAEN field. */
#define DDR_RD_CR52_RDDATAEN(base) ((DDR_CR52_REG(base) & DDR_CR52_RDDATAEN_MASK) >> DDR_CR52_RDDATAEN_SHIFT)
#define DDR_BRD_CR52_RDDATAEN(base) (DDR_RD_CR52_RDDATAEN(base))
/*@}*/

/*!
 * @name Register DDR_CR52, field RDDTENBAS[27:24] (RW)
 *
 * Sets DFI base value for the t RDDATA_EN timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR52_RDDTENBAS field. */
#define DDR_RD_CR52_RDDTENBAS(base) ((DDR_CR52_REG(base) & DDR_CR52_RDDTENBAS_MASK) >> DDR_CR52_RDDTENBAS_SHIFT)
#define DDR_BRD_CR52_RDDTENBAS(base) (DDR_RD_CR52_RDDTENBAS(base))

/*! @brief Set the RDDTENBAS field to a new value. */
#define DDR_WR_CR52_RDDTENBAS(base, value) (DDR_RMW_CR52(base, DDR_CR52_RDDTENBAS_MASK, DDR_CR52_RDDTENBAS(value)))
#define DDR_BWR_CR52_RDDTENBAS(base, value) (DDR_WR_CR52_RDDTENBAS(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR53 - DDR Control Register 53
 ******************************************************************************/

/*!
 * @brief DDR_CR53 - DDR Control Register 53 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR53 register
 */
/*@{*/
#define DDR_RD_CR53(base)        (DDR_CR53_REG(base))
#define DDR_WR_CR53(base, value) (DDR_CR53_REG(base) = (value))
#define DDR_RMW_CR53(base, mask, value) (DDR_WR_CR53(base, (DDR_RD_CR53(base) & ~(mask)) | (value)))
#define DDR_SET_CR53(base, value) (DDR_WR_CR53(base, DDR_RD_CR53(base) |  (value)))
#define DDR_CLR_CR53(base, value) (DDR_WR_CR53(base, DDR_RD_CR53(base) & ~(value)))
#define DDR_TOG_CR53(base, value) (DDR_WR_CR53(base, DDR_RD_CR53(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR53 bitfields
 */

/*!
 * @name Register DDR_CR53, field CLKDISCS[0] (RW)
 *
 * Set value for the dfi_dram_clk_disable signal.
 *
 * Values:
 * - 0 - Memory clock active
 * - 1 - Memory clock disabled
 */
/*@{*/
/*! @brief Read current value of the DDR_CR53_CLKDISCS field. */
#define DDR_RD_CR53_CLKDISCS(base) ((DDR_CR53_REG(base) & DDR_CR53_CLKDISCS_MASK) >> DDR_CR53_CLKDISCS_SHIFT)
#define DDR_BRD_CR53_CLKDISCS(base) (BITBAND_ACCESS32(&DDR_CR53_REG(base), DDR_CR53_CLKDISCS_SHIFT))

/*! @brief Set the CLKDISCS field to a new value. */
#define DDR_WR_CR53_CLKDISCS(base, value) (DDR_RMW_CR53(base, DDR_CR53_CLKDISCS_MASK, DDR_CR53_CLKDISCS(value)))
#define DDR_BWR_CR53_CLKDISCS(base, value) (BITBAND_ACCESS32(&DDR_CR53_REG(base), DDR_CR53_CLKDISCS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DDR_CR53, field CRTLUPDMN[11:8] (RO)
 *
 * Holds the DFI t CTRLUPD_MIN timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR53_CRTLUPDMN field. */
#define DDR_RD_CR53_CRTLUPDMN(base) ((DDR_CR53_REG(base) & DDR_CR53_CRTLUPDMN_MASK) >> DDR_CR53_CRTLUPDMN_SHIFT)
#define DDR_BRD_CR53_CRTLUPDMN(base) (DDR_RD_CR53_CRTLUPDMN(base))
/*@}*/

/*!
 * @name Register DDR_CR53, field CTRLUPDMX[29:16] (RW)
 *
 * Contains the DFI t TRLUPD_MAX timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR53_CTRLUPDMX field. */
#define DDR_RD_CR53_CTRLUPDMX(base) ((DDR_CR53_REG(base) & DDR_CR53_CTRLUPDMX_MASK) >> DDR_CR53_CTRLUPDMX_SHIFT)
#define DDR_BRD_CR53_CTRLUPDMX(base) (DDR_RD_CR53_CTRLUPDMX(base))

/*! @brief Set the CTRLUPDMX field to a new value. */
#define DDR_WR_CR53_CTRLUPDMX(base, value) (DDR_RMW_CR53(base, DDR_CR53_CTRLUPDMX_MASK, DDR_CR53_CTRLUPDMX(value)))
#define DDR_BWR_CR53_CTRLUPDMX(base, value) (DDR_WR_CR53_CTRLUPDMX(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR54 - DDR Control Register 54
 ******************************************************************************/

/*!
 * @brief DDR_CR54 - DDR Control Register 54 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR54 register
 */
/*@{*/
#define DDR_RD_CR54(base)        (DDR_CR54_REG(base))
#define DDR_WR_CR54(base, value) (DDR_CR54_REG(base) = (value))
#define DDR_RMW_CR54(base, mask, value) (DDR_WR_CR54(base, (DDR_RD_CR54(base) & ~(mask)) | (value)))
#define DDR_SET_CR54(base, value) (DDR_WR_CR54(base, DDR_RD_CR54(base) |  (value)))
#define DDR_CLR_CR54(base, value) (DDR_WR_CR54(base, DDR_RD_CR54(base) & ~(value)))
#define DDR_TOG_CR54(base, value) (DDR_WR_CR54(base, DDR_RD_CR54(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR54 bitfields
 */

/*!
 * @name Register DDR_CR54, field PHYUPDTY0[13:0] (RW)
 *
 * Holds the DFI t PHYUPD_TYPE0 timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR54_PHYUPDTY0 field. */
#define DDR_RD_CR54_PHYUPDTY0(base) ((DDR_CR54_REG(base) & DDR_CR54_PHYUPDTY0_MASK) >> DDR_CR54_PHYUPDTY0_SHIFT)
#define DDR_BRD_CR54_PHYUPDTY0(base) (DDR_RD_CR54_PHYUPDTY0(base))

/*! @brief Set the PHYUPDTY0 field to a new value. */
#define DDR_WR_CR54_PHYUPDTY0(base, value) (DDR_RMW_CR54(base, DDR_CR54_PHYUPDTY0_MASK, DDR_CR54_PHYUPDTY0(value)))
#define DDR_BWR_CR54_PHYUPDTY0(base, value) (DDR_WR_CR54_PHYUPDTY0(base, value))
/*@}*/

/*!
 * @name Register DDR_CR54, field PHYUPDTY1[29:16] (RW)
 *
 * Holds the DFI t PHYUPD_TYPE1 timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR54_PHYUPDTY1 field. */
#define DDR_RD_CR54_PHYUPDTY1(base) ((DDR_CR54_REG(base) & DDR_CR54_PHYUPDTY1_MASK) >> DDR_CR54_PHYUPDTY1_SHIFT)
#define DDR_BRD_CR54_PHYUPDTY1(base) (DDR_RD_CR54_PHYUPDTY1(base))

