pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the PHYUPDTY1 field to a new value. */
#define DDR_WR_CR54_PHYUPDTY1(base, value) (DDR_RMW_CR54(base, DDR_CR54_PHYUPDTY1_MASK, DDR_CR54_PHYUPDTY1(value)))
#define DDR_BWR_CR54_PHYUPDTY1(base, value) (DDR_WR_CR54_PHYUPDTY1(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR55 - DDR Control Register 55
 ******************************************************************************/

/*!
 * @brief DDR_CR55 - DDR Control Register 55 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR55 register
 */
/*@{*/
#define DDR_RD_CR55(base)        (DDR_CR55_REG(base))
#define DDR_WR_CR55(base, value) (DDR_CR55_REG(base) = (value))
#define DDR_RMW_CR55(base, mask, value) (DDR_WR_CR55(base, (DDR_RD_CR55(base) & ~(mask)) | (value)))
#define DDR_SET_CR55(base, value) (DDR_WR_CR55(base, DDR_RD_CR55(base) |  (value)))
#define DDR_CLR_CR55(base, value) (DDR_WR_CR55(base, DDR_RD_CR55(base) & ~(value)))
#define DDR_TOG_CR55(base, value) (DDR_WR_CR55(base, DDR_RD_CR55(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR55 bitfields
 */

/*!
 * @name Register DDR_CR55, field PHYUPDTY2[13:0] (RW)
 *
 * Holds the DFI t PHYUPD_TYPE2 timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR55_PHYUPDTY2 field. */
#define DDR_RD_CR55_PHYUPDTY2(base) ((DDR_CR55_REG(base) & DDR_CR55_PHYUPDTY2_MASK) >> DDR_CR55_PHYUPDTY2_SHIFT)
#define DDR_BRD_CR55_PHYUPDTY2(base) (DDR_RD_CR55_PHYUPDTY2(base))

/*! @brief Set the PHYUPDTY2 field to a new value. */
#define DDR_WR_CR55_PHYUPDTY2(base, value) (DDR_RMW_CR55(base, DDR_CR55_PHYUPDTY2_MASK, DDR_CR55_PHYUPDTY2(value)))
#define DDR_BWR_CR55_PHYUPDTY2(base, value) (DDR_WR_CR55_PHYUPDTY2(base, value))
/*@}*/

/*!
 * @name Register DDR_CR55, field PHYUPDTY3[29:16] (RW)
 *
 * Holds the DFI t PHYUPD_TYPE3 timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR55_PHYUPDTY3 field. */
#define DDR_RD_CR55_PHYUPDTY3(base) ((DDR_CR55_REG(base) & DDR_CR55_PHYUPDTY3_MASK) >> DDR_CR55_PHYUPDTY3_SHIFT)
#define DDR_BRD_CR55_PHYUPDTY3(base) (DDR_RD_CR55_PHYUPDTY3(base))

/*! @brief Set the PHYUPDTY3 field to a new value. */
#define DDR_WR_CR55_PHYUPDTY3(base, value) (DDR_RMW_CR55(base, DDR_CR55_PHYUPDTY3_MASK, DDR_CR55_PHYUPDTY3(value)))
#define DDR_BWR_CR55_PHYUPDTY3(base, value) (DDR_WR_CR55_PHYUPDTY3(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR56 - DDR Control Register 56
 ******************************************************************************/

/*!
 * @brief DDR_CR56 - DDR Control Register 56 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR56 register
 */
/*@{*/
#define DDR_RD_CR56(base)        (DDR_CR56_REG(base))
#define DDR_WR_CR56(base, value) (DDR_CR56_REG(base) = (value))
#define DDR_RMW_CR56(base, mask, value) (DDR_WR_CR56(base, (DDR_RD_CR56(base) & ~(mask)) | (value)))
#define DDR_SET_CR56(base, value) (DDR_WR_CR56(base, DDR_RD_CR56(base) |  (value)))
#define DDR_CLR_CR56(base, value) (DDR_WR_CR56(base, DDR_RD_CR56(base) & ~(value)))
#define DDR_TOG_CR56(base, value) (DDR_WR_CR56(base, DDR_RD_CR56(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_CR56 bitfields
 */

/*!
 * @name Register DDR_CR56, field PHYUPDRESP[13:0] (RW)
 *
 * Contains the DFI t PHYUPD_RESP timing parameter.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR56_PHYUPDRESP field. */
#define DDR_RD_CR56_PHYUPDRESP(base) ((DDR_CR56_REG(base) & DDR_CR56_PHYUPDRESP_MASK) >> DDR_CR56_PHYUPDRESP_SHIFT)
#define DDR_BRD_CR56_PHYUPDRESP(base) (DDR_RD_CR56_PHYUPDRESP(base))

/*! @brief Set the PHYUPDRESP field to a new value. */
#define DDR_WR_CR56_PHYUPDRESP(base, value) (DDR_RMW_CR56(base, DDR_CR56_PHYUPDRESP_MASK, DDR_CR56_PHYUPDRESP(value)))
#define DDR_BWR_CR56_PHYUPDRESP(base, value) (DDR_WR_CR56_PHYUPDRESP(base, value))
/*@}*/

/*!
 * @name Register DDR_CR56, field RDLATADJ[19:16] (RW)
 *
 * Adjustment value for PHY read timing.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR56_RDLATADJ field. */
#define DDR_RD_CR56_RDLATADJ(base) ((DDR_CR56_REG(base) & DDR_CR56_RDLATADJ_MASK) >> DDR_CR56_RDLATADJ_SHIFT)
#define DDR_BRD_CR56_RDLATADJ(base) (DDR_RD_CR56_RDLATADJ(base))

/*! @brief Set the RDLATADJ field to a new value. */
#define DDR_WR_CR56_RDLATADJ(base, value) (DDR_RMW_CR56(base, DDR_CR56_RDLATADJ_MASK, DDR_CR56_RDLATADJ(value)))
#define DDR_BWR_CR56_RDLATADJ(base, value) (DDR_WR_CR56_RDLATADJ(base, value))
/*@}*/

/*!
 * @name Register DDR_CR56, field WRLATADJ[27:24] (RW)
 *
 * Adjustment value for PHY write timing.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR56_WRLATADJ field. */
#define DDR_RD_CR56_WRLATADJ(base) ((DDR_CR56_REG(base) & DDR_CR56_WRLATADJ_MASK) >> DDR_CR56_WRLATADJ_SHIFT)
#define DDR_BRD_CR56_WRLATADJ(base) (DDR_RD_CR56_WRLATADJ(base))

/*! @brief Set the WRLATADJ field to a new value. */
#define DDR_WR_CR56_WRLATADJ(base, value) (DDR_RMW_CR56(base, DDR_CR56_WRLATADJ_MASK, DDR_CR56_WRLATADJ(value)))
#define DDR_BWR_CR56_WRLATADJ(base, value) (DDR_WR_CR56_WRLATADJ(base, value))
/*@}*/

/*******************************************************************************
 * DDR_CR57 - DDR Control Register 57
 ******************************************************************************/

/*!
 * @brief DDR_CR57 - DDR Control Register 57 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR57 register
 */
/*@{*/
#define DDR_RD_CR57(base)        (DDR_CR57_REG(base))
#define DDR_WR_CR57(base, value) (DDR_CR57_REG(base) = (value))
#define DDR_RMW_CR57(base, mask, value) (DDR_WR_CR57(base, (DDR_RD_CR57(base) & ~(mask)) | (value)))
#define DDR_SET_CR57(base, value) (DDR_WR_CR57(base, DDR_RD_CR57(base) |  (value)))
#define DDR_CLR_CR57(base, value) (DDR_WR_CR57(base, DDR_RD_CR57(base) & ~(value)))
#define DDR_TOG_CR57(base, value) (DDR_WR_CR57(base, DDR_RD_CR57(base) ^  (value)))
/*@}*/

