pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DDR_CR57 bitfields
 */

/*!
 * @name Register DDR_CR57, field CMDDLY[3:0] (RW)
 *
 * Delay from DFI command to memory command.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR57_CMDDLY field. */
#define DDR_RD_CR57_CMDDLY(base) ((DDR_CR57_REG(base) & DDR_CR57_CMDDLY_MASK) >> DDR_CR57_CMDDLY_SHIFT)
#define DDR_BRD_CR57_CMDDLY(base) (DDR_RD_CR57_CMDDLY(base))

/*! @brief Set the CMDDLY field to a new value. */
#define DDR_WR_CR57_CMDDLY(base, value) (DDR_RMW_CR57(base, DDR_CR57_CMDDLY_MASK, DDR_CR57_CMDDLY(value)))
#define DDR_BWR_CR57_CMDDLY(base, value) (DDR_WR_CR57_CMDDLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR57, field CLKDISDLY[10:8] (RW)
 *
 * Delay from DFI clock disable to memory clock disenable.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR57_CLKDISDLY field. */
#define DDR_RD_CR57_CLKDISDLY(base) ((DDR_CR57_REG(base) & DDR_CR57_CLKDISDLY_MASK) >> DDR_CR57_CLKDISDLY_SHIFT)
#define DDR_BRD_CR57_CLKDISDLY(base) (DDR_RD_CR57_CLKDISDLY(base))

/*! @brief Set the CLKDISDLY field to a new value. */
#define DDR_WR_CR57_CLKDISDLY(base, value) (DDR_RMW_CR57(base, DDR_CR57_CLKDISDLY_MASK, DDR_CR57_CLKDISDLY(value)))
#define DDR_BWR_CR57_CLKDISDLY(base, value) (DDR_WR_CR57_CLKDISDLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR57, field CLKENDLY[19:16] (RW)
 *
 * Delay from DFI clock enable to memory clock enable.
 */
/*@{*/
/*! @brief Read current value of the DDR_CR57_CLKENDLY field. */
#define DDR_RD_CR57_CLKENDLY(base) ((DDR_CR57_REG(base) & DDR_CR57_CLKENDLY_MASK) >> DDR_CR57_CLKENDLY_SHIFT)
#define DDR_BRD_CR57_CLKENDLY(base) (DDR_RD_CR57_CLKENDLY(base))

/*! @brief Set the CLKENDLY field to a new value. */
#define DDR_WR_CR57_CLKENDLY(base, value) (DDR_RMW_CR57(base, DDR_CR57_CLKENDLY_MASK, DDR_CR57_CLKENDLY(value)))
#define DDR_BWR_CR57_CLKENDLY(base, value) (DDR_WR_CR57_CLKENDLY(base, value))
/*@}*/

/*!
 * @name Register DDR_CR57, field ODTALTEN[24] (RW)
 *
 * Enable use of non-DFI odt_alt signal .
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
/*@{*/
/*! @brief Read current value of the DDR_CR57_ODTALTEN field. */
#define DDR_RD_CR57_ODTALTEN(base) ((DDR_CR57_REG(base) & DDR_CR57_ODTALTEN_MASK) >> DDR_CR57_ODTALTEN_SHIFT)
#define DDR_BRD_CR57_ODTALTEN(base) (BITBAND_ACCESS32(&DDR_CR57_REG(base), DDR_CR57_ODTALTEN_SHIFT))

/*! @brief Set the ODTALTEN field to a new value. */
#define DDR_WR_CR57_ODTALTEN(base, value) (DDR_RMW_CR57(base, DDR_CR57_ODTALTEN_MASK, DDR_CR57_ODTALTEN(value)))
#define DDR_BWR_CR57_ODTALTEN(base, value) (BITBAND_ACCESS32(&DDR_CR57_REG(base), DDR_CR57_ODTALTEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DDR_CR58 - DDR Control Register 58
 ******************************************************************************/

/*!
 * @brief DDR_CR58 - DDR Control Register 58 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR58 register
 */
/*@{*/
#define DDR_RD_CR58(base)        (DDR_CR58_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR58 bitfields
 */

/*!
 * @name Register DDR_CR58, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR58_Not_Used field. */
#define DDR_RD_CR58_Not_Used(base) ((DDR_CR58_REG(base) & DDR_CR58_Not_Used_MASK) >> DDR_CR58_Not_Used_SHIFT)
#define DDR_BRD_CR58_Not_Used(base) (DDR_RD_CR58_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR58, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR58_NOT_USED field. */
#define DDR_RD_CR58_NOT_USED(base) ((DDR_CR58_REG(base) & DDR_CR58_NOT_USED_MASK) >> DDR_CR58_NOT_USED_SHIFT)
#define DDR_BRD_CR58_NOT_USED(base) (DDR_RD_CR58_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR59 - DDR Control Register 59
 ******************************************************************************/

/*!
 * @brief DDR_CR59 - DDR Control Register 59 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR59 register
 */
/*@{*/
#define DDR_RD_CR59(base)        (DDR_CR59_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR59 bitfields
 */

/*!
 * @name Register DDR_CR59, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR59_Not_Used field. */
#define DDR_RD_CR59_Not_Used(base) ((DDR_CR59_REG(base) & DDR_CR59_Not_Used_MASK) >> DDR_CR59_Not_Used_SHIFT)
#define DDR_BRD_CR59_Not_Used(base) (DDR_RD_CR59_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR59, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR59_NOT_USED field. */
#define DDR_RD_CR59_NOT_USED(base) ((DDR_CR59_REG(base) & DDR_CR59_NOT_USED_MASK) >> DDR_CR59_NOT_USED_SHIFT)
#define DDR_BRD_CR59_NOT_USED(base) (DDR_RD_CR59_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR60 - DDR Control Register 60
 ******************************************************************************/

/*!
 * @brief DDR_CR60 - DDR Control Register 60 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR60 register
 */
/*@{*/
#define DDR_RD_CR60(base)        (DDR_CR60_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR60 bitfields
 */

/*!
 * @name Register DDR_CR60, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR60_Not_Used field. */
#define DDR_RD_CR60_Not_Used(base) ((DDR_CR60_REG(base) & DDR_CR60_Not_Used_MASK) >> DDR_CR60_Not_Used_SHIFT)
#define DDR_BRD_CR60_Not_Used(base) (DDR_RD_CR60_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR60, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR60_NOT_USED field. */
#define DDR_RD_CR60_NOT_USED(base) ((DDR_CR60_REG(base) & DDR_CR60_NOT_USED_MASK) >> DDR_CR60_NOT_USED_SHIFT)
#define DDR_BRD_CR60_NOT_USED(base) (DDR_RD_CR60_NOT_USED(base))
/*@}*/

