pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DDR_CR61 - DDR Control Register 61
 ******************************************************************************/

/*!
 * @brief DDR_CR61 - DDR Control Register 61 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR61 register
 */
/*@{*/
#define DDR_RD_CR61(base)        (DDR_CR61_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR61 bitfields
 */

/*!
 * @name Register DDR_CR61, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR61_Not_Used field. */
#define DDR_RD_CR61_Not_Used(base) ((DDR_CR61_REG(base) & DDR_CR61_Not_Used_MASK) >> DDR_CR61_Not_Used_SHIFT)
#define DDR_BRD_CR61_Not_Used(base) (DDR_RD_CR61_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR61, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR61_NOT_USED field. */
#define DDR_RD_CR61_NOT_USED(base) ((DDR_CR61_REG(base) & DDR_CR61_NOT_USED_MASK) >> DDR_CR61_NOT_USED_SHIFT)
#define DDR_BRD_CR61_NOT_USED(base) (DDR_RD_CR61_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR62 - DDR Control Register 62
 ******************************************************************************/

/*!
 * @brief DDR_CR62 - DDR Control Register 62 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR62 register
 */
/*@{*/
#define DDR_RD_CR62(base)        (DDR_CR62_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR62 bitfields
 */

/*!
 * @name Register DDR_CR62, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR62_Not_Used field. */
#define DDR_RD_CR62_Not_Used(base) ((DDR_CR62_REG(base) & DDR_CR62_Not_Used_MASK) >> DDR_CR62_Not_Used_SHIFT)
#define DDR_BRD_CR62_Not_Used(base) (DDR_RD_CR62_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR62, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR62_NOT_USED field. */
#define DDR_RD_CR62_NOT_USED(base) ((DDR_CR62_REG(base) & DDR_CR62_NOT_USED_MASK) >> DDR_CR62_NOT_USED_SHIFT)
#define DDR_BRD_CR62_NOT_USED(base) (DDR_RD_CR62_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_CR63 - DDR Control Register 63
 ******************************************************************************/

/*!
 * @brief DDR_CR63 - DDR Control Register 63 (ROZ)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DDR_CR63 register
 */
/*@{*/
#define DDR_RD_CR63(base)        (DDR_CR63_REG(base))
/*@}*/

/*
 * Constants & macros for individual DDR_CR63 bitfields
 */

/*!
 * @name Register DDR_CR63, field Not_Used[15:0] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR63_Not_Used field. */
#define DDR_RD_CR63_Not_Used(base) ((DDR_CR63_REG(base) & DDR_CR63_Not_Used_MASK) >> DDR_CR63_Not_Used_SHIFT)
#define DDR_BRD_CR63_Not_Used(base) (DDR_RD_CR63_Not_Used(base))
/*@}*/

/*!
 * @name Register DDR_CR63, field NOT_USED[31:16] (ROZ)
 */
/*@{*/
/*! @brief Read current value of the DDR_CR63_NOT_USED field. */
#define DDR_RD_CR63_NOT_USED(base) ((DDR_CR63_REG(base) & DDR_CR63_NOT_USED_MASK) >> DDR_CR63_NOT_USED_SHIFT)
#define DDR_BRD_CR63_NOT_USED(base) (DDR_RD_CR63_NOT_USED(base))
/*@}*/

/*******************************************************************************
 * DDR_RCR - RCR Control Register
 ******************************************************************************/

/*!
 * @brief DDR_RCR - RCR Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This is a PHY register. It controls the operation of the read clock recovery
 * module.
 */
/*!
 * @name Constants and macros for entire DDR_RCR register
 */
/*@{*/
#define DDR_RD_RCR(base)         (DDR_RCR_REG(base))
#define DDR_WR_RCR(base, value)  (DDR_RCR_REG(base) = (value))
#define DDR_RMW_RCR(base, mask, value) (DDR_WR_RCR(base, (DDR_RD_RCR(base) & ~(mask)) | (value)))
#define DDR_SET_RCR(base, value) (DDR_WR_RCR(base, DDR_RD_RCR(base) |  (value)))
#define DDR_CLR_RCR(base, value) (DDR_WR_RCR(base, DDR_RD_RCR(base) & ~(value)))
#define DDR_TOG_RCR(base, value) (DDR_WR_RCR(base, DDR_RD_RCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_RCR bitfields
 */

/*!
 * @name Register DDR_RCR, field RST[30] (WO)
 *
 * Read clock recovery module reset. Used to force RCR software reset in
 * addition to system reset.
 *
 * Values:
 * - 0 - No software reset
 * - 1 - Force software reset
 */
/*@{*/
/*! @brief Set the RST field to a new value. */
#define DDR_WR_RCR_RST(base, value) (DDR_RMW_RCR(base, DDR_RCR_RST_MASK, DDR_RCR_RST(value)))
#define DDR_BWR_RCR_RST(base, value) (DDR_WR_RCR_RST(base, value))
/*@}*/

/*******************************************************************************
 * DDR_PAD_CTRL - I/O Pad Control Register
 ******************************************************************************/

/*!
 * @brief DDR_PAD_CTRL - I/O Pad Control Register (RW)
 *
 * Reset value: 0x00000200U
 */
/*!
 * @name Constants and macros for entire DDR_PAD_CTRL register
 */
/*@{*/
#define DDR_RD_PAD_CTRL(base)    (DDR_PAD_CTRL_REG(base))
#define DDR_WR_PAD_CTRL(base, value) (DDR_PAD_CTRL_REG(base) = (value))
#define DDR_RMW_PAD_CTRL(base, mask, value) (DDR_WR_PAD_CTRL(base, (DDR_RD_PAD_CTRL(base) & ~(mask)) | (value)))
#define DDR_SET_PAD_CTRL(base, value) (DDR_WR_PAD_CTRL(base, DDR_RD_PAD_CTRL(base) |  (value)))
#define DDR_CLR_PAD_CTRL(base, value) (DDR_WR_PAD_CTRL(base, DDR_RD_PAD_CTRL(base) & ~(value)))
#define DDR_TOG_PAD_CTRL(base, value) (DDR_WR_PAD_CTRL(base, DDR_RD_PAD_CTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DDR_PAD_CTRL bitfields
 */

/*!
 * @name Register DDR_PAD_CTRL, field SPARE_DLY_CTRL[3:0] (RW)
 *
 * SPARE_DLY_CTRL[1:0] is used to control the delay chain #0. 00 No buffer, only
 * mux delay 01 4 buffers 10 7 buffers 11 10 buffers SPARE_DLY_CTRL[3:2] is not
 * used. Do not write to this bit field. Read access can fail if
 * SPARE_DLY_CTRL[1:0] = 00. Use SPARE_DLY_CTRL[1:0] = 01 instead.
 */
/*@{*/
/*! @brief Read current value of the DDR_PAD_CTRL_SPARE_DLY_CTRL field. */
#define DDR_RD_PAD_CTRL_SPARE_DLY_CTRL(base) ((DDR_PAD_CTRL_REG(base) & DDR_PAD_CTRL_SPARE_DLY_CTRL_MASK) >> DDR_PAD_CTRL_SPARE_DLY_CTRL_SHIFT)
#define DDR_BRD_PAD_CTRL_SPARE_DLY_CTRL(base) (DDR_RD_PAD_CTRL_SPARE_DLY_CTRL(base))

