pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the SPARE_DLY_CTRL field to a new value. */
#define DDR_WR_PAD_CTRL_SPARE_DLY_CTRL(base, value) (DDR_RMW_PAD_CTRL(base, DDR_PAD_CTRL_SPARE_DLY_CTRL_MASK, DDR_PAD_CTRL_SPARE_DLY_CTRL(value)))
#define DDR_BWR_PAD_CTRL_SPARE_DLY_CTRL(base, value) (DDR_WR_PAD_CTRL_SPARE_DLY_CTRL(base, value))
/*@}*/

/*!
 * @name Register DDR_PAD_CTRL, field PAD_ODT_CS0[25:24] (RW)
 *
 * On Die Termination of the pads when the Read command is issued to chip select
 * 0. This version of the PHY cannot supports different pad ODT settings when
 * external chip-selects have different drive capability. The PHY will use only the
 * PAD_ODT_CS0 setting for the pad's ODT resistor. The user needs to disable the
 * pads for low power mode operation.
 *
 * Values:
 * - 00 - ODT Disabled
 * - 01 - 75 Ohms
 * - 10 - 150 Ohms
 * - 11 - 50 Ohms
 */
/*@{*/
/*! @brief Read current value of the DDR_PAD_CTRL_PAD_ODT_CS0 field. */
#define DDR_RD_PAD_CTRL_PAD_ODT_CS0(base) ((DDR_PAD_CTRL_REG(base) & DDR_PAD_CTRL_PAD_ODT_CS0_MASK) >> DDR_PAD_CTRL_PAD_ODT_CS0_SHIFT)
#define DDR_BRD_PAD_CTRL_PAD_ODT_CS0(base) (DDR_RD_PAD_CTRL_PAD_ODT_CS0(base))

/*! @brief Set the PAD_ODT_CS0 field to a new value. */
#define DDR_WR_PAD_CTRL_PAD_ODT_CS0(base, value) (DDR_RMW_PAD_CTRL(base, DDR_PAD_CTRL_PAD_ODT_CS0_MASK, DDR_PAD_CTRL_PAD_ODT_CS0(value)))
#define DDR_BWR_PAD_CTRL_PAD_ODT_CS0(base, value) (DDR_WR_PAD_CTRL_PAD_ODT_CS0(base, value))
/*@}*/

/*
 * MK70F12 DMA
 *
 * Enhanced direct memory access controller
 *
 * Registers defined in this header file:
 * - DMA_CR - Control Register
 * - DMA_ES - Error Status Register
 * - DMA_ERQ - Enable Request Register
 * - DMA_EEI - Enable Error Interrupt Register
 * - DMA_CEEI - Clear Enable Error Interrupt Register
 * - DMA_SEEI - Set Enable Error Interrupt Register
 * - DMA_CERQ - Clear Enable Request Register
 * - DMA_SERQ - Set Enable Request Register
 * - DMA_CDNE - Clear DONE Status Bit Register
 * - DMA_SSRT - Set START Bit Register
 * - DMA_CERR - Clear Error Register
 * - DMA_CINT - Clear Interrupt Request Register
 * - DMA_INT - Interrupt Request Register
 * - DMA_ERR - Error Register
 * - DMA_HRS - Hardware Request Status Register
 * - DMA_DCHPRI3 - Channel n Priority Register
 * - DMA_DCHPRI2 - Channel n Priority Register
 * - DMA_DCHPRI1 - Channel n Priority Register
 * - DMA_DCHPRI0 - Channel n Priority Register
 * - DMA_DCHPRI7 - Channel n Priority Register
 * - DMA_DCHPRI6 - Channel n Priority Register
 * - DMA_DCHPRI5 - Channel n Priority Register
 * - DMA_DCHPRI4 - Channel n Priority Register
 * - DMA_DCHPRI11 - Channel n Priority Register
 * - DMA_DCHPRI10 - Channel n Priority Register
 * - DMA_DCHPRI9 - Channel n Priority Register
 * - DMA_DCHPRI8 - Channel n Priority Register
 * - DMA_DCHPRI15 - Channel n Priority Register
 * - DMA_DCHPRI14 - Channel n Priority Register
 * - DMA_DCHPRI13 - Channel n Priority Register
 * - DMA_DCHPRI12 - Channel n Priority Register
 * - DMA_DCHPRI19 - Channel n Priority Register
 * - DMA_DCHPRI18 - Channel n Priority Register
 * - DMA_DCHPRI17 - Channel n Priority Register
 * - DMA_DCHPRI16 - Channel n Priority Register
 * - DMA_DCHPRI23 - Channel n Priority Register
 * - DMA_DCHPRI22 - Channel n Priority Register
 * - DMA_DCHPRI21 - Channel n Priority Register
 * - DMA_DCHPRI20 - Channel n Priority Register
 * - DMA_DCHPRI27 - Channel n Priority Register
 * - DMA_DCHPRI26 - Channel n Priority Register
 * - DMA_DCHPRI25 - Channel n Priority Register
 * - DMA_DCHPRI24 - Channel n Priority Register
 * - DMA_DCHPRI31 - Channel n Priority Register
 * - DMA_DCHPRI30 - Channel n Priority Register
 * - DMA_DCHPRI29 - Channel n Priority Register
 * - DMA_DCHPRI28 - Channel n Priority Register
 * - DMA_SADDR - TCD Source Address
 * - DMA_SOFF - TCD Signed Source Address Offset
 * - DMA_ATTR - TCD Transfer Attributes
 * - DMA_NBYTES_MLNO - TCD Minor Byte Count (Minor Loop Disabled)
 * - DMA_NBYTES_MLOFFNO - TCD Signed Minor Loop Offset (Minor Loop Enabled and Offset Disabled)
 * - DMA_NBYTES_MLOFFYES - TCD Signed Minor Loop Offset (Minor Loop and Offset Enabled)
 * - DMA_SLAST - TCD Last Source Address Adjustment
 * - DMA_DADDR - TCD Destination Address
 * - DMA_DOFF - TCD Signed Destination Address Offset
 * - DMA_CITER_ELINKNO - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_CITER_ELINKYES - TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 * - DMA_DLAST_SGA - TCD Last Destination Address Adjustment/Scatter Gather Address
 * - DMA_CSR - TCD Control and Status
 * - DMA_BITER_ELINKNO - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)
 * - DMA_BITER_ELINKYES - TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)
 */

#define DMA_INSTANCE_COUNT (1U) /*!< Number of instances of the DMA module. */
#define DMA_IDX (0U) /*!< Instance number for DMA. */

/*******************************************************************************
 * DMA_CR - Control Register
 ******************************************************************************/

/*!
 * @brief DMA_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CR defines the basic operating configuration of the DMA. The DMA
 * arbitrates channel service requests in two groups of 16 channels each: Group 1
 * contains channels 31-16 Group 0 contains channels 15-0 Arbitration within a group can
 * be configured to use either a fixed-priority or a round-robin scheme. For
 * fixed-priority arbitration, the highest priority channel requesting service is
 * selected to execute. The channel priority registers assign the priorities; see
 * the DCHPRIn registers. For round-robin arbitration, the channel priorities are
 * ignored and channels within each group are cycled through without regard to
 * priority. For proper operation, writes to the CR register must be performed only
 * when the DMA channels are inactive; that is, when TCDn_CSR[ACTIVE] bits are
 * cleared. The group priorities operate in a similar fashion. In group fixed
 * priority arbitration mode, channel service requests in the highest priority group
 * are executed first, where priority level 3 is the highest and priority level 0
 * is the lowest. The group priorities are assigned in the GRPnPRI fields of the
 * DMA Control Register (CR). All group priorities must have unique values prior
 * to any channel service requests occurring; otherwise, a configuration error
 * will be reported. For group round robin arbitration, the group priorities are
 * ignored and the groups are cycled through without regard to priority.
 */
/*!
 * @name Constants and macros for entire DMA_CR register
 */
/*@{*/
#define DMA_RD_CR(base)          (DMA_CR_REG(base))
#define DMA_WR_CR(base, value)   (DMA_CR_REG(base) = (value))
#define DMA_RMW_CR(base, mask, value) (DMA_WR_CR(base, (DMA_RD_CR(base) & ~(mask)) | (value)))
#define DMA_SET_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) |  (value)))
#define DMA_CLR_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) & ~(value)))
#define DMA_TOG_CR(base, value)  (DMA_WR_CR(base, DMA_RD_CR(base) ^  (value)))
/*@}*/

