pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the ERR31 field to a new value. */
#define DMA_WR_ERR_ERR31(base, value) (DMA_RMW_ERR(base, (DMA_ERR_ERR31_MASK | DMA_ERR_ERR0_MASK | DMA_ERR_ERR1_MASK | DMA_ERR_ERR2_MASK | DMA_ERR_ERR3_MASK | DMA_ERR_ERR4_MASK | DMA_ERR_ERR5_MASK | DMA_ERR_ERR6_MASK | DMA_ERR_ERR7_MASK | DMA_ERR_ERR8_MASK | DMA_ERR_ERR9_MASK | DMA_ERR_ERR10_MASK | DMA_ERR_ERR11_MASK | DMA_ERR_ERR12_MASK | DMA_ERR_ERR13_MASK | DMA_ERR_ERR14_MASK | DMA_ERR_ERR15_MASK | DMA_ERR_ERR16_MASK | DMA_ERR_ERR17_MASK | DMA_ERR_ERR18_MASK | DMA_ERR_ERR19_MASK | DMA_ERR_ERR20_MASK | DMA_ERR_ERR21_MASK | DMA_ERR_ERR22_MASK | DMA_ERR_ERR23_MASK | DMA_ERR_ERR24_MASK | DMA_ERR_ERR25_MASK | DMA_ERR_ERR26_MASK | DMA_ERR_ERR27_MASK | DMA_ERR_ERR28_MASK | DMA_ERR_ERR29_MASK | DMA_ERR_ERR30_MASK), DMA_ERR_ERR31(value)))
#define DMA_BWR_ERR_ERR31(base, value) (BITBAND_ACCESS32(&DMA_ERR_REG(base), DMA_ERR_ERR31_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_HRS - Hardware Request Status Register
 ******************************************************************************/

/*!
 * @brief DMA_HRS - Hardware Request Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The HRS provide a bit map for the DMA channels, signaling the presence of a
 * hardware request for each channel. The hardware request status bits reflect the
 * current state of the register and qualified (via the ERQ fields) DMA request
 * signals as seen by the DMA's arbitration logic. This view into the hardware
 * request signals may be used for debug purposes. These bits reflect the state of
 * the request as seen by the arbitration logic. Therefore, this status is
 * affected by the ERQ bits.
 */
/*!
 * @name Constants and macros for entire DMA_HRS register
 */
/*@{*/
#define DMA_RD_HRS(base)         (DMA_HRS_REG(base))
#define DMA_WR_HRS(base, value)  (DMA_HRS_REG(base) = (value))
#define DMA_RMW_HRS(base, mask, value) (DMA_WR_HRS(base, (DMA_RD_HRS(base) & ~(mask)) | (value)))
#define DMA_SET_HRS(base, value) (DMA_WR_HRS(base, DMA_RD_HRS(base) |  (value)))
#define DMA_CLR_HRS(base, value) (DMA_WR_HRS(base, DMA_RD_HRS(base) & ~(value)))
#define DMA_TOG_HRS(base, value) (DMA_WR_HRS(base, DMA_RD_HRS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_HRS bitfields
 */

/*!
 * @name Register DMA_HRS, field HRS0[0] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS0 field. */
#define DMA_RD_HRS_HRS0(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS0_MASK) >> DMA_HRS_HRS0_SHIFT)
#define DMA_BRD_HRS_HRS0(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS0_SHIFT))

/*! @brief Set the HRS0 field to a new value. */
#define DMA_WR_HRS_HRS0(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS0_MASK, DMA_HRS_HRS0(value)))
#define DMA_BWR_HRS_HRS0(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS1[1] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS1 field. */
#define DMA_RD_HRS_HRS1(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS1_MASK) >> DMA_HRS_HRS1_SHIFT)
#define DMA_BRD_HRS_HRS1(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS1_SHIFT))

/*! @brief Set the HRS1 field to a new value. */
#define DMA_WR_HRS_HRS1(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS1_MASK, DMA_HRS_HRS1(value)))
#define DMA_BWR_HRS_HRS1(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS2[2] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS2 field. */
#define DMA_RD_HRS_HRS2(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS2_MASK) >> DMA_HRS_HRS2_SHIFT)
#define DMA_BRD_HRS_HRS2(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS2_SHIFT))

/*! @brief Set the HRS2 field to a new value. */
#define DMA_WR_HRS_HRS2(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS2_MASK, DMA_HRS_HRS2(value)))
#define DMA_BWR_HRS_HRS2(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS3[3] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS3 field. */
#define DMA_RD_HRS_HRS3(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS3_MASK) >> DMA_HRS_HRS3_SHIFT)
#define DMA_BRD_HRS_HRS3(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS3_SHIFT))

/*! @brief Set the HRS3 field to a new value. */
#define DMA_WR_HRS_HRS3(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS3_MASK, DMA_HRS_HRS3(value)))
#define DMA_BWR_HRS_HRS3(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS4[4] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS4 field. */
#define DMA_RD_HRS_HRS4(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS4_MASK) >> DMA_HRS_HRS4_SHIFT)
#define DMA_BRD_HRS_HRS4(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS4_SHIFT))

/*! @brief Set the HRS4 field to a new value. */
#define DMA_WR_HRS_HRS4(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS4_MASK, DMA_HRS_HRS4(value)))
#define DMA_BWR_HRS_HRS4(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS5[5] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS5 field. */
#define DMA_RD_HRS_HRS5(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS5_MASK) >> DMA_HRS_HRS5_SHIFT)
#define DMA_BRD_HRS_HRS5(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS5_SHIFT))

/*! @brief Set the HRS5 field to a new value. */
#define DMA_WR_HRS_HRS5(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS5_MASK, DMA_HRS_HRS5(value)))
#define DMA_BWR_HRS_HRS5(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS6[6] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS6 field. */
#define DMA_RD_HRS_HRS6(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS6_MASK) >> DMA_HRS_HRS6_SHIFT)
#define DMA_BRD_HRS_HRS6(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS6_SHIFT))

/*! @brief Set the HRS6 field to a new value. */
#define DMA_WR_HRS_HRS6(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS6_MASK, DMA_HRS_HRS6(value)))
#define DMA_BWR_HRS_HRS6(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS7[7] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS7 field. */
#define DMA_RD_HRS_HRS7(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS7_MASK) >> DMA_HRS_HRS7_SHIFT)
#define DMA_BRD_HRS_HRS7(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS7_SHIFT))

/*! @brief Set the HRS7 field to a new value. */
#define DMA_WR_HRS_HRS7(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS7_MASK, DMA_HRS_HRS7(value)))
#define DMA_BWR_HRS_HRS7(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS8[8] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS8 field. */
#define DMA_RD_HRS_HRS8(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS8_MASK) >> DMA_HRS_HRS8_SHIFT)
#define DMA_BRD_HRS_HRS8(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS8_SHIFT))

/*! @brief Set the HRS8 field to a new value. */
#define DMA_WR_HRS_HRS8(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS8_MASK, DMA_HRS_HRS8(value)))
#define DMA_BWR_HRS_HRS8(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS9[9] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS9 field. */
#define DMA_RD_HRS_HRS9(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS9_MASK) >> DMA_HRS_HRS9_SHIFT)
#define DMA_BRD_HRS_HRS9(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS9_SHIFT))

