pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the HRS9 field to a new value. */
#define DMA_WR_HRS_HRS9(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS9_MASK, DMA_HRS_HRS9(value)))
#define DMA_BWR_HRS_HRS9(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS10[10] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS10 field. */
#define DMA_RD_HRS_HRS10(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS10_MASK) >> DMA_HRS_HRS10_SHIFT)
#define DMA_BRD_HRS_HRS10(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS10_SHIFT))

/*! @brief Set the HRS10 field to a new value. */
#define DMA_WR_HRS_HRS10(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS10_MASK, DMA_HRS_HRS10(value)))
#define DMA_BWR_HRS_HRS10(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS11[11] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS11 field. */
#define DMA_RD_HRS_HRS11(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS11_MASK) >> DMA_HRS_HRS11_SHIFT)
#define DMA_BRD_HRS_HRS11(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS11_SHIFT))

/*! @brief Set the HRS11 field to a new value. */
#define DMA_WR_HRS_HRS11(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS11_MASK, DMA_HRS_HRS11(value)))
#define DMA_BWR_HRS_HRS11(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS12[12] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS12 field. */
#define DMA_RD_HRS_HRS12(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS12_MASK) >> DMA_HRS_HRS12_SHIFT)
#define DMA_BRD_HRS_HRS12(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS12_SHIFT))

/*! @brief Set the HRS12 field to a new value. */
#define DMA_WR_HRS_HRS12(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS12_MASK, DMA_HRS_HRS12(value)))
#define DMA_BWR_HRS_HRS12(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS13[13] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS13 field. */
#define DMA_RD_HRS_HRS13(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS13_MASK) >> DMA_HRS_HRS13_SHIFT)
#define DMA_BRD_HRS_HRS13(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS13_SHIFT))

/*! @brief Set the HRS13 field to a new value. */
#define DMA_WR_HRS_HRS13(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS13_MASK, DMA_HRS_HRS13(value)))
#define DMA_BWR_HRS_HRS13(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS14[14] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS14 field. */
#define DMA_RD_HRS_HRS14(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS14_MASK) >> DMA_HRS_HRS14_SHIFT)
#define DMA_BRD_HRS_HRS14(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS14_SHIFT))

/*! @brief Set the HRS14 field to a new value. */
#define DMA_WR_HRS_HRS14(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS14_MASK, DMA_HRS_HRS14(value)))
#define DMA_BWR_HRS_HRS14(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS15[15] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS15 field. */
#define DMA_RD_HRS_HRS15(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS15_MASK) >> DMA_HRS_HRS15_SHIFT)
#define DMA_BRD_HRS_HRS15(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS15_SHIFT))

/*! @brief Set the HRS15 field to a new value. */
#define DMA_WR_HRS_HRS15(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS15_MASK, DMA_HRS_HRS15(value)))
#define DMA_BWR_HRS_HRS15(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS16[16] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS16 field. */
#define DMA_RD_HRS_HRS16(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS16_MASK) >> DMA_HRS_HRS16_SHIFT)
#define DMA_BRD_HRS_HRS16(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS16_SHIFT))

/*! @brief Set the HRS16 field to a new value. */
#define DMA_WR_HRS_HRS16(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS16_MASK, DMA_HRS_HRS16(value)))
#define DMA_BWR_HRS_HRS16(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS17[17] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS17 field. */
#define DMA_RD_HRS_HRS17(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS17_MASK) >> DMA_HRS_HRS17_SHIFT)
#define DMA_BRD_HRS_HRS17(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS17_SHIFT))

/*! @brief Set the HRS17 field to a new value. */
#define DMA_WR_HRS_HRS17(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS17_MASK, DMA_HRS_HRS17(value)))
#define DMA_BWR_HRS_HRS17(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS18[18] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS18 field. */
#define DMA_RD_HRS_HRS18(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS18_MASK) >> DMA_HRS_HRS18_SHIFT)
#define DMA_BRD_HRS_HRS18(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS18_SHIFT))

/*! @brief Set the HRS18 field to a new value. */
#define DMA_WR_HRS_HRS18(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS18_MASK, DMA_HRS_HRS18(value)))
#define DMA_BWR_HRS_HRS18(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS19[19] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS19 field. */
#define DMA_RD_HRS_HRS19(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS19_MASK) >> DMA_HRS_HRS19_SHIFT)
#define DMA_BRD_HRS_HRS19(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS19_SHIFT))

/*! @brief Set the HRS19 field to a new value. */
#define DMA_WR_HRS_HRS19(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS19_MASK, DMA_HRS_HRS19(value)))
#define DMA_BWR_HRS_HRS19(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS20[20] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS20 field. */
#define DMA_RD_HRS_HRS20(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS20_MASK) >> DMA_HRS_HRS20_SHIFT)
#define DMA_BRD_HRS_HRS20(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS20_SHIFT))

/*! @brief Set the HRS20 field to a new value. */
#define DMA_WR_HRS_HRS20(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS20_MASK, DMA_HRS_HRS20(value)))
#define DMA_BWR_HRS_HRS20(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS21[21] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS21 field. */
#define DMA_RD_HRS_HRS21(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS21_MASK) >> DMA_HRS_HRS21_SHIFT)
#define DMA_BRD_HRS_HRS21(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS21_SHIFT))

/*! @brief Set the HRS21 field to a new value. */
#define DMA_WR_HRS_HRS21(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS21_MASK, DMA_HRS_HRS21(value)))
#define DMA_BWR_HRS_HRS21(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS22[22] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS22 field. */
#define DMA_RD_HRS_HRS22(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS22_MASK) >> DMA_HRS_HRS22_SHIFT)
#define DMA_BRD_HRS_HRS22(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS22_SHIFT))

/*! @brief Set the HRS22 field to a new value. */
#define DMA_WR_HRS_HRS22(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS22_MASK, DMA_HRS_HRS22(value)))
#define DMA_BWR_HRS_HRS22(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS23[23] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS23 field. */
#define DMA_RD_HRS_HRS23(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS23_MASK) >> DMA_HRS_HRS23_SHIFT)
#define DMA_BRD_HRS_HRS23(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS23_SHIFT))

/*! @brief Set the HRS23 field to a new value. */
#define DMA_WR_HRS_HRS23(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS23_MASK, DMA_HRS_HRS23(value)))
#define DMA_BWR_HRS_HRS23(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS24[24] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS24 field. */
#define DMA_RD_HRS_HRS24(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS24_MASK) >> DMA_HRS_HRS24_SHIFT)
#define DMA_BRD_HRS_HRS24(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS24_SHIFT))

