pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the HRS24 field to a new value. */
#define DMA_WR_HRS_HRS24(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS24_MASK, DMA_HRS_HRS24(value)))
#define DMA_BWR_HRS_HRS24(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS25[25] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS25 field. */
#define DMA_RD_HRS_HRS25(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS25_MASK) >> DMA_HRS_HRS25_SHIFT)
#define DMA_BRD_HRS_HRS25(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS25_SHIFT))

/*! @brief Set the HRS25 field to a new value. */
#define DMA_WR_HRS_HRS25(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS25_MASK, DMA_HRS_HRS25(value)))
#define DMA_BWR_HRS_HRS25(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS26[26] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS26 field. */
#define DMA_RD_HRS_HRS26(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS26_MASK) >> DMA_HRS_HRS26_SHIFT)
#define DMA_BRD_HRS_HRS26(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS26_SHIFT))

/*! @brief Set the HRS26 field to a new value. */
#define DMA_WR_HRS_HRS26(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS26_MASK, DMA_HRS_HRS26(value)))
#define DMA_BWR_HRS_HRS26(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS27[27] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS27 field. */
#define DMA_RD_HRS_HRS27(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS27_MASK) >> DMA_HRS_HRS27_SHIFT)
#define DMA_BRD_HRS_HRS27(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS27_SHIFT))

/*! @brief Set the HRS27 field to a new value. */
#define DMA_WR_HRS_HRS27(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS27_MASK, DMA_HRS_HRS27(value)))
#define DMA_BWR_HRS_HRS27(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS28[28] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS28 field. */
#define DMA_RD_HRS_HRS28(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS28_MASK) >> DMA_HRS_HRS28_SHIFT)
#define DMA_BRD_HRS_HRS28(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS28_SHIFT))

/*! @brief Set the HRS28 field to a new value. */
#define DMA_WR_HRS_HRS28(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS28_MASK, DMA_HRS_HRS28(value)))
#define DMA_BWR_HRS_HRS28(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS29[29] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS29 field. */
#define DMA_RD_HRS_HRS29(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS29_MASK) >> DMA_HRS_HRS29_SHIFT)
#define DMA_BRD_HRS_HRS29(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS29_SHIFT))

/*! @brief Set the HRS29 field to a new value. */
#define DMA_WR_HRS_HRS29(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS29_MASK, DMA_HRS_HRS29(value)))
#define DMA_BWR_HRS_HRS29(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS30[30] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS30 field. */
#define DMA_RD_HRS_HRS30(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS30_MASK) >> DMA_HRS_HRS30_SHIFT)
#define DMA_BRD_HRS_HRS30(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS30_SHIFT))

/*! @brief Set the HRS30 field to a new value. */
#define DMA_WR_HRS_HRS30(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS30_MASK, DMA_HRS_HRS30(value)))
#define DMA_BWR_HRS_HRS30(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_HRS, field HRS31[31] (RW)
 *
 * Values:
 * - 0 - A hardware service request for the corresponding channel is not present
 * - 1 - A hardware service request for the corresponding channel is present
 */
/*@{*/
/*! @brief Read current value of the DMA_HRS_HRS31 field. */
#define DMA_RD_HRS_HRS31(base) ((DMA_HRS_REG(base) & DMA_HRS_HRS31_MASK) >> DMA_HRS_HRS31_SHIFT)
#define DMA_BRD_HRS_HRS31(base) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS31_SHIFT))

/*! @brief Set the HRS31 field to a new value. */
#define DMA_WR_HRS_HRS31(base, value) (DMA_RMW_HRS(base, DMA_HRS_HRS31_MASK, DMA_HRS_HRS31(value)))
#define DMA_BWR_HRS_HRS31(base, value) (BITBAND_ACCESS32(&DMA_HRS_REG(base), DMA_HRS_HRS31_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI3 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI3 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI3 register
 */
/*@{*/
#define DMA_RD_DCHPRI3(base)     (DMA_DCHPRI3_REG(base))
#define DMA_WR_DCHPRI3(base, value) (DMA_DCHPRI3_REG(base) = (value))
#define DMA_RMW_DCHPRI3(base, mask, value) (DMA_WR_DCHPRI3(base, (DMA_RD_DCHPRI3(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) |  (value)))
#define DMA_CLR_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) & ~(value)))
#define DMA_TOG_DCHPRI3(base, value) (DMA_WR_DCHPRI3(base, DMA_RD_DCHPRI3(base) ^  (value)))
/*@}*/

