pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DMA_DCHPRI19 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI19 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI19 register
 */
/*@{*/
#define DMA_RD_DCHPRI19(base)    (DMA_DCHPRI19_REG(base))
#define DMA_WR_DCHPRI19(base, value) (DMA_DCHPRI19_REG(base) = (value))
#define DMA_RMW_DCHPRI19(base, mask, value) (DMA_WR_DCHPRI19(base, (DMA_RD_DCHPRI19(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI19(base, value) (DMA_WR_DCHPRI19(base, DMA_RD_DCHPRI19(base) |  (value)))
#define DMA_CLR_DCHPRI19(base, value) (DMA_WR_DCHPRI19(base, DMA_RD_DCHPRI19(base) & ~(value)))
#define DMA_TOG_DCHPRI19(base, value) (DMA_WR_DCHPRI19(base, DMA_RD_DCHPRI19(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI19 bitfields
 */

/*!
 * @name Register DMA_DCHPRI19, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI19_CHPRI field. */
#define DMA_RD_DCHPRI19_CHPRI(base) ((DMA_DCHPRI19_REG(base) & DMA_DCHPRI19_CHPRI_MASK) >> DMA_DCHPRI19_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI19_CHPRI(base) (DMA_RD_DCHPRI19_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI19_CHPRI(base, value) (DMA_RMW_DCHPRI19(base, DMA_DCHPRI19_CHPRI_MASK, DMA_DCHPRI19_CHPRI(value)))
#define DMA_BWR_DCHPRI19_CHPRI(base, value) (DMA_WR_DCHPRI19_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI19, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI19_GRPPRI field. */
#define DMA_RD_DCHPRI19_GRPPRI(base) ((DMA_DCHPRI19_REG(base) & DMA_DCHPRI19_GRPPRI_MASK) >> DMA_DCHPRI19_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI19_GRPPRI(base) (DMA_RD_DCHPRI19_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI19, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI19_DPA field. */
#define DMA_RD_DCHPRI19_DPA(base) ((DMA_DCHPRI19_REG(base) & DMA_DCHPRI19_DPA_MASK) >> DMA_DCHPRI19_DPA_SHIFT)
#define DMA_BRD_DCHPRI19_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI19_REG(base), DMA_DCHPRI19_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI19_DPA(base, value) (DMA_RMW_DCHPRI19(base, DMA_DCHPRI19_DPA_MASK, DMA_DCHPRI19_DPA(value)))
#define DMA_BWR_DCHPRI19_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI19_REG(base), DMA_DCHPRI19_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI19, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI19_ECP field. */
#define DMA_RD_DCHPRI19_ECP(base) ((DMA_DCHPRI19_REG(base) & DMA_DCHPRI19_ECP_MASK) >> DMA_DCHPRI19_ECP_SHIFT)
#define DMA_BRD_DCHPRI19_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI19_REG(base), DMA_DCHPRI19_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI19_ECP(base, value) (DMA_RMW_DCHPRI19(base, DMA_DCHPRI19_ECP_MASK, DMA_DCHPRI19_ECP(value)))
#define DMA_BWR_DCHPRI19_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI19_REG(base), DMA_DCHPRI19_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI18 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI18 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI18 register
 */
/*@{*/
#define DMA_RD_DCHPRI18(base)    (DMA_DCHPRI18_REG(base))
#define DMA_WR_DCHPRI18(base, value) (DMA_DCHPRI18_REG(base) = (value))
#define DMA_RMW_DCHPRI18(base, mask, value) (DMA_WR_DCHPRI18(base, (DMA_RD_DCHPRI18(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI18(base, value) (DMA_WR_DCHPRI18(base, DMA_RD_DCHPRI18(base) |  (value)))
#define DMA_CLR_DCHPRI18(base, value) (DMA_WR_DCHPRI18(base, DMA_RD_DCHPRI18(base) & ~(value)))
#define DMA_TOG_DCHPRI18(base, value) (DMA_WR_DCHPRI18(base, DMA_RD_DCHPRI18(base) ^  (value)))
/*@}*/

