pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI18 bitfields
 */

/*!
 * @name Register DMA_DCHPRI18, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI18_CHPRI field. */
#define DMA_RD_DCHPRI18_CHPRI(base) ((DMA_DCHPRI18_REG(base) & DMA_DCHPRI18_CHPRI_MASK) >> DMA_DCHPRI18_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI18_CHPRI(base) (DMA_RD_DCHPRI18_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI18_CHPRI(base, value) (DMA_RMW_DCHPRI18(base, DMA_DCHPRI18_CHPRI_MASK, DMA_DCHPRI18_CHPRI(value)))
#define DMA_BWR_DCHPRI18_CHPRI(base, value) (DMA_WR_DCHPRI18_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI18, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI18_GRPPRI field. */
#define DMA_RD_DCHPRI18_GRPPRI(base) ((DMA_DCHPRI18_REG(base) & DMA_DCHPRI18_GRPPRI_MASK) >> DMA_DCHPRI18_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI18_GRPPRI(base) (DMA_RD_DCHPRI18_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI18, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI18_DPA field. */
#define DMA_RD_DCHPRI18_DPA(base) ((DMA_DCHPRI18_REG(base) & DMA_DCHPRI18_DPA_MASK) >> DMA_DCHPRI18_DPA_SHIFT)
#define DMA_BRD_DCHPRI18_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI18_REG(base), DMA_DCHPRI18_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI18_DPA(base, value) (DMA_RMW_DCHPRI18(base, DMA_DCHPRI18_DPA_MASK, DMA_DCHPRI18_DPA(value)))
#define DMA_BWR_DCHPRI18_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI18_REG(base), DMA_DCHPRI18_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI18, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI18_ECP field. */
#define DMA_RD_DCHPRI18_ECP(base) ((DMA_DCHPRI18_REG(base) & DMA_DCHPRI18_ECP_MASK) >> DMA_DCHPRI18_ECP_SHIFT)
#define DMA_BRD_DCHPRI18_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI18_REG(base), DMA_DCHPRI18_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI18_ECP(base, value) (DMA_RMW_DCHPRI18(base, DMA_DCHPRI18_ECP_MASK, DMA_DCHPRI18_ECP(value)))
#define DMA_BWR_DCHPRI18_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI18_REG(base), DMA_DCHPRI18_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI17 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI17 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI17 register
 */
/*@{*/
#define DMA_RD_DCHPRI17(base)    (DMA_DCHPRI17_REG(base))
#define DMA_WR_DCHPRI17(base, value) (DMA_DCHPRI17_REG(base) = (value))
#define DMA_RMW_DCHPRI17(base, mask, value) (DMA_WR_DCHPRI17(base, (DMA_RD_DCHPRI17(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI17(base, value) (DMA_WR_DCHPRI17(base, DMA_RD_DCHPRI17(base) |  (value)))
#define DMA_CLR_DCHPRI17(base, value) (DMA_WR_DCHPRI17(base, DMA_RD_DCHPRI17(base) & ~(value)))
#define DMA_TOG_DCHPRI17(base, value) (DMA_WR_DCHPRI17(base, DMA_RD_DCHPRI17(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI17 bitfields
 */

/*!
 * @name Register DMA_DCHPRI17, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI17_CHPRI field. */
#define DMA_RD_DCHPRI17_CHPRI(base) ((DMA_DCHPRI17_REG(base) & DMA_DCHPRI17_CHPRI_MASK) >> DMA_DCHPRI17_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI17_CHPRI(base) (DMA_RD_DCHPRI17_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI17_CHPRI(base, value) (DMA_RMW_DCHPRI17(base, DMA_DCHPRI17_CHPRI_MASK, DMA_DCHPRI17_CHPRI(value)))
#define DMA_BWR_DCHPRI17_CHPRI(base, value) (DMA_WR_DCHPRI17_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI17, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI17_GRPPRI field. */
#define DMA_RD_DCHPRI17_GRPPRI(base) ((DMA_DCHPRI17_REG(base) & DMA_DCHPRI17_GRPPRI_MASK) >> DMA_DCHPRI17_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI17_GRPPRI(base) (DMA_RD_DCHPRI17_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI17, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI17_DPA field. */
#define DMA_RD_DCHPRI17_DPA(base) ((DMA_DCHPRI17_REG(base) & DMA_DCHPRI17_DPA_MASK) >> DMA_DCHPRI17_DPA_SHIFT)
#define DMA_BRD_DCHPRI17_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI17_REG(base), DMA_DCHPRI17_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI17_DPA(base, value) (DMA_RMW_DCHPRI17(base, DMA_DCHPRI17_DPA_MASK, DMA_DCHPRI17_DPA(value)))
#define DMA_BWR_DCHPRI17_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI17_REG(base), DMA_DCHPRI17_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI17, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI17_ECP field. */
#define DMA_RD_DCHPRI17_ECP(base) ((DMA_DCHPRI17_REG(base) & DMA_DCHPRI17_ECP_MASK) >> DMA_DCHPRI17_ECP_SHIFT)
#define DMA_BRD_DCHPRI17_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI17_REG(base), DMA_DCHPRI17_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI17_ECP(base, value) (DMA_RMW_DCHPRI17(base, DMA_DCHPRI17_ECP_MASK, DMA_DCHPRI17_ECP(value)))
#define DMA_BWR_DCHPRI17_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI17_REG(base), DMA_DCHPRI17_ECP_SHIFT) = (value))
/*@}*/

