pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DMA_DCHPRI16 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI16 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI16 register
 */
/*@{*/
#define DMA_RD_DCHPRI16(base)    (DMA_DCHPRI16_REG(base))
#define DMA_WR_DCHPRI16(base, value) (DMA_DCHPRI16_REG(base) = (value))
#define DMA_RMW_DCHPRI16(base, mask, value) (DMA_WR_DCHPRI16(base, (DMA_RD_DCHPRI16(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI16(base, value) (DMA_WR_DCHPRI16(base, DMA_RD_DCHPRI16(base) |  (value)))
#define DMA_CLR_DCHPRI16(base, value) (DMA_WR_DCHPRI16(base, DMA_RD_DCHPRI16(base) & ~(value)))
#define DMA_TOG_DCHPRI16(base, value) (DMA_WR_DCHPRI16(base, DMA_RD_DCHPRI16(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI16 bitfields
 */

/*!
 * @name Register DMA_DCHPRI16, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI16_CHPRI field. */
#define DMA_RD_DCHPRI16_CHPRI(base) ((DMA_DCHPRI16_REG(base) & DMA_DCHPRI16_CHPRI_MASK) >> DMA_DCHPRI16_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI16_CHPRI(base) (DMA_RD_DCHPRI16_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI16_CHPRI(base, value) (DMA_RMW_DCHPRI16(base, DMA_DCHPRI16_CHPRI_MASK, DMA_DCHPRI16_CHPRI(value)))
#define DMA_BWR_DCHPRI16_CHPRI(base, value) (DMA_WR_DCHPRI16_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI16, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI16_GRPPRI field. */
#define DMA_RD_DCHPRI16_GRPPRI(base) ((DMA_DCHPRI16_REG(base) & DMA_DCHPRI16_GRPPRI_MASK) >> DMA_DCHPRI16_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI16_GRPPRI(base) (DMA_RD_DCHPRI16_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI16, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI16_DPA field. */
#define DMA_RD_DCHPRI16_DPA(base) ((DMA_DCHPRI16_REG(base) & DMA_DCHPRI16_DPA_MASK) >> DMA_DCHPRI16_DPA_SHIFT)
#define DMA_BRD_DCHPRI16_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI16_REG(base), DMA_DCHPRI16_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI16_DPA(base, value) (DMA_RMW_DCHPRI16(base, DMA_DCHPRI16_DPA_MASK, DMA_DCHPRI16_DPA(value)))
#define DMA_BWR_DCHPRI16_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI16_REG(base), DMA_DCHPRI16_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI16, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI16_ECP field. */
#define DMA_RD_DCHPRI16_ECP(base) ((DMA_DCHPRI16_REG(base) & DMA_DCHPRI16_ECP_MASK) >> DMA_DCHPRI16_ECP_SHIFT)
#define DMA_BRD_DCHPRI16_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI16_REG(base), DMA_DCHPRI16_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI16_ECP(base, value) (DMA_RMW_DCHPRI16(base, DMA_DCHPRI16_ECP_MASK, DMA_DCHPRI16_ECP(value)))
#define DMA_BWR_DCHPRI16_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI16_REG(base), DMA_DCHPRI16_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI23 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI23 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI23 register
 */
/*@{*/
#define DMA_RD_DCHPRI23(base)    (DMA_DCHPRI23_REG(base))
#define DMA_WR_DCHPRI23(base, value) (DMA_DCHPRI23_REG(base) = (value))
#define DMA_RMW_DCHPRI23(base, mask, value) (DMA_WR_DCHPRI23(base, (DMA_RD_DCHPRI23(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI23(base, value) (DMA_WR_DCHPRI23(base, DMA_RD_DCHPRI23(base) |  (value)))
#define DMA_CLR_DCHPRI23(base, value) (DMA_WR_DCHPRI23(base, DMA_RD_DCHPRI23(base) & ~(value)))
#define DMA_TOG_DCHPRI23(base, value) (DMA_WR_DCHPRI23(base, DMA_RD_DCHPRI23(base) ^  (value)))
/*@}*/

