pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI23 bitfields
 */

/*!
 * @name Register DMA_DCHPRI23, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI23_CHPRI field. */
#define DMA_RD_DCHPRI23_CHPRI(base) ((DMA_DCHPRI23_REG(base) & DMA_DCHPRI23_CHPRI_MASK) >> DMA_DCHPRI23_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI23_CHPRI(base) (DMA_RD_DCHPRI23_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI23_CHPRI(base, value) (DMA_RMW_DCHPRI23(base, DMA_DCHPRI23_CHPRI_MASK, DMA_DCHPRI23_CHPRI(value)))
#define DMA_BWR_DCHPRI23_CHPRI(base, value) (DMA_WR_DCHPRI23_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI23, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI23_GRPPRI field. */
#define DMA_RD_DCHPRI23_GRPPRI(base) ((DMA_DCHPRI23_REG(base) & DMA_DCHPRI23_GRPPRI_MASK) >> DMA_DCHPRI23_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI23_GRPPRI(base) (DMA_RD_DCHPRI23_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI23, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI23_DPA field. */
#define DMA_RD_DCHPRI23_DPA(base) ((DMA_DCHPRI23_REG(base) & DMA_DCHPRI23_DPA_MASK) >> DMA_DCHPRI23_DPA_SHIFT)
#define DMA_BRD_DCHPRI23_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI23_REG(base), DMA_DCHPRI23_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI23_DPA(base, value) (DMA_RMW_DCHPRI23(base, DMA_DCHPRI23_DPA_MASK, DMA_DCHPRI23_DPA(value)))
#define DMA_BWR_DCHPRI23_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI23_REG(base), DMA_DCHPRI23_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI23, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI23_ECP field. */
#define DMA_RD_DCHPRI23_ECP(base) ((DMA_DCHPRI23_REG(base) & DMA_DCHPRI23_ECP_MASK) >> DMA_DCHPRI23_ECP_SHIFT)
#define DMA_BRD_DCHPRI23_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI23_REG(base), DMA_DCHPRI23_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI23_ECP(base, value) (DMA_RMW_DCHPRI23(base, DMA_DCHPRI23_ECP_MASK, DMA_DCHPRI23_ECP(value)))
#define DMA_BWR_DCHPRI23_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI23_REG(base), DMA_DCHPRI23_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI22 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI22 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI22 register
 */
/*@{*/
#define DMA_RD_DCHPRI22(base)    (DMA_DCHPRI22_REG(base))
#define DMA_WR_DCHPRI22(base, value) (DMA_DCHPRI22_REG(base) = (value))
#define DMA_RMW_DCHPRI22(base, mask, value) (DMA_WR_DCHPRI22(base, (DMA_RD_DCHPRI22(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI22(base, value) (DMA_WR_DCHPRI22(base, DMA_RD_DCHPRI22(base) |  (value)))
#define DMA_CLR_DCHPRI22(base, value) (DMA_WR_DCHPRI22(base, DMA_RD_DCHPRI22(base) & ~(value)))
#define DMA_TOG_DCHPRI22(base, value) (DMA_WR_DCHPRI22(base, DMA_RD_DCHPRI22(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI22 bitfields
 */

/*!
 * @name Register DMA_DCHPRI22, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI22_CHPRI field. */
#define DMA_RD_DCHPRI22_CHPRI(base) ((DMA_DCHPRI22_REG(base) & DMA_DCHPRI22_CHPRI_MASK) >> DMA_DCHPRI22_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI22_CHPRI(base) (DMA_RD_DCHPRI22_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI22_CHPRI(base, value) (DMA_RMW_DCHPRI22(base, DMA_DCHPRI22_CHPRI_MASK, DMA_DCHPRI22_CHPRI(value)))
#define DMA_BWR_DCHPRI22_CHPRI(base, value) (DMA_WR_DCHPRI22_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI22, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI22_GRPPRI field. */
#define DMA_RD_DCHPRI22_GRPPRI(base) ((DMA_DCHPRI22_REG(base) & DMA_DCHPRI22_GRPPRI_MASK) >> DMA_DCHPRI22_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI22_GRPPRI(base) (DMA_RD_DCHPRI22_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI22, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI22_DPA field. */
#define DMA_RD_DCHPRI22_DPA(base) ((DMA_DCHPRI22_REG(base) & DMA_DCHPRI22_DPA_MASK) >> DMA_DCHPRI22_DPA_SHIFT)
#define DMA_BRD_DCHPRI22_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI22_REG(base), DMA_DCHPRI22_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI22_DPA(base, value) (DMA_RMW_DCHPRI22(base, DMA_DCHPRI22_DPA_MASK, DMA_DCHPRI22_DPA(value)))
#define DMA_BWR_DCHPRI22_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI22_REG(base), DMA_DCHPRI22_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI22, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI22_ECP field. */
#define DMA_RD_DCHPRI22_ECP(base) ((DMA_DCHPRI22_REG(base) & DMA_DCHPRI22_ECP_MASK) >> DMA_DCHPRI22_ECP_SHIFT)
#define DMA_BRD_DCHPRI22_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI22_REG(base), DMA_DCHPRI22_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI22_ECP(base, value) (DMA_RMW_DCHPRI22(base, DMA_DCHPRI22_ECP_MASK, DMA_DCHPRI22_ECP(value)))
#define DMA_BWR_DCHPRI22_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI22_REG(base), DMA_DCHPRI22_ECP_SHIFT) = (value))
/*@}*/

