pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI20 bitfields
 */

/*!
 * @name Register DMA_DCHPRI20, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_CHPRI field. */
#define DMA_RD_DCHPRI20_CHPRI(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_CHPRI_MASK) >> DMA_DCHPRI20_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI20_CHPRI(base) (DMA_RD_DCHPRI20_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI20_CHPRI(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_CHPRI_MASK, DMA_DCHPRI20_CHPRI(value)))
#define DMA_BWR_DCHPRI20_CHPRI(base, value) (DMA_WR_DCHPRI20_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_GRPPRI field. */
#define DMA_RD_DCHPRI20_GRPPRI(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_GRPPRI_MASK) >> DMA_DCHPRI20_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI20_GRPPRI(base) (DMA_RD_DCHPRI20_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_DPA field. */
#define DMA_RD_DCHPRI20_DPA(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_DPA_MASK) >> DMA_DCHPRI20_DPA_SHIFT)
#define DMA_BRD_DCHPRI20_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI20_DPA(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_DPA_MASK, DMA_DCHPRI20_DPA(value)))
#define DMA_BWR_DCHPRI20_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI20, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI20_ECP field. */
#define DMA_RD_DCHPRI20_ECP(base) ((DMA_DCHPRI20_REG(base) & DMA_DCHPRI20_ECP_MASK) >> DMA_DCHPRI20_ECP_SHIFT)
#define DMA_BRD_DCHPRI20_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI20_ECP(base, value) (DMA_RMW_DCHPRI20(base, DMA_DCHPRI20_ECP_MASK, DMA_DCHPRI20_ECP(value)))
#define DMA_BWR_DCHPRI20_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI20_REG(base), DMA_DCHPRI20_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI27 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI27 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI27 register
 */
/*@{*/
#define DMA_RD_DCHPRI27(base)    (DMA_DCHPRI27_REG(base))
#define DMA_WR_DCHPRI27(base, value) (DMA_DCHPRI27_REG(base) = (value))
#define DMA_RMW_DCHPRI27(base, mask, value) (DMA_WR_DCHPRI27(base, (DMA_RD_DCHPRI27(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI27(base, value) (DMA_WR_DCHPRI27(base, DMA_RD_DCHPRI27(base) |  (value)))
#define DMA_CLR_DCHPRI27(base, value) (DMA_WR_DCHPRI27(base, DMA_RD_DCHPRI27(base) & ~(value)))
#define DMA_TOG_DCHPRI27(base, value) (DMA_WR_DCHPRI27(base, DMA_RD_DCHPRI27(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI27 bitfields
 */

/*!
 * @name Register DMA_DCHPRI27, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_CHPRI field. */
#define DMA_RD_DCHPRI27_CHPRI(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_CHPRI_MASK) >> DMA_DCHPRI27_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI27_CHPRI(base) (DMA_RD_DCHPRI27_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI27_CHPRI(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_CHPRI_MASK, DMA_DCHPRI27_CHPRI(value)))
#define DMA_BWR_DCHPRI27_CHPRI(base, value) (DMA_WR_DCHPRI27_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_GRPPRI field. */
#define DMA_RD_DCHPRI27_GRPPRI(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_GRPPRI_MASK) >> DMA_DCHPRI27_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI27_GRPPRI(base) (DMA_RD_DCHPRI27_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_DPA field. */
#define DMA_RD_DCHPRI27_DPA(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_DPA_MASK) >> DMA_DCHPRI27_DPA_SHIFT)
#define DMA_BRD_DCHPRI27_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI27_DPA(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_DPA_MASK, DMA_DCHPRI27_DPA(value)))
#define DMA_BWR_DCHPRI27_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI27, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI27_ECP field. */
#define DMA_RD_DCHPRI27_ECP(base) ((DMA_DCHPRI27_REG(base) & DMA_DCHPRI27_ECP_MASK) >> DMA_DCHPRI27_ECP_SHIFT)
#define DMA_BRD_DCHPRI27_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI27_ECP(base, value) (DMA_RMW_DCHPRI27(base, DMA_DCHPRI27_ECP_MASK, DMA_DCHPRI27_ECP(value)))
#define DMA_BWR_DCHPRI27_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI27_REG(base), DMA_DCHPRI27_ECP_SHIFT) = (value))
/*@}*/

