pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual DMA_DCHPRI30 bitfields
 */

/*!
 * @name Register DMA_DCHPRI30, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI30_CHPRI field. */
#define DMA_RD_DCHPRI30_CHPRI(base) ((DMA_DCHPRI30_REG(base) & DMA_DCHPRI30_CHPRI_MASK) >> DMA_DCHPRI30_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI30_CHPRI(base) (DMA_RD_DCHPRI30_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI30_CHPRI(base, value) (DMA_RMW_DCHPRI30(base, DMA_DCHPRI30_CHPRI_MASK, DMA_DCHPRI30_CHPRI(value)))
#define DMA_BWR_DCHPRI30_CHPRI(base, value) (DMA_WR_DCHPRI30_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI30, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI30_GRPPRI field. */
#define DMA_RD_DCHPRI30_GRPPRI(base) ((DMA_DCHPRI30_REG(base) & DMA_DCHPRI30_GRPPRI_MASK) >> DMA_DCHPRI30_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI30_GRPPRI(base) (DMA_RD_DCHPRI30_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI30, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI30_DPA field. */
#define DMA_RD_DCHPRI30_DPA(base) ((DMA_DCHPRI30_REG(base) & DMA_DCHPRI30_DPA_MASK) >> DMA_DCHPRI30_DPA_SHIFT)
#define DMA_BRD_DCHPRI30_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI30_REG(base), DMA_DCHPRI30_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI30_DPA(base, value) (DMA_RMW_DCHPRI30(base, DMA_DCHPRI30_DPA_MASK, DMA_DCHPRI30_DPA(value)))
#define DMA_BWR_DCHPRI30_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI30_REG(base), DMA_DCHPRI30_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI30, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI30_ECP field. */
#define DMA_RD_DCHPRI30_ECP(base) ((DMA_DCHPRI30_REG(base) & DMA_DCHPRI30_ECP_MASK) >> DMA_DCHPRI30_ECP_SHIFT)
#define DMA_BRD_DCHPRI30_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI30_REG(base), DMA_DCHPRI30_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI30_ECP(base, value) (DMA_RMW_DCHPRI30(base, DMA_DCHPRI30_ECP_MASK, DMA_DCHPRI30_ECP(value)))
#define DMA_BWR_DCHPRI30_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI30_REG(base), DMA_DCHPRI30_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_DCHPRI29 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI29 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI29 register
 */
/*@{*/
#define DMA_RD_DCHPRI29(base)    (DMA_DCHPRI29_REG(base))
#define DMA_WR_DCHPRI29(base, value) (DMA_DCHPRI29_REG(base) = (value))
#define DMA_RMW_DCHPRI29(base, mask, value) (DMA_WR_DCHPRI29(base, (DMA_RD_DCHPRI29(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI29(base, value) (DMA_WR_DCHPRI29(base, DMA_RD_DCHPRI29(base) |  (value)))
#define DMA_CLR_DCHPRI29(base, value) (DMA_WR_DCHPRI29(base, DMA_RD_DCHPRI29(base) & ~(value)))
#define DMA_TOG_DCHPRI29(base, value) (DMA_WR_DCHPRI29(base, DMA_RD_DCHPRI29(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI29 bitfields
 */

/*!
 * @name Register DMA_DCHPRI29, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI29_CHPRI field. */
#define DMA_RD_DCHPRI29_CHPRI(base) ((DMA_DCHPRI29_REG(base) & DMA_DCHPRI29_CHPRI_MASK) >> DMA_DCHPRI29_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI29_CHPRI(base) (DMA_RD_DCHPRI29_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI29_CHPRI(base, value) (DMA_RMW_DCHPRI29(base, DMA_DCHPRI29_CHPRI_MASK, DMA_DCHPRI29_CHPRI(value)))
#define DMA_BWR_DCHPRI29_CHPRI(base, value) (DMA_WR_DCHPRI29_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI29, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI29_GRPPRI field. */
#define DMA_RD_DCHPRI29_GRPPRI(base) ((DMA_DCHPRI29_REG(base) & DMA_DCHPRI29_GRPPRI_MASK) >> DMA_DCHPRI29_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI29_GRPPRI(base) (DMA_RD_DCHPRI29_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI29, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI29_DPA field. */
#define DMA_RD_DCHPRI29_DPA(base) ((DMA_DCHPRI29_REG(base) & DMA_DCHPRI29_DPA_MASK) >> DMA_DCHPRI29_DPA_SHIFT)
#define DMA_BRD_DCHPRI29_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI29_REG(base), DMA_DCHPRI29_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI29_DPA(base, value) (DMA_RMW_DCHPRI29(base, DMA_DCHPRI29_DPA_MASK, DMA_DCHPRI29_DPA(value)))
#define DMA_BWR_DCHPRI29_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI29_REG(base), DMA_DCHPRI29_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI29, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI29_ECP field. */
#define DMA_RD_DCHPRI29_ECP(base) ((DMA_DCHPRI29_REG(base) & DMA_DCHPRI29_ECP_MASK) >> DMA_DCHPRI29_ECP_SHIFT)
#define DMA_BRD_DCHPRI29_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI29_REG(base), DMA_DCHPRI29_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI29_ECP(base, value) (DMA_RMW_DCHPRI29(base, DMA_DCHPRI29_ECP_MASK, DMA_DCHPRI29_ECP(value)))
#define DMA_BWR_DCHPRI29_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI29_REG(base), DMA_DCHPRI29_ECP_SHIFT) = (value))
/*@}*/

