pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * DMA_DCHPRI28 - Channel n Priority Register
 ******************************************************************************/

/*!
 * @brief DMA_DCHPRI28 - Channel n Priority Register (RW)
 *
 * Reset value: 0x00U
 *
 * When fixed-priority channel arbitration is enabled (CR[ERCA] = 0), the
 * contents of these registers define the unique priorities associated with each
 * channel within a group. The channel priorities are evaluated by numeric value; for
 * example, 0 is the lowest priority, 1 is the next higher priority, then 2, 3,
 * etc. Software must program the channel priorities with unique values. Otherwise,
 * a configuration error is reported. The range of the priority value is limited
 * to the values of 0 through 15. When read, the GRPPRI bits of the DCHPRIn
 * register reflect the current priority level of the group of channels in which the
 * corresponding channel resides. GRPPRI bits are not affected by writes to the
 * DCHPRIn registers. The group priority is assigned in the DMA control register.
 */
/*!
 * @name Constants and macros for entire DMA_DCHPRI28 register
 */
/*@{*/
#define DMA_RD_DCHPRI28(base)    (DMA_DCHPRI28_REG(base))
#define DMA_WR_DCHPRI28(base, value) (DMA_DCHPRI28_REG(base) = (value))
#define DMA_RMW_DCHPRI28(base, mask, value) (DMA_WR_DCHPRI28(base, (DMA_RD_DCHPRI28(base) & ~(mask)) | (value)))
#define DMA_SET_DCHPRI28(base, value) (DMA_WR_DCHPRI28(base, DMA_RD_DCHPRI28(base) |  (value)))
#define DMA_CLR_DCHPRI28(base, value) (DMA_WR_DCHPRI28(base, DMA_RD_DCHPRI28(base) & ~(value)))
#define DMA_TOG_DCHPRI28(base, value) (DMA_WR_DCHPRI28(base, DMA_RD_DCHPRI28(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual DMA_DCHPRI28 bitfields
 */

/*!
 * @name Register DMA_DCHPRI28, field CHPRI[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_CHPRI field. */
#define DMA_RD_DCHPRI28_CHPRI(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_CHPRI_MASK) >> DMA_DCHPRI28_CHPRI_SHIFT)
#define DMA_BRD_DCHPRI28_CHPRI(base) (DMA_RD_DCHPRI28_CHPRI(base))

/*! @brief Set the CHPRI field to a new value. */
#define DMA_WR_DCHPRI28_CHPRI(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_CHPRI_MASK, DMA_DCHPRI28_CHPRI(value)))
#define DMA_BWR_DCHPRI28_CHPRI(base, value) (DMA_WR_DCHPRI28_CHPRI(base, value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field GRPPRI[5:4] (RO)
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_GRPPRI field. */
#define DMA_RD_DCHPRI28_GRPPRI(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_GRPPRI_MASK) >> DMA_DCHPRI28_GRPPRI_SHIFT)
#define DMA_BRD_DCHPRI28_GRPPRI(base) (DMA_RD_DCHPRI28_GRPPRI(base))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field DPA[6] (RW)
 *
 * Values:
 * - 0 - Channel n can suspend a lower priority channel
 * - 1 - Channel n cannot suspend any channel, regardless of channel priority
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_DPA field. */
#define DMA_RD_DCHPRI28_DPA(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_DPA_MASK) >> DMA_DCHPRI28_DPA_SHIFT)
#define DMA_BRD_DCHPRI28_DPA(base) (BITBAND_ACCESS8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_DPA_SHIFT))

/*! @brief Set the DPA field to a new value. */
#define DMA_WR_DCHPRI28_DPA(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_DPA_MASK, DMA_DCHPRI28_DPA(value)))
#define DMA_BWR_DCHPRI28_DPA(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_DPA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMA_DCHPRI28, field ECP[7] (RW)
 *
 * Values:
 * - 0 - Channel n cannot be suspended by a higher priority channel's service
 *     request
 * - 1 - Channel n can be temporarily suspended by the service request of a
 *     higher priority channel
 */
/*@{*/
/*! @brief Read current value of the DMA_DCHPRI28_ECP field. */
#define DMA_RD_DCHPRI28_ECP(base) ((DMA_DCHPRI28_REG(base) & DMA_DCHPRI28_ECP_MASK) >> DMA_DCHPRI28_ECP_SHIFT)
#define DMA_BRD_DCHPRI28_ECP(base) (BITBAND_ACCESS8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_ECP_SHIFT))

/*! @brief Set the ECP field to a new value. */
#define DMA_WR_DCHPRI28_ECP(base, value) (DMA_RMW_DCHPRI28(base, DMA_DCHPRI28_ECP_MASK, DMA_DCHPRI28_ECP(value)))
#define DMA_BWR_DCHPRI28_ECP(base, value) (BITBAND_ACCESS8(&DMA_DCHPRI28_REG(base), DMA_DCHPRI28_ECP_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * DMA_SADDR - TCD Source Address
 ******************************************************************************/

/*!
 * @brief DMA_SADDR - TCD Source Address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire DMA_SADDR register
 */
/*@{*/
#define DMA_RD_SADDR(base, index) (DMA_SADDR_REG(base, index))
#define DMA_WR_SADDR(base, index, value) (DMA_SADDR_REG(base, index) = (value))
#define DMA_RMW_SADDR(base, index, mask, value) (DMA_WR_SADDR(base, index, (DMA_RD_SADDR(base, index) & ~(mask)) | (value)))
#define DMA_SET_SADDR(base, index, value) (DMA_WR_SADDR(base, index, DMA_RD_SADDR(base, index) |  (value)))
#define DMA_CLR_SADDR(base, index, value) (DMA_WR_SADDR(base, index, DMA_RD_SADDR(base, index) & ~(value)))
#define DMA_TOG_SADDR(base, index, value) (DMA_WR_SADDR(base, index, DMA_RD_SADDR(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * DMA_SOFF - TCD Signed Source Address Offset
 ******************************************************************************/

/*!
 * @brief DMA_SOFF - TCD Signed Source Address Offset (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire DMA_SOFF register
 */
/*@{*/
#define DMA_RD_SOFF(base, index) (DMA_SOFF_REG(base, index))
#define DMA_WR_SOFF(base, index, value) (DMA_SOFF_REG(base, index) = (value))
#define DMA_RMW_SOFF(base, index, mask, value) (DMA_WR_SOFF(base, index, (DMA_RD_SOFF(base, index) & ~(mask)) | (value)))
#define DMA_SET_SOFF(base, index, value) (DMA_WR_SOFF(base, index, DMA_RD_SOFF(base, index) |  (value)))
#define DMA_CLR_SOFF(base, index, value) (DMA_WR_SOFF(base, index, DMA_RD_SOFF(base, index) & ~(value)))
#define DMA_TOG_SOFF(base, index, value) (DMA_WR_SOFF(base, index, DMA_RD_SOFF(base, index) ^  (value)))
/*@}*/

