pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TRIG field to a new value. */
#define DMAMUX_WR_CHCFG_TRIG(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_TRIG_MASK, DMAMUX_CHCFG_TRIG(value)))
#define DMAMUX_BWR_CHCFG_TRIG(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_TRIG_SHIFT) = (value))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFG, field ENBL[7] (RW)
 *
 * Values:
 * - 0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMA Mux. The DMA has separate channel enables/disables, which
 *     should be used to disable or re-configure a DMA channel.
 * - 1 - DMA channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFG_ENBL field. */
#define DMAMUX_RD_CHCFG_ENBL(base, index) ((DMAMUX_CHCFG_REG(base, index) & DMAMUX_CHCFG_ENBL_MASK) >> DMAMUX_CHCFG_ENBL_SHIFT)
#define DMAMUX_BRD_CHCFG_ENBL(base, index) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT))

/*! @brief Set the ENBL field to a new value. */
#define DMAMUX_WR_CHCFG_ENBL(base, index, value) (DMAMUX_RMW_CHCFG(base, index, DMAMUX_CHCFG_ENBL_MASK, DMAMUX_CHCFG_ENBL(value)))
#define DMAMUX_BWR_CHCFG_ENBL(base, index, value) (BITBAND_ACCESS8(&DMAMUX_CHCFG_REG(base, index), DMAMUX_CHCFG_ENBL_SHIFT) = (value))
/*@}*/

/*
 * MK70F12 ENET
 *
 * Ethernet MAC-NET Core
 *
 * Registers defined in this header file:
 * - ENET_EIR - Interrupt Event Register
 * - ENET_EIMR - Interrupt Mask Register
 * - ENET_RDAR - Receive Descriptor Active Register
 * - ENET_TDAR - Transmit Descriptor Active Register
 * - ENET_ECR - Ethernet Control Register
 * - ENET_MMFR - MII Management Frame Register
 * - ENET_MSCR - MII Speed Control Register
 * - ENET_MIBC - MIB Control Register
 * - ENET_RCR - Receive Control Register
 * - ENET_TCR - Transmit Control Register
 * - ENET_PALR - Physical Address Lower Register
 * - ENET_PAUR - Physical Address Upper Register
 * - ENET_OPD - Opcode/Pause Duration Register
 * - ENET_IAUR - Descriptor Individual Upper Address Register
 * - ENET_IALR - Descriptor Individual Lower Address Register
 * - ENET_GAUR - Descriptor Group Upper Address Register
 * - ENET_GALR - Descriptor Group Lower Address Register
 * - ENET_TFWR - Transmit FIFO Watermark Register
 * - ENET_RDSR - Receive Descriptor Ring Start Register
 * - ENET_TDSR - Transmit Buffer Descriptor Ring Start Register
 * - ENET_MRBR - Maximum Receive Buffer Size Register
 * - ENET_RSFL - Receive FIFO Section Full Threshold
 * - ENET_RSEM - Receive FIFO Section Empty Threshold
 * - ENET_RAEM - Receive FIFO Almost Empty Threshold
 * - ENET_RAFL - Receive FIFO Almost Full Threshold
 * - ENET_TSEM - Transmit FIFO Section Empty Threshold
 * - ENET_TAEM - Transmit FIFO Almost Empty Threshold
 * - ENET_TAFL - Transmit FIFO Almost Full Threshold
 * - ENET_TIPG - Transmit Inter-Packet Gap
 * - ENET_FTRL - Frame Truncation Length
 * - ENET_TACC - Transmit Accelerator Function Configuration
 * - ENET_RACC - Receive Accelerator Function Configuration
 * - ENET_RMON_T_DROP - Count of frames not counted correctly (RMON_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable.
 * - ENET_RMON_T_PACKETS - RMON Tx packet count (RMON_T_PACKETS)
 * - ENET_RMON_T_BC_PKT - RMON Tx Broadcast Packets (RMON_T_BC_PKT)
 * - ENET_RMON_T_MC_PKT - RMON Tx Multicast Packets (RMON_T_MC_PKT)
 * - ENET_RMON_T_CRC_ALIGN - RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN)
 * - ENET_RMON_T_UNDERSIZE - RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE)
 * - ENET_RMON_T_OVERSIZE - RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE)
 * - ENET_RMON_T_FRAG - RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG)
 * - ENET_RMON_T_JAB - RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB)
 * - ENET_RMON_T_COL - RMON Tx collision count (RMON_T_COL)
 * - ENET_RMON_T_P64 - RMON Tx 64 byte packets (RMON_T_P64)
 * - ENET_RMON_T_P65TO127 - RMON Tx 65 to 127 byte packets (RMON_T_P65TO127)
 * - ENET_RMON_T_P128TO255 - RMON Tx 128 to 255 byte packets (RMON_T_P128TO255)
 * - ENET_RMON_T_P256TO511 - RMON Tx 256 to 511 byte packets (RMON_T_P256TO511)
 * - ENET_RMON_T_P512TO1023 - RMON Tx 512 to 1023 byte packets (RMON_T_P512TO1023)
 * - ENET_RMON_T_P1024TO2047 - RMON Tx 1024 to 2047 byte packets (RMON_T_P1024TO2047)
 * - ENET_RMON_T_P_GTE2048 - RMON Tx packets w > 2048 bytes (RMON_T_P_GTE2048)
 * - ENET_RMON_T_OCTETS - RMON Tx Octets (RMON_T_OCTETS)
 * - ENET_IEEE_T_DROP - Count of frames not counted correctly (IEEE_T_DROP). NOTE: Counter not implemented (read 0 always) as not applicable.
 * - ENET_IEEE_T_FRAME_OK - Frames Transmitted OK (IEEE_T_FRAME_OK)
 * - ENET_IEEE_T_1COL - Frames Transmitted with Single Collision (IEEE_T_1COL)
 * - ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions (IEEE_T_MCOL)
 * - ENET_IEEE_T_DEF - Frames Transmitted after Deferral Delay (IEEE_T_DEF)
 * - ENET_IEEE_T_LCOL - Frames Transmitted with Late Collision (IEEE_T_LCOL)
 * - ENET_IEEE_T_EXCOL - Frames Transmitted with Excessive Collisions (IEEE_T_EXCOL)
 * - ENET_IEEE_T_MACERR - Frames Transmitted with Tx FIFO Underrun (IEEE_T_MACERR)
 * - ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR)
 * - ENET_IEEE_T_SQE - Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available.
 * - ENET_IEEE_T_FDXFC - Flow Control Pause frames transmitted (IEEE_T_FDXFC)
 * - ENET_IEEE_T_OCTETS_OK - Octet count for Frames Transmitted w/o Error (IEEE_T_OCTETS_OK). NOTE: Counts total octets (includes header and FCS fields).
 * - ENET_RMON_R_PACKETS - RMON Rx packet count (RMON_R_PACKETS)
 * - ENET_RMON_R_BC_PKT - RMON Rx Broadcast Packets (RMON_R_BC_PKT)
 * - ENET_RMON_R_MC_PKT - RMON Rx Multicast Packets (RMON_R_MC_PKT)
 * - ENET_RMON_R_CRC_ALIGN - RMON Rx Packets w CRC/Align error (RMON_R_CRC_ALIGN)
 * - ENET_RMON_R_UNDERSIZE - RMON Rx Packets < 64 bytes, good CRC (RMON_R_UNDERSIZE)
 * - ENET_RMON_R_OVERSIZE - RMON Rx Packets > MAX_FL bytes, good CRC (RMON_R_OVERSIZE)
 * - ENET_RMON_R_FRAG - RMON Rx Packets < 64 bytes, bad CRC (RMON_R_FRAG)
 * - ENET_RMON_R_JAB - RMON Rx Packets > MAX_FL bytes, bad CRC (RMON_R_JAB)
 * - ENET_RMON_R_RESVD_0 - Reserved (RMON_R_RESVD_0)
 * - ENET_RMON_R_P64 - RMON Rx 64 byte packets (RMON_R_P64)
 * - ENET_RMON_R_P65TO127 - RMON Rx 65 to 127 byte packets (RMON_R_P65TO127)
 * - ENET_RMON_R_P128TO255 - RMON Rx 128 to 255 byte packets (RMON_R_P128TO255)
 * - ENET_RMON_R_P256TO511 - RMON Rx 256 to 511 byte packets (RMON_R_P256TO511)
 * - ENET_RMON_R_P512TO1023 - RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023)
 * - ENET_RMON_R_P1024TO2047 - RMON Rx 1024 to 2047 byte packets (RMON_R_P1024TO2047)
 * - ENET_RMON_R_P_GTE2048 - RMON Rx packets w > 2048 bytes (RMON_R_P_GTE2048)
 * - ENET_RMON_R_OCTETS - RMON Rx Octets (RMON_R_OCTETS)
 * - ENET_IEEE_R_DROP - Count of frames not counted correctly (IEEE_R_DROP). NOTE: Counter increments if a frame with valid/missing SFD character is detected and has been dropped. None of the other counters increments if this counter increments.
 * - ENET_IEEE_R_FRAME_OK - Frames Received OK (IEEE_R_FRAME_OK)
 * - ENET_IEEE_R_CRC - Frames Received with CRC Error (IEEE_R_CRC)
 * - ENET_IEEE_R_ALIGN - Frames Received with Alignment Error (IEEE_R_ALIGN)
 * - ENET_IEEE_R_MACERR - Receive Fifo Overflow count (IEEE_R_MACERR)
 * - ENET_IEEE_R_FDXFC - Flow Control Pause frames received (IEEE_R_FDXFC)
 * - ENET_IEEE_R_OCTETS_OK - Octet count for Frames Rcvd w/o Error (IEEE_R_OCTETS_OK). Counts total octets (includes header and FCS fields).
 * - ENET_ATCR - Timer Control Register
 * - ENET_ATVR - Timer Value Register
 * - ENET_ATOFF - Timer Offset Register
 * - ENET_ATPER - Timer Period Register
 * - ENET_ATCOR - Timer Correction Register
 * - ENET_ATINC - Time-Stamping Clock Period Register
 * - ENET_ATSTMP - Timestamp of Last Transmitted Frame
 * - ENET_TGSR - Timer Global Status Register
 * - ENET_TCSR - Timer Control Status Register
 * - ENET_TCCR - Timer Compare Capture Register
 */

#define ENET_INSTANCE_COUNT (1U) /*!< Number of instances of the ENET module. */
#define ENET_IDX (0U) /*!< Instance number for ENET. */

