pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * ENET_EIMR - Interrupt Mask Register
 ******************************************************************************/

/*!
 * @brief ENET_EIMR - Interrupt Mask Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * EIMR controls which interrupt events are allowed to generate actual
 * interrupts. A hardware reset clears this register. If the corresponding bits in the EIR
 * and EIMR registers are set, an interrupt is generated. The interrupt signal
 * remains asserted until a 1 is written to the EIR bit (write 1 to clear) or a 0
 * is written to the EIMR bit.
 */
/*!
 * @name Constants and macros for entire ENET_EIMR register
 */
/*@{*/
#define ENET_RD_EIMR(base)       (ENET_EIMR_REG(base))
#define ENET_WR_EIMR(base, value) (ENET_EIMR_REG(base) = (value))
#define ENET_RMW_EIMR(base, mask, value) (ENET_WR_EIMR(base, (ENET_RD_EIMR(base) & ~(mask)) | (value)))
#define ENET_SET_EIMR(base, value) (ENET_WR_EIMR(base, ENET_RD_EIMR(base) |  (value)))
#define ENET_CLR_EIMR(base, value) (ENET_WR_EIMR(base, ENET_RD_EIMR(base) & ~(value)))
#define ENET_TOG_EIMR(base, value) (ENET_WR_EIMR(base, ENET_RD_EIMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_EIMR bitfields
 */

/*!
 * @name Register ENET_EIMR, field TS_TIMER[15] (RW)
 *
 * Corresponds to interrupt source TS_TIMER defined by the EIR register and
 * determines whether an interrupt condition can generate an interrupt. At every
 * module clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR TS_TIMER bit reflects the state of the interrupt signal
 * even if the corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TS_TIMER field. */
#define ENET_RD_EIMR_TS_TIMER(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TS_TIMER_MASK) >> ENET_EIMR_TS_TIMER_SHIFT)
#define ENET_BRD_EIMR_TS_TIMER(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TS_TIMER_SHIFT))

/*! @brief Set the TS_TIMER field to a new value. */
#define ENET_WR_EIMR_TS_TIMER(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TS_TIMER_MASK, ENET_EIMR_TS_TIMER(value)))
#define ENET_BWR_EIMR_TS_TIMER(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TS_TIMER_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field TS_AVAIL[16] (RW)
 *
 * Corresponds to interrupt source TS_AVAIL defined by the EIR register and
 * determines whether an interrupt condition can generate an interrupt. At every
 * module clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR TS_AVAIL bit reflects the state of the interrupt signal
 * even if the corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_TS_AVAIL field. */
#define ENET_RD_EIMR_TS_AVAIL(base) ((ENET_EIMR_REG(base) & ENET_EIMR_TS_AVAIL_MASK) >> ENET_EIMR_TS_AVAIL_SHIFT)
#define ENET_BRD_EIMR_TS_AVAIL(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TS_AVAIL_SHIFT))

/*! @brief Set the TS_AVAIL field to a new value. */
#define ENET_WR_EIMR_TS_AVAIL(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_TS_AVAIL_MASK, ENET_EIMR_TS_AVAIL(value)))
#define ENET_BWR_EIMR_TS_AVAIL(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_TS_AVAIL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field WAKEUP[17] (RW)
 *
 * Corresponds to interrupt source WAKEUP defined by the EIR register and
 * determines whether an interrupt condition can generate an interrupt. At every module
 * clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR WAKEUP bit reflects the state of the interrupt signal even if
 * the corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_WAKEUP field. */
#define ENET_RD_EIMR_WAKEUP(base) ((ENET_EIMR_REG(base) & ENET_EIMR_WAKEUP_MASK) >> ENET_EIMR_WAKEUP_SHIFT)
#define ENET_BRD_EIMR_WAKEUP(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_WAKEUP_SHIFT))

/*! @brief Set the WAKEUP field to a new value. */
#define ENET_WR_EIMR_WAKEUP(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_WAKEUP_MASK, ENET_EIMR_WAKEUP(value)))
#define ENET_BWR_EIMR_WAKEUP(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_WAKEUP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field PLR[18] (RW)
 *
 * Corresponds to interrupt source PLR defined by the EIR register and
 * determines whether an interrupt condition can generate an interrupt. At every module
 * clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR PLR bit reflects the state of the interrupt signal even if the
 * corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_PLR field. */
#define ENET_RD_EIMR_PLR(base) ((ENET_EIMR_REG(base) & ENET_EIMR_PLR_MASK) >> ENET_EIMR_PLR_SHIFT)
#define ENET_BRD_EIMR_PLR(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_PLR_SHIFT))

/*! @brief Set the PLR field to a new value. */
#define ENET_WR_EIMR_PLR(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_PLR_MASK, ENET_EIMR_PLR(value)))
#define ENET_BWR_EIMR_PLR(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_PLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field UN[19] (RW)
 *
 * Corresponds to interrupt source UN defined by the EIR register and determines
 * whether an interrupt condition can generate an interrupt. At every module
 * clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR UN bit reflects the state of the interrupt signal even if the
 * corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_UN field. */
#define ENET_RD_EIMR_UN(base) ((ENET_EIMR_REG(base) & ENET_EIMR_UN_MASK) >> ENET_EIMR_UN_SHIFT)
#define ENET_BRD_EIMR_UN(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_UN_SHIFT))

/*! @brief Set the UN field to a new value. */
#define ENET_WR_EIMR_UN(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_UN_MASK, ENET_EIMR_UN(value)))
#define ENET_BWR_EIMR_UN(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_UN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field RL[20] (RW)
 *
 * Corresponds to interrupt source RL defined by the EIR register and determines
 * whether an interrupt condition can generate an interrupt. At every module
 * clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR RL bit reflects the state of the interrupt signal even if the
 * corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_RL field. */
#define ENET_RD_EIMR_RL(base) ((ENET_EIMR_REG(base) & ENET_EIMR_RL_MASK) >> ENET_EIMR_RL_SHIFT)
#define ENET_BRD_EIMR_RL(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RL_SHIFT))

/*! @brief Set the RL field to a new value. */
#define ENET_WR_EIMR_RL(base, value) (ENET_RMW_EIMR(base, ENET_EIMR_RL_MASK, ENET_EIMR_RL(value)))
#define ENET_BWR_EIMR_RL(base, value) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_RL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ENET_EIMR, field LC[21] (RW)
 *
 * Corresponds to interrupt source LC defined by the EIR register and determines
 * whether an interrupt condition can generate an interrupt. At every module
 * clock, the EIR samples the signal generated by the interrupting source. The
 * corresponding EIR LC bit reflects the state of the interrupt signal even if the
 * corresponding EIMR bit is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_EIMR_LC field. */
#define ENET_RD_EIMR_LC(base) ((ENET_EIMR_REG(base) & ENET_EIMR_LC_MASK) >> ENET_EIMR_LC_SHIFT)
#define ENET_BRD_EIMR_LC(base) (BITBAND_ACCESS32(&ENET_EIMR_REG(base), ENET_EIMR_LC_SHIFT))

