pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * ENET_RMON_T_UNDERSIZE - RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_UNDERSIZE - RMON Tx Packets < 64 bytes, good CRC (RMON_T_UNDERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_UNDERSIZE register
 */
/*@{*/
#define ENET_RD_RMON_T_UNDERSIZE(base) (ENET_RMON_T_UNDERSIZE_REG(base))
#define ENET_WR_RMON_T_UNDERSIZE(base, value) (ENET_RMON_T_UNDERSIZE_REG(base) = (value))
#define ENET_RMW_RMON_T_UNDERSIZE(base, mask, value) (ENET_WR_RMON_T_UNDERSIZE(base, (ENET_RD_RMON_T_UNDERSIZE(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_UNDERSIZE(base, value) (ENET_WR_RMON_T_UNDERSIZE(base, ENET_RD_RMON_T_UNDERSIZE(base) |  (value)))
#define ENET_CLR_RMON_T_UNDERSIZE(base, value) (ENET_WR_RMON_T_UNDERSIZE(base, ENET_RD_RMON_T_UNDERSIZE(base) & ~(value)))
#define ENET_TOG_RMON_T_UNDERSIZE(base, value) (ENET_WR_RMON_T_UNDERSIZE(base, ENET_RD_RMON_T_UNDERSIZE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_UNDERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_T_UNDERSIZE, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_UNDERSIZE_TXPKTS field. */
#define ENET_RD_RMON_T_UNDERSIZE_TXPKTS(base) ((ENET_RMON_T_UNDERSIZE_REG(base) & ENET_RMON_T_UNDERSIZE_TXPKTS_MASK) >> ENET_RMON_T_UNDERSIZE_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_UNDERSIZE_TXPKTS(base) (ENET_RD_RMON_T_UNDERSIZE_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_OVERSIZE - RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_OVERSIZE - RMON Tx Packets > MAX_FL bytes, good CRC (RMON_T_OVERSIZE) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_OVERSIZE register
 */
/*@{*/
#define ENET_RD_RMON_T_OVERSIZE(base) (ENET_RMON_T_OVERSIZE_REG(base))
#define ENET_WR_RMON_T_OVERSIZE(base, value) (ENET_RMON_T_OVERSIZE_REG(base) = (value))
#define ENET_RMW_RMON_T_OVERSIZE(base, mask, value) (ENET_WR_RMON_T_OVERSIZE(base, (ENET_RD_RMON_T_OVERSIZE(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_OVERSIZE(base, value) (ENET_WR_RMON_T_OVERSIZE(base, ENET_RD_RMON_T_OVERSIZE(base) |  (value)))
#define ENET_CLR_RMON_T_OVERSIZE(base, value) (ENET_WR_RMON_T_OVERSIZE(base, ENET_RD_RMON_T_OVERSIZE(base) & ~(value)))
#define ENET_TOG_RMON_T_OVERSIZE(base, value) (ENET_WR_RMON_T_OVERSIZE(base, ENET_RD_RMON_T_OVERSIZE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_OVERSIZE bitfields
 */

/*!
 * @name Register ENET_RMON_T_OVERSIZE, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_OVERSIZE_TXPKTS field. */
#define ENET_RD_RMON_T_OVERSIZE_TXPKTS(base) ((ENET_RMON_T_OVERSIZE_REG(base) & ENET_RMON_T_OVERSIZE_TXPKTS_MASK) >> ENET_RMON_T_OVERSIZE_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_OVERSIZE_TXPKTS(base) (ENET_RD_RMON_T_OVERSIZE_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_FRAG - RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_FRAG - RMON Tx Packets < 64 bytes, bad CRC (RMON_T_FRAG) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_FRAG register
 */
/*@{*/
#define ENET_RD_RMON_T_FRAG(base) (ENET_RMON_T_FRAG_REG(base))
#define ENET_WR_RMON_T_FRAG(base, value) (ENET_RMON_T_FRAG_REG(base) = (value))
#define ENET_RMW_RMON_T_FRAG(base, mask, value) (ENET_WR_RMON_T_FRAG(base, (ENET_RD_RMON_T_FRAG(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_FRAG(base, value) (ENET_WR_RMON_T_FRAG(base, ENET_RD_RMON_T_FRAG(base) |  (value)))
#define ENET_CLR_RMON_T_FRAG(base, value) (ENET_WR_RMON_T_FRAG(base, ENET_RD_RMON_T_FRAG(base) & ~(value)))
#define ENET_TOG_RMON_T_FRAG(base, value) (ENET_WR_RMON_T_FRAG(base, ENET_RD_RMON_T_FRAG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_FRAG bitfields
 */

/*!
 * @name Register ENET_RMON_T_FRAG, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_FRAG_TXPKTS field. */
#define ENET_RD_RMON_T_FRAG_TXPKTS(base) ((ENET_RMON_T_FRAG_REG(base) & ENET_RMON_T_FRAG_TXPKTS_MASK) >> ENET_RMON_T_FRAG_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_FRAG_TXPKTS(base) (ENET_RD_RMON_T_FRAG_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_JAB - RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_JAB - RMON Tx Packets > MAX_FL bytes, bad CRC (RMON_T_JAB) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_JAB register
 */
/*@{*/
#define ENET_RD_RMON_T_JAB(base) (ENET_RMON_T_JAB_REG(base))
#define ENET_WR_RMON_T_JAB(base, value) (ENET_RMON_T_JAB_REG(base) = (value))
#define ENET_RMW_RMON_T_JAB(base, mask, value) (ENET_WR_RMON_T_JAB(base, (ENET_RD_RMON_T_JAB(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_JAB(base, value) (ENET_WR_RMON_T_JAB(base, ENET_RD_RMON_T_JAB(base) |  (value)))
#define ENET_CLR_RMON_T_JAB(base, value) (ENET_WR_RMON_T_JAB(base, ENET_RD_RMON_T_JAB(base) & ~(value)))
#define ENET_TOG_RMON_T_JAB(base, value) (ENET_WR_RMON_T_JAB(base, ENET_RD_RMON_T_JAB(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_JAB bitfields
 */

/*!
 * @name Register ENET_RMON_T_JAB, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_JAB_TXPKTS field. */
#define ENET_RD_RMON_T_JAB_TXPKTS(base) ((ENET_RMON_T_JAB_REG(base) & ENET_RMON_T_JAB_TXPKTS_MASK) >> ENET_RMON_T_JAB_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_JAB_TXPKTS(base) (ENET_RD_RMON_T_JAB_TXPKTS(base))
/*@}*/

