pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual ENET_RMON_R_P64 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P64, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P64_COUNT field. */
#define ENET_RD_RMON_R_P64_COUNT(base) ((ENET_RMON_R_P64_REG(base) & ENET_RMON_R_P64_COUNT_MASK) >> ENET_RMON_R_P64_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P64_COUNT(base) (ENET_RD_RMON_R_P64_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P65TO127 - RMON Rx 65 to 127 byte packets (RMON_R_P65TO127)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P65TO127 - RMON Rx 65 to 127 byte packets (RMON_R_P65TO127) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P65TO127 register
 */
/*@{*/
#define ENET_RD_RMON_R_P65TO127(base) (ENET_RMON_R_P65TO127_REG(base))
#define ENET_WR_RMON_R_P65TO127(base, value) (ENET_RMON_R_P65TO127_REG(base) = (value))
#define ENET_RMW_RMON_R_P65TO127(base, mask, value) (ENET_WR_RMON_R_P65TO127(base, (ENET_RD_RMON_R_P65TO127(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P65TO127(base, value) (ENET_WR_RMON_R_P65TO127(base, ENET_RD_RMON_R_P65TO127(base) |  (value)))
#define ENET_CLR_RMON_R_P65TO127(base, value) (ENET_WR_RMON_R_P65TO127(base, ENET_RD_RMON_R_P65TO127(base) & ~(value)))
#define ENET_TOG_RMON_R_P65TO127(base, value) (ENET_WR_RMON_R_P65TO127(base, ENET_RD_RMON_R_P65TO127(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P65TO127 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P65TO127, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P65TO127_COUNT field. */
#define ENET_RD_RMON_R_P65TO127_COUNT(base) ((ENET_RMON_R_P65TO127_REG(base) & ENET_RMON_R_P65TO127_COUNT_MASK) >> ENET_RMON_R_P65TO127_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P65TO127_COUNT(base) (ENET_RD_RMON_R_P65TO127_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P128TO255 - RMON Rx 128 to 255 byte packets (RMON_R_P128TO255)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P128TO255 - RMON Rx 128 to 255 byte packets (RMON_R_P128TO255) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P128TO255 register
 */
/*@{*/
#define ENET_RD_RMON_R_P128TO255(base) (ENET_RMON_R_P128TO255_REG(base))
#define ENET_WR_RMON_R_P128TO255(base, value) (ENET_RMON_R_P128TO255_REG(base) = (value))
#define ENET_RMW_RMON_R_P128TO255(base, mask, value) (ENET_WR_RMON_R_P128TO255(base, (ENET_RD_RMON_R_P128TO255(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P128TO255(base, value) (ENET_WR_RMON_R_P128TO255(base, ENET_RD_RMON_R_P128TO255(base) |  (value)))
#define ENET_CLR_RMON_R_P128TO255(base, value) (ENET_WR_RMON_R_P128TO255(base, ENET_RD_RMON_R_P128TO255(base) & ~(value)))
#define ENET_TOG_RMON_R_P128TO255(base, value) (ENET_WR_RMON_R_P128TO255(base, ENET_RD_RMON_R_P128TO255(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P128TO255 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P128TO255, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P128TO255_COUNT field. */
#define ENET_RD_RMON_R_P128TO255_COUNT(base) ((ENET_RMON_R_P128TO255_REG(base) & ENET_RMON_R_P128TO255_COUNT_MASK) >> ENET_RMON_R_P128TO255_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P128TO255_COUNT(base) (ENET_RD_RMON_R_P128TO255_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P256TO511 - RMON Rx 256 to 511 byte packets (RMON_R_P256TO511)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P256TO511 - RMON Rx 256 to 511 byte packets (RMON_R_P256TO511) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P256TO511 register
 */
/*@{*/
#define ENET_RD_RMON_R_P256TO511(base) (ENET_RMON_R_P256TO511_REG(base))
#define ENET_WR_RMON_R_P256TO511(base, value) (ENET_RMON_R_P256TO511_REG(base) = (value))
#define ENET_RMW_RMON_R_P256TO511(base, mask, value) (ENET_WR_RMON_R_P256TO511(base, (ENET_RD_RMON_R_P256TO511(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P256TO511(base, value) (ENET_WR_RMON_R_P256TO511(base, ENET_RD_RMON_R_P256TO511(base) |  (value)))
#define ENET_CLR_RMON_R_P256TO511(base, value) (ENET_WR_RMON_R_P256TO511(base, ENET_RD_RMON_R_P256TO511(base) & ~(value)))
#define ENET_TOG_RMON_R_P256TO511(base, value) (ENET_WR_RMON_R_P256TO511(base, ENET_RD_RMON_R_P256TO511(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_P256TO511 bitfields
 */

/*!
 * @name Register ENET_RMON_R_P256TO511, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_P256TO511_COUNT field. */
#define ENET_RD_RMON_R_P256TO511_COUNT(base) ((ENET_RMON_R_P256TO511_REG(base) & ENET_RMON_R_P256TO511_COUNT_MASK) >> ENET_RMON_R_P256TO511_COUNT_SHIFT)
#define ENET_BRD_RMON_R_P256TO511_COUNT(base) (ENET_RD_RMON_R_P256TO511_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_P512TO1023 - RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_P512TO1023 - RMON Rx 512 to 1023 byte packets (RMON_R_P512TO1023) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_P512TO1023 register
 */
/*@{*/
#define ENET_RD_RMON_R_P512TO1023(base) (ENET_RMON_R_P512TO1023_REG(base))
#define ENET_WR_RMON_R_P512TO1023(base, value) (ENET_RMON_R_P512TO1023_REG(base) = (value))
#define ENET_RMW_RMON_R_P512TO1023(base, mask, value) (ENET_WR_RMON_R_P512TO1023(base, (ENET_RD_RMON_R_P512TO1023(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_P512TO1023(base, value) (ENET_WR_RMON_R_P512TO1023(base, ENET_RD_RMON_R_P512TO1023(base) |  (value)))
#define ENET_CLR_RMON_R_P512TO1023(base, value) (ENET_WR_RMON_R_P512TO1023(base, ENET_RD_RMON_R_P512TO1023(base) & ~(value)))
#define ENET_TOG_RMON_R_P512TO1023(base, value) (ENET_WR_RMON_R_P512TO1023(base, ENET_RD_RMON_R_P512TO1023(base) ^  (value)))
/*@}*/

