pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the SLAVE field to a new value. */
#define ENET_WR_ATCR_SLAVE(base, value) (ENET_RMW_ATCR(base, ENET_ATCR_SLAVE_MASK, ENET_ATCR_SLAVE(value)))
#define ENET_BWR_ATCR_SLAVE(base, value) (BITBAND_ACCESS32(&ENET_ATCR_REG(base), ENET_ATCR_SLAVE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ENET_ATVR - Timer Value Register
 ******************************************************************************/

/*!
 * @brief ENET_ATVR - Timer Value Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATVR register
 */
/*@{*/
#define ENET_RD_ATVR(base)       (ENET_ATVR_REG(base))
#define ENET_WR_ATVR(base, value) (ENET_ATVR_REG(base) = (value))
#define ENET_RMW_ATVR(base, mask, value) (ENET_WR_ATVR(base, (ENET_RD_ATVR(base) & ~(mask)) | (value)))
#define ENET_SET_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) |  (value)))
#define ENET_CLR_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) & ~(value)))
#define ENET_TOG_ATVR(base, value) (ENET_WR_ATVR(base, ENET_RD_ATVR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_ATOFF - Timer Offset Register
 ******************************************************************************/

/*!
 * @brief ENET_ATOFF - Timer Offset Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATOFF register
 */
/*@{*/
#define ENET_RD_ATOFF(base)      (ENET_ATOFF_REG(base))
#define ENET_WR_ATOFF(base, value) (ENET_ATOFF_REG(base) = (value))
#define ENET_RMW_ATOFF(base, mask, value) (ENET_WR_ATOFF(base, (ENET_RD_ATOFF(base) & ~(mask)) | (value)))
#define ENET_SET_ATOFF(base, value) (ENET_WR_ATOFF(base, ENET_RD_ATOFF(base) |  (value)))
#define ENET_CLR_ATOFF(base, value) (ENET_WR_ATOFF(base, ENET_RD_ATOFF(base) & ~(value)))
#define ENET_TOG_ATOFF(base, value) (ENET_WR_ATOFF(base, ENET_RD_ATOFF(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_ATPER - Timer Period Register
 ******************************************************************************/

/*!
 * @brief ENET_ATPER - Timer Period Register (RW)
 *
 * Reset value: 0x3B9ACA00U
 */
/*!
 * @name Constants and macros for entire ENET_ATPER register
 */
/*@{*/
#define ENET_RD_ATPER(base)      (ENET_ATPER_REG(base))
#define ENET_WR_ATPER(base, value) (ENET_ATPER_REG(base) = (value))
#define ENET_RMW_ATPER(base, mask, value) (ENET_WR_ATPER(base, (ENET_RD_ATPER(base) & ~(mask)) | (value)))
#define ENET_SET_ATPER(base, value) (ENET_WR_ATPER(base, ENET_RD_ATPER(base) |  (value)))
#define ENET_CLR_ATPER(base, value) (ENET_WR_ATPER(base, ENET_RD_ATPER(base) & ~(value)))
#define ENET_TOG_ATPER(base, value) (ENET_WR_ATPER(base, ENET_RD_ATPER(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_ATCOR - Timer Correction Register
 ******************************************************************************/

/*!
 * @brief ENET_ATCOR - Timer Correction Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATCOR register
 */
/*@{*/
#define ENET_RD_ATCOR(base)      (ENET_ATCOR_REG(base))
#define ENET_WR_ATCOR(base, value) (ENET_ATCOR_REG(base) = (value))
#define ENET_RMW_ATCOR(base, mask, value) (ENET_WR_ATCOR(base, (ENET_RD_ATCOR(base) & ~(mask)) | (value)))
#define ENET_SET_ATCOR(base, value) (ENET_WR_ATCOR(base, ENET_RD_ATCOR(base) |  (value)))
#define ENET_CLR_ATCOR(base, value) (ENET_WR_ATCOR(base, ENET_RD_ATCOR(base) & ~(value)))
#define ENET_TOG_ATCOR(base, value) (ENET_WR_ATCOR(base, ENET_RD_ATCOR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_ATCOR bitfields
 */

/*!
 * @name Register ENET_ATCOR, field COR[30:0] (RW)
 *
 * Defines after how many timer clock cycles (ts_clk) the correction counter
 * should be reset and trigger a correction increment on the timer. The amount of
 * correction is defined in ATINC[INC_CORR]. A value of 0 disables the correction
 * counter and no corrections occur. This value is given in clock cycles, not in
 * nanoseconds as all other values.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATCOR_COR field. */
#define ENET_RD_ATCOR_COR(base) ((ENET_ATCOR_REG(base) & ENET_ATCOR_COR_MASK) >> ENET_ATCOR_COR_SHIFT)
#define ENET_BRD_ATCOR_COR(base) (ENET_RD_ATCOR_COR(base))

/*! @brief Set the COR field to a new value. */
#define ENET_WR_ATCOR_COR(base, value) (ENET_RMW_ATCOR(base, ENET_ATCOR_COR_MASK, ENET_ATCOR_COR(value)))
#define ENET_BWR_ATCOR_COR(base, value) (ENET_WR_ATCOR_COR(base, value))
/*@}*/

/*******************************************************************************
 * ENET_ATINC - Time-Stamping Clock Period Register
 ******************************************************************************/

/*!
 * @brief ENET_ATINC - Time-Stamping Clock Period Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_ATINC register
 */
/*@{*/
#define ENET_RD_ATINC(base)      (ENET_ATINC_REG(base))
#define ENET_WR_ATINC(base, value) (ENET_ATINC_REG(base) = (value))
#define ENET_RMW_ATINC(base, mask, value) (ENET_WR_ATINC(base, (ENET_RD_ATINC(base) & ~(mask)) | (value)))
#define ENET_SET_ATINC(base, value) (ENET_WR_ATINC(base, ENET_RD_ATINC(base) |  (value)))
#define ENET_CLR_ATINC(base, value) (ENET_WR_ATINC(base, ENET_RD_ATINC(base) & ~(value)))
#define ENET_TOG_ATINC(base, value) (ENET_WR_ATINC(base, ENET_RD_ATINC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_ATINC bitfields
 */

/*!
 * @name Register ENET_ATINC, field INC[6:0] (RW)
 *
 * The timer increments by this amount each clock cycle. For example, set to 10
 * for 100 MHz, 8 for 125 MHz, 5 for 200 MHz. For highest precision, use a value
 * that is an integer fraction of the period set in ATPER.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATINC_INC field. */
#define ENET_RD_ATINC_INC(base) ((ENET_ATINC_REG(base) & ENET_ATINC_INC_MASK) >> ENET_ATINC_INC_SHIFT)
#define ENET_BRD_ATINC_INC(base) (ENET_RD_ATINC_INC(base))

/*! @brief Set the INC field to a new value. */
#define ENET_WR_ATINC_INC(base, value) (ENET_RMW_ATINC(base, ENET_ATINC_INC_MASK, ENET_ATINC_INC(value)))
#define ENET_BWR_ATINC_INC(base, value) (ENET_WR_ATINC_INC(base, value))
/*@}*/

/*!
 * @name Register ENET_ATINC, field INC_CORR[14:8] (RW)
 *
 * This value is added every time the correction timer expires (every clock
 * cycle given in ATCOR). A value smaller than INC slows the timer, while a value
 * larger than INC speeds the timer.
 */
/*@{*/
/*! @brief Read current value of the ENET_ATINC_INC_CORR field. */
#define ENET_RD_ATINC_INC_CORR(base) ((ENET_ATINC_REG(base) & ENET_ATINC_INC_CORR_MASK) >> ENET_ATINC_INC_CORR_SHIFT)
#define ENET_BRD_ATINC_INC_CORR(base) (ENET_RD_ATINC_INC_CORR(base))

/*! @brief Set the INC_CORR field to a new value. */
#define ENET_WR_ATINC_INC_CORR(base, value) (ENET_RMW_ATINC(base, ENET_ATINC_INC_CORR_MASK, ENET_ATINC_INC_CORR(value)))
#define ENET_BWR_ATINC_INC_CORR(base, value) (ENET_WR_ATINC_INC_CORR(base, value))
/*@}*/

