pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the WP field to a new value. */
#define FB_WR_CSMR_WP(base, index, value) (FB_RMW_CSMR(base, index, FB_CSMR_WP_MASK, FB_CSMR_WP(value)))
#define FB_BWR_CSMR_WP(base, index, value) (BITBAND_ACCESS32(&FB_CSMR_REG(base, index), FB_CSMR_WP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSMR, field BAM[31:16] (RW)
 *
 * Values:
 * - 0 - Corresponding address bit is used in chip-select decode
 * - 1 - Corresponding address bit is a don't care in chip-select decode.
 */
/*@{*/
/*! @brief Read current value of the FB_CSMR_BAM field. */
#define FB_RD_CSMR_BAM(base, index) ((FB_CSMR_REG(base, index) & FB_CSMR_BAM_MASK) >> FB_CSMR_BAM_SHIFT)
#define FB_BRD_CSMR_BAM(base, index) (FB_RD_CSMR_BAM(base, index))

/*! @brief Set the BAM field to a new value. */
#define FB_WR_CSMR_BAM(base, index, value) (FB_RMW_CSMR(base, index, FB_CSMR_BAM_MASK, FB_CSMR_BAM(value)))
#define FB_BWR_CSMR_BAM(base, index, value) (FB_WR_CSMR_BAM(base, index, value))
/*@}*/

/*******************************************************************************
 * FB_CSCR - Chip select control register
 ******************************************************************************/

/*!
 * @brief FB_CSCR - Chip select control register (RW)
 *
 * Reset value: 0x003FFC00U
 *
 * Each CSCRn controls the auto-acknowledge, address setup and hold times, port
 * size, burst capability, and number of wait states. To support the global
 * chip-select (FB_CS0) the CSCR0 reset values differ from the other CSCRs. The reset
 * value of CSCR0 is as follows: Bits 31-24 are 0 Bit 23-3 are device-dependent
 * Bits 3-0 are 0 See the Chip Configuration details for your particular device
 * for information on the exact CSCR0 reset value.
 */
/*!
 * @name Constants and macros for entire FB_CSCR register
 */
/*@{*/
#define FB_RD_CSCR(base, index)  (FB_CSCR_REG(base, index))
#define FB_WR_CSCR(base, index, value) (FB_CSCR_REG(base, index) = (value))
#define FB_RMW_CSCR(base, index, mask, value) (FB_WR_CSCR(base, index, (FB_RD_CSCR(base, index) & ~(mask)) | (value)))
#define FB_SET_CSCR(base, index, value) (FB_WR_CSCR(base, index, FB_RD_CSCR(base, index) |  (value)))
#define FB_CLR_CSCR(base, index, value) (FB_WR_CSCR(base, index, FB_RD_CSCR(base, index) & ~(value)))
#define FB_TOG_CSCR(base, index, value) (FB_WR_CSCR(base, index, FB_RD_CSCR(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FB_CSCR bitfields
 */

/*!
 * @name Register FB_CSCR, field BSTW[3] (RW)
 *
 * Values:
 * - 0 - Break data larger than the specified port size into individual,
 *     port-sized, non-burst writes. For example, a longword write to an 8-bit port
 *     takes four byte writes.
 * - 1 - Enables burst write of data larger than the specified port size,
 *     including longword writes to 8 and 16-bit ports, word writes to 8-bit ports, and
 *     line writes to 8-, 16-, and 32-bit ports.
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_BSTW field. */
#define FB_RD_CSCR_BSTW(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_BSTW_MASK) >> FB_CSCR_BSTW_SHIFT)
#define FB_BRD_CSCR_BSTW(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BSTW_SHIFT))

/*! @brief Set the BSTW field to a new value. */
#define FB_WR_CSCR_BSTW(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_BSTW_MASK, FB_CSCR_BSTW(value)))
#define FB_BWR_CSCR_BSTW(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BSTW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field BSTR[4] (RW)
 *
 * Values:
 * - 0 - Data exceeding the specified port size is broken into individual,
 *     port-sized, non-burst reads. For example, a longword read from an 8-bit port is
 *     broken into four 8-bit reads.
 * - 1 - Enables data burst reads larger than the specified port size, including
 *     longword reads from 8- and 16-bit ports, word reads from 8-bit ports, and
 *     line reads from 8, 16-, and 32-bit ports.
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_BSTR field. */
#define FB_RD_CSCR_BSTR(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_BSTR_MASK) >> FB_CSCR_BSTR_SHIFT)
#define FB_BRD_CSCR_BSTR(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BSTR_SHIFT))

/*! @brief Set the BSTR field to a new value. */
#define FB_WR_CSCR_BSTR(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_BSTR_MASK, FB_CSCR_BSTR(value)))
#define FB_BWR_CSCR_BSTR(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BSTR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field BEM[5] (RW)
 *
 * Values:
 * - 0 - The FB_BE n signals are not asserted for reads. The FB_BE n signals are
 *     asserted for data write only.
 * - 1 - The FB_BE n signals are asserted for read and write accesses
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_BEM field. */
#define FB_RD_CSCR_BEM(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_BEM_MASK) >> FB_CSCR_BEM_SHIFT)
#define FB_BRD_CSCR_BEM(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BEM_SHIFT))

/*! @brief Set the BEM field to a new value. */
#define FB_WR_CSCR_BEM(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_BEM_MASK, FB_CSCR_BEM(value)))
#define FB_BWR_CSCR_BEM(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BEM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field PS[7:6] (RW)
 *
 * Values:
 * - 00 - 32-bit port size. Valid data sampled and driven on FB_D[31:0]
 * - 01 - 8-bit port size. Valid data sampled and driven on FB_D[31:24] if BLS =
 *     0 or FB_D[7:0] if BLS = 1
 * - 10 - 16-bit port size. Valid data sampled and driven on FB_D[31:16] if BLS
 *     = 0 or FB_D[15:0] if BLS = 1
 * - 11 - 16-bit port size. Valid data sampled and driven on FB_D[31:16] if BLS
 *     = 0 or FB_D[15:0] if BLS = 1
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_PS field. */
#define FB_RD_CSCR_PS(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_PS_MASK) >> FB_CSCR_PS_SHIFT)
#define FB_BRD_CSCR_PS(base, index) (FB_RD_CSCR_PS(base, index))

/*! @brief Set the PS field to a new value. */
#define FB_WR_CSCR_PS(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_PS_MASK, FB_CSCR_PS(value)))
#define FB_BWR_CSCR_PS(base, index, value) (FB_WR_CSCR_PS(base, index, value))
/*@}*/

/*!
 * @name Register FB_CSCR, field AA[8] (RW)
 *
 * Values:
 * - 0 - No internal FB_TA is asserted. Cycle is terminated externally
 * - 1 - Internal transfer acknowledge is asserted as specified by WS
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_AA field. */
#define FB_RD_CSCR_AA(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_AA_MASK) >> FB_CSCR_AA_SHIFT)
#define FB_BRD_CSCR_AA(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_AA_SHIFT))

/*! @brief Set the AA field to a new value. */
#define FB_WR_CSCR_AA(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_AA_MASK, FB_CSCR_AA(value)))
#define FB_BWR_CSCR_AA(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_AA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field BLS[9] (RW)
 *
 * Values:
 * - 0 - Not shifted. Data is left-justfied on FB_AD.
 * - 1 - Shifted. Data is right justified on FB_AD.
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_BLS field. */
#define FB_RD_CSCR_BLS(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_BLS_MASK) >> FB_CSCR_BLS_SHIFT)
#define FB_BRD_CSCR_BLS(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BLS_SHIFT))

