pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the BLS field to a new value. */
#define FB_WR_CSCR_BLS(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_BLS_MASK, FB_CSCR_BLS(value)))
#define FB_BWR_CSCR_BLS(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_BLS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field WS[15:10] (RW)
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_WS field. */
#define FB_RD_CSCR_WS(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_WS_MASK) >> FB_CSCR_WS_SHIFT)
#define FB_BRD_CSCR_WS(base, index) (FB_RD_CSCR_WS(base, index))

/*! @brief Set the WS field to a new value. */
#define FB_WR_CSCR_WS(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_WS_MASK, FB_CSCR_WS(value)))
#define FB_BWR_CSCR_WS(base, index, value) (FB_WR_CSCR_WS(base, index, value))
/*@}*/

/*!
 * @name Register FB_CSCR, field WRAH[17:16] (RW)
 *
 * Values:
 * - 00 - Hold address and attributes one cycle after FB_CSn negates on writes.
 *     (Default FB_CSn)
 * - 01 - Hold address and attributes two cycles after FB_CSn negates on writes.
 * - 10 - Hold address and attributes three cycles after FB_CSn negates on
 *     writes.
 * - 11 - Hold address and attributes four cycles after FB_CSn negates on
 *     writes. (Default FB_CS0)
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_WRAH field. */
#define FB_RD_CSCR_WRAH(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_WRAH_MASK) >> FB_CSCR_WRAH_SHIFT)
#define FB_BRD_CSCR_WRAH(base, index) (FB_RD_CSCR_WRAH(base, index))

/*! @brief Set the WRAH field to a new value. */
#define FB_WR_CSCR_WRAH(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_WRAH_MASK, FB_CSCR_WRAH(value)))
#define FB_BWR_CSCR_WRAH(base, index, value) (FB_WR_CSCR_WRAH(base, index, value))
/*@}*/

/*!
 * @name Register FB_CSCR, field RDAH[19:18] (RW)
 *
 * Values:
 * - 00 - If AA is cleared, 1 cycle. If AA is set, 0 cycles.
 * - 01 - If AA is cleared, 2 cycles. If AA is set, 1 cycle.
 * - 10 - If AA is cleared, 3 cycles. If AA is set, 2 cycles.
 * - 11 - If AA is cleared, 4 cycles. If AA is set, 3 cycles.
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_RDAH field. */
#define FB_RD_CSCR_RDAH(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_RDAH_MASK) >> FB_CSCR_RDAH_SHIFT)
#define FB_BRD_CSCR_RDAH(base, index) (FB_RD_CSCR_RDAH(base, index))

/*! @brief Set the RDAH field to a new value. */
#define FB_WR_CSCR_RDAH(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_RDAH_MASK, FB_CSCR_RDAH(value)))
#define FB_BWR_CSCR_RDAH(base, index, value) (FB_WR_CSCR_RDAH(base, index, value))
/*@}*/

/*!
 * @name Register FB_CSCR, field ASET[21:20] (RW)
 *
 * Values:
 * - 00 - Assert FB_CSn on first rising clock edge after address is asserted.
 *     (Default FB_CSn)
 * - 01 - Assert FB_CSn on second rising clock edge after address is asserted.
 * - 10 - Assert FB_CSn on third rising clock edge after address is asserted.
 * - 11 - Assert FB_CSn on fourth rising clock edge after address is asserted.
 *     (Default FB_CS0)
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_ASET field. */
#define FB_RD_CSCR_ASET(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_ASET_MASK) >> FB_CSCR_ASET_SHIFT)
#define FB_BRD_CSCR_ASET(base, index) (FB_RD_CSCR_ASET(base, index))

/*! @brief Set the ASET field to a new value. */
#define FB_WR_CSCR_ASET(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_ASET_MASK, FB_CSCR_ASET(value)))
#define FB_BWR_CSCR_ASET(base, index, value) (FB_WR_CSCR_ASET(base, index, value))
/*@}*/

/*!
 * @name Register FB_CSCR, field EXTS[22] (RW)
 *
 * Values:
 * - 0 - FB_TS /FB_ALE asserts for one bus clock cycle
 * - 1 - FB_TS /FB_ALE remains asserted until the first positive clock edge
 *     after FB_CSn asserts
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_EXTS field. */
#define FB_RD_CSCR_EXTS(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_EXTS_MASK) >> FB_CSCR_EXTS_SHIFT)
#define FB_BRD_CSCR_EXTS(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_EXTS_SHIFT))

/*! @brief Set the EXTS field to a new value. */
#define FB_WR_CSCR_EXTS(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_EXTS_MASK, FB_CSCR_EXTS(value)))
#define FB_BWR_CSCR_EXTS(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_EXTS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field SWSEN[23] (RW)
 *
 * Values:
 * - 0 - The WS value inserts wait states before an internal transfer
 *     acknowledge is generated for all transfers
 * - 1 - The SWS value inserts wait states before an internal transfer
 *     acknowledge is generated for burst transfer secondary terminations
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_SWSEN field. */
#define FB_RD_CSCR_SWSEN(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_SWSEN_MASK) >> FB_CSCR_SWSEN_SHIFT)
#define FB_BRD_CSCR_SWSEN(base, index) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_SWSEN_SHIFT))

/*! @brief Set the SWSEN field to a new value. */
#define FB_WR_CSCR_SWSEN(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_SWSEN_MASK, FB_CSCR_SWSEN(value)))
#define FB_BWR_CSCR_SWSEN(base, index, value) (BITBAND_ACCESS32(&FB_CSCR_REG(base, index), FB_CSCR_SWSEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FB_CSCR, field SWS[31:26] (RW)
 */
/*@{*/
/*! @brief Read current value of the FB_CSCR_SWS field. */
#define FB_RD_CSCR_SWS(base, index) ((FB_CSCR_REG(base, index) & FB_CSCR_SWS_MASK) >> FB_CSCR_SWS_SHIFT)
#define FB_BRD_CSCR_SWS(base, index) (FB_RD_CSCR_SWS(base, index))

/*! @brief Set the SWS field to a new value. */
#define FB_WR_CSCR_SWS(base, index, value) (FB_RMW_CSCR(base, index, FB_CSCR_SWS_MASK, FB_CSCR_SWS(value)))
#define FB_BWR_CSCR_SWS(base, index, value) (FB_WR_CSCR_SWS(base, index, value))
/*@}*/

/*******************************************************************************
 * FB_CSPMCR - Chip select port multiplexing control register
 ******************************************************************************/

/*!
 * @brief FB_CSPMCR - Chip select port multiplexing control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CSPMCR register controls the multiplexing of the FlexBus signals. A bus
 * error occurs when: writing a reserved value, writing to a reserved bit location
 * in this register, or not accessing this register as 32-bit.
 */
/*!
 * @name Constants and macros for entire FB_CSPMCR register
 */
/*@{*/
#define FB_RD_CSPMCR(base)       (FB_CSPMCR_REG(base))
#define FB_WR_CSPMCR(base, value) (FB_CSPMCR_REG(base) = (value))
#define FB_RMW_CSPMCR(base, mask, value) (FB_WR_CSPMCR(base, (FB_RD_CSPMCR(base) & ~(mask)) | (value)))
#define FB_SET_CSPMCR(base, value) (FB_WR_CSPMCR(base, FB_RD_CSPMCR(base) |  (value)))
#define FB_CLR_CSPMCR(base, value) (FB_WR_CSPMCR(base, FB_RD_CSPMCR(base) & ~(value)))
#define FB_TOG_CSPMCR(base, value) (FB_WR_CSPMCR(base, FB_RD_CSPMCR(base) ^  (value)))
/*@}*/

