pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * FMC_PFB01CR - Flash Bank 0-1 Control Register
 ******************************************************************************/

/*!
 * @brief FMC_PFB01CR - Flash Bank 0-1 Control Register (RW)
 *
 * Reset value: 0x3004001FU
 *
 * This register controls the operation of memory banks 0 and 1.
 */
/*!
 * @name Constants and macros for entire FMC_PFB01CR register
 */
/*@{*/
#define FMC_RD_PFB01CR(base)     (FMC_PFB01CR_REG(base))
#define FMC_WR_PFB01CR(base, value) (FMC_PFB01CR_REG(base) = (value))
#define FMC_RMW_PFB01CR(base, mask, value) (FMC_WR_PFB01CR(base, (FMC_RD_PFB01CR(base) & ~(mask)) | (value)))
#define FMC_SET_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) |  (value)))
#define FMC_CLR_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) & ~(value)))
#define FMC_TOG_PFB01CR(base, value) (FMC_WR_PFB01CR(base, FMC_RD_PFB01CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFB01CR bitfields
 */

/*!
 * @name Register FMC_PFB01CR, field B01SEBE[0] (RW)
 *
 * This bit controls whether the single entry page buffer is enabled in response
 * to flash read accesses. Its operation is independent from the cache of banks
 * 2-3. A high-to-low transition of this enable forces the page buffer to be
 * invalidated.
 *
 * Values:
 * - 0 - Single entry buffer is disabled.
 * - 1 - Single entry buffer is enabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01SEBE field. */
#define FMC_RD_PFB01CR_B01SEBE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01SEBE_MASK) >> FMC_PFB01CR_B01SEBE_SHIFT)
#define FMC_BRD_PFB01CR_B01SEBE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01SEBE_SHIFT))

/*! @brief Set the B01SEBE field to a new value. */
#define FMC_WR_PFB01CR_B01SEBE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B01SEBE_MASK, FMC_PFB01CR_B01SEBE(value)))
#define FMC_BWR_PFB01CR_B01SEBE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01SEBE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01IPE[1] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to instruction fetches.
 *
 * Values:
 * - 0 - Do not prefetch in response to instruction fetches.
 * - 1 - Enable prefetches in response to instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01IPE field. */
#define FMC_RD_PFB01CR_B01IPE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01IPE_MASK) >> FMC_PFB01CR_B01IPE_SHIFT)
#define FMC_BRD_PFB01CR_B01IPE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01IPE_SHIFT))

/*! @brief Set the B01IPE field to a new value. */
#define FMC_WR_PFB01CR_B01IPE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B01IPE_MASK, FMC_PFB01CR_B01IPE(value)))
#define FMC_BWR_PFB01CR_B01IPE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01IPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01DPE[2] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to data references.
 *
 * Values:
 * - 0 - Do not prefetch in response to data references.
 * - 1 - Enable prefetches in response to data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01DPE field. */
#define FMC_RD_PFB01CR_B01DPE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01DPE_MASK) >> FMC_PFB01CR_B01DPE_SHIFT)
#define FMC_BRD_PFB01CR_B01DPE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01DPE_SHIFT))

/*! @brief Set the B01DPE field to a new value. */
#define FMC_WR_PFB01CR_B01DPE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B01DPE_MASK, FMC_PFB01CR_B01DPE(value)))
#define FMC_BWR_PFB01CR_B01DPE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01DPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01ICE[3] (RW)
 *
 * This bit controls whether instruction fetches are loaded into the cache.
 *
 * Values:
 * - 0 - Do not cache instruction fetches.
 * - 1 - Cache instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01ICE field. */
#define FMC_RD_PFB01CR_B01ICE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01ICE_MASK) >> FMC_PFB01CR_B01ICE_SHIFT)
#define FMC_BRD_PFB01CR_B01ICE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01ICE_SHIFT))

/*! @brief Set the B01ICE field to a new value. */
#define FMC_WR_PFB01CR_B01ICE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B01ICE_MASK, FMC_PFB01CR_B01ICE(value)))
#define FMC_BWR_PFB01CR_B01ICE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01ICE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01DCE[4] (RW)
 *
 * This bit controls whether data references are loaded into the cache.
 *
 * Values:
 * - 0 - Do not cache data references.
 * - 1 - Cache data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01DCE field. */
#define FMC_RD_PFB01CR_B01DCE(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01DCE_MASK) >> FMC_PFB01CR_B01DCE_SHIFT)
#define FMC_BRD_PFB01CR_B01DCE(base) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01DCE_SHIFT))

/*! @brief Set the B01DCE field to a new value. */
#define FMC_WR_PFB01CR_B01DCE(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_B01DCE_MASK, FMC_PFB01CR_B01DCE(value)))
#define FMC_BWR_PFB01CR_B01DCE(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_B01DCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CRC[7:5] (RW)
 *
 * This 3-bit field defines the replacement algorithm for accesses that are
 * cached.
 *
 * Values:
 * - 000 - LRU replacement algorithm per set across all four ways
 * - 001 - Reserved
 * - 010 - Independent LRU with ways [0-1] for ifetches, [2-3] for data
 * - 011 - Independent LRU with ways [0-2] for ifetches, [3] for data
 * - 1xx - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_CRC field. */
#define FMC_RD_PFB01CR_CRC(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_CRC_MASK) >> FMC_PFB01CR_CRC_SHIFT)
#define FMC_BRD_PFB01CR_CRC(base) (FMC_RD_PFB01CR_CRC(base))

/*! @brief Set the CRC field to a new value. */
#define FMC_WR_PFB01CR_CRC(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CRC_MASK, FMC_PFB01CR_CRC(value)))
#define FMC_BWR_PFB01CR_CRC(base, value) (FMC_WR_PFB01CR_CRC(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01MW[18:17] (RO)
 *
 * This read-only field defines the width of the bank 0-1 memory.
 *
 * Values:
 * - 00 - 32 bits
 * - 01 - 64 bits
 * - 10 - 128 bits
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01MW field. */
#define FMC_RD_PFB01CR_B01MW(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01MW_MASK) >> FMC_PFB01CR_B01MW_SHIFT)
#define FMC_BRD_PFB01CR_B01MW(base) (FMC_RD_PFB01CR_B01MW(base))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field S_B_INV[19] (WORZ)
 *
 * This bit determines if the FMC's prefetch speculation buffer and the single
 * entry page buffer are to be invalidated (cleared). When this bit is written,
 * the speculation buffer and single entry buffer are immediately cleared. This bit
 * always reads as zero.
 *
 * Values:
 * - 0 - Speculation buffer and single entry buffer are not affected.
 * - 1 - Invalidate (clear) speculation buffer and single entry buffer.
 */
/*@{*/
/*! @brief Set the S_B_INV field to a new value. */
#define FMC_WR_PFB01CR_S_B_INV(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_S_B_INV_MASK, FMC_PFB01CR_S_B_INV(value)))
#define FMC_BWR_PFB01CR_S_B_INV(base, value) (BITBAND_ACCESS32(&FMC_PFB01CR_REG(base), FMC_PFB01CR_S_B_INV_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CINV_WAY[23:20] (WORZ)
 *
 * These bits determine if the given cache way is to be invalidated (cleared).
 * When a bit within this field is written, the corresponding cache way is
 * immediately invalidated: the way's tag, data, and valid contents are cleared. This
 * field always reads as zero. Cache invalidation takes precedence over locking.
 * The cache is invalidated by system reset. System software is required to
 * maintain memory coherency when any segment of the flash memory is programmed or
 * erased. Accordingly, cache invalidations must occur after a programming or erase
 * event is completed and before the new memory image is accessed. The bit setting
 * definitions are for each bit in the field.
 *
 * Values:
 * - 0 - No cache way invalidation for the corresponding cache
 * - 1 - Invalidate cache way for the corresponding cache: clear the tag, data,
 *     and vld bits of ways selected
 */
/*@{*/
/*! @brief Set the CINV_WAY field to a new value. */
#define FMC_WR_PFB01CR_CINV_WAY(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CINV_WAY_MASK, FMC_PFB01CR_CINV_WAY(value)))
#define FMC_BWR_PFB01CR_CINV_WAY(base, value) (FMC_WR_PFB01CR_CINV_WAY(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field CLCK_WAY[27:24] (RW)
 *
 * These bits determine if the given cache way is locked such that its contents
 * will not be displaced by future misses. The bit setting definitions are for
 * each bit in the field.
 *
 * Values:
 * - 0 - Cache way is unlocked and may be displaced
 * - 1 - Cache way is locked and its contents are not displaced
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_CLCK_WAY field. */
#define FMC_RD_PFB01CR_CLCK_WAY(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_CLCK_WAY_MASK) >> FMC_PFB01CR_CLCK_WAY_SHIFT)
#define FMC_BRD_PFB01CR_CLCK_WAY(base) (FMC_RD_PFB01CR_CLCK_WAY(base))

/*! @brief Set the CLCK_WAY field to a new value. */
#define FMC_WR_PFB01CR_CLCK_WAY(base, value) (FMC_RMW_PFB01CR(base, FMC_PFB01CR_CLCK_WAY_MASK, FMC_PFB01CR_CLCK_WAY(value)))
#define FMC_BWR_PFB01CR_CLCK_WAY(base, value) (FMC_WR_PFB01CR_CLCK_WAY(base, value))
/*@}*/

/*!
 * @name Register FMC_PFB01CR, field B01RWSC[31:28] (RO)
 *
 * This read-only field defines the number of wait states required to access the
 * bank 0-1 flash memory. The relationship between the read access time of the
 * flash array (expressed in system clock cycles) and RWSC is defined as: Access
 * time of flash array [system clocks] = RWSC + 1 The FMC automatically calculates
 * this value based on the ratio of the system clock speed to the flash clock
 * speed. For example, when this ratio is 4:1, the field's value is 3h.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB01CR_B01RWSC field. */
#define FMC_RD_PFB01CR_B01RWSC(base) ((FMC_PFB01CR_REG(base) & FMC_PFB01CR_B01RWSC_MASK) >> FMC_PFB01CR_B01RWSC_SHIFT)
#define FMC_BRD_PFB01CR_B01RWSC(base) (FMC_RD_PFB01CR_B01RWSC(base))
/*@}*/

