pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * FMC_PFB23CR - Flash Bank 2-3 Control Register
 ******************************************************************************/

/*!
 * @brief FMC_PFB23CR - Flash Bank 2-3 Control Register (RW)
 *
 * Reset value: 0x3004001FU
 *
 * This register has a format similar to that for PFB01CR, except it controls
 * the operation of memory banks 2-3, and the "global" cache control fields are
 * empty.
 */
/*!
 * @name Constants and macros for entire FMC_PFB23CR register
 */
/*@{*/
#define FMC_RD_PFB23CR(base)     (FMC_PFB23CR_REG(base))
#define FMC_WR_PFB23CR(base, value) (FMC_PFB23CR_REG(base) = (value))
#define FMC_RMW_PFB23CR(base, mask, value) (FMC_WR_PFB23CR(base, (FMC_RD_PFB23CR(base) & ~(mask)) | (value)))
#define FMC_SET_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) |  (value)))
#define FMC_CLR_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) & ~(value)))
#define FMC_TOG_PFB23CR(base, value) (FMC_WR_PFB23CR(base, FMC_RD_PFB23CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_PFB23CR bitfields
 */

/*!
 * @name Register FMC_PFB23CR, field B23SEBE[0] (RW)
 *
 * This bit controls whether the single entry buffer is enabled in response to
 * flash read accesses. Its operation is independent from the cache of banks 0-1.
 * A high-to-low transition of this enable forces the page buffer to be
 * invalidated.
 *
 * Values:
 * - 0 - Single entry buffer is disabled.
 * - 1 - Single entry buffer is enabled.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23SEBE field. */
#define FMC_RD_PFB23CR_B23SEBE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23SEBE_MASK) >> FMC_PFB23CR_B23SEBE_SHIFT)
#define FMC_BRD_PFB23CR_B23SEBE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23SEBE_SHIFT))

/*! @brief Set the B23SEBE field to a new value. */
#define FMC_WR_PFB23CR_B23SEBE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B23SEBE_MASK, FMC_PFB23CR_B23SEBE(value)))
#define FMC_BWR_PFB23CR_B23SEBE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23SEBE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23IPE[1] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to instruction fetches.
 *
 * Values:
 * - 0 - Do not prefetch in response to instruction fetches.
 * - 1 - Enable prefetches in response to instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23IPE field. */
#define FMC_RD_PFB23CR_B23IPE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23IPE_MASK) >> FMC_PFB23CR_B23IPE_SHIFT)
#define FMC_BRD_PFB23CR_B23IPE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23IPE_SHIFT))

/*! @brief Set the B23IPE field to a new value. */
#define FMC_WR_PFB23CR_B23IPE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B23IPE_MASK, FMC_PFB23CR_B23IPE(value)))
#define FMC_BWR_PFB23CR_B23IPE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23IPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23DPE[2] (RW)
 *
 * This bit controls whether prefetches (or speculative accesses) are initiated
 * in response to data references.
 *
 * Values:
 * - 0 - Do not prefetch in response to data references.
 * - 1 - Enable prefetches in response to data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23DPE field. */
#define FMC_RD_PFB23CR_B23DPE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23DPE_MASK) >> FMC_PFB23CR_B23DPE_SHIFT)
#define FMC_BRD_PFB23CR_B23DPE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23DPE_SHIFT))

/*! @brief Set the B23DPE field to a new value. */
#define FMC_WR_PFB23CR_B23DPE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B23DPE_MASK, FMC_PFB23CR_B23DPE(value)))
#define FMC_BWR_PFB23CR_B23DPE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23DPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23ICE[3] (RW)
 *
 * This bit controls whether instruction fetches are loaded into the cache.
 *
 * Values:
 * - 0 - Do not cache instruction fetches.
 * - 1 - Cache instruction fetches.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23ICE field. */
#define FMC_RD_PFB23CR_B23ICE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23ICE_MASK) >> FMC_PFB23CR_B23ICE_SHIFT)
#define FMC_BRD_PFB23CR_B23ICE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23ICE_SHIFT))

/*! @brief Set the B23ICE field to a new value. */
#define FMC_WR_PFB23CR_B23ICE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B23ICE_MASK, FMC_PFB23CR_B23ICE(value)))
#define FMC_BWR_PFB23CR_B23ICE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23ICE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23DCE[4] (RW)
 *
 * This bit controls whether data references are loaded into the cache.
 *
 * Values:
 * - 0 - Do not cache data references.
 * - 1 - Cache data references.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23DCE field. */
#define FMC_RD_PFB23CR_B23DCE(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23DCE_MASK) >> FMC_PFB23CR_B23DCE_SHIFT)
#define FMC_BRD_PFB23CR_B23DCE(base) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23DCE_SHIFT))

/*! @brief Set the B23DCE field to a new value. */
#define FMC_WR_PFB23CR_B23DCE(base, value) (FMC_RMW_PFB23CR(base, FMC_PFB23CR_B23DCE_MASK, FMC_PFB23CR_B23DCE(value)))
#define FMC_BWR_PFB23CR_B23DCE(base, value) (BITBAND_ACCESS32(&FMC_PFB23CR_REG(base), FMC_PFB23CR_B23DCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23MW[18:17] (RO)
 *
 * This read-only field defines the width of the bank 2-3 memory.
 *
 * Values:
 * - 00 - 32 bits
 * - 01 - 64 bits
 * - 10 - 128 bits
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23MW field. */
#define FMC_RD_PFB23CR_B23MW(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23MW_MASK) >> FMC_PFB23CR_B23MW_SHIFT)
#define FMC_BRD_PFB23CR_B23MW(base) (FMC_RD_PFB23CR_B23MW(base))
/*@}*/

/*!
 * @name Register FMC_PFB23CR, field B23RWSC[31:28] (RO)
 *
 * This read-only field defines the number of wait states required to access the
 * bank 2-3 flash memory. The relationship between the read access time of the
 * flash array (expressed in system clock cycles) and RWSC is defined as: Access
 * time of flash array [system clocks] = RWSC + 1 The FMC automatically calculates
 * this value based on the ratio of the system clock speed to the flash clock
 * speed. For example, when this ratio is 4:1, the field's value is 3h.
 */
/*@{*/
/*! @brief Read current value of the FMC_PFB23CR_B23RWSC field. */
#define FMC_RD_PFB23CR_B23RWSC(base) ((FMC_PFB23CR_REG(base) & FMC_PFB23CR_B23RWSC_MASK) >> FMC_PFB23CR_B23RWSC_SHIFT)
#define FMC_BRD_PFB23CR_B23RWSC(base) (FMC_RD_PFB23CR_B23RWSC(base))
/*@}*/

