pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * FTFE_FPROT0 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT0 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any FTFE command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory. Program flash protection
 * register Program flash protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16]
 * FPROT2 PROT[15:8] FPROT3 PROT[7:0] During the reset sequence, the FPROT
 * registers are loaded with the contents of the program flash protection bytes in the
 * Flash Configuration Field as indicated in the following table. Program flash
 * protection register Flash Configuration Field offset address FPROT0 0x0008 FPROT1
 * 0x0009 FPROT2 0x000A FPROT3 0x000B To change the program flash protection
 * that is loaded during the reset sequence, unprotect the sector of program flash
 * memory that contains the Flash Configuration Field. Then, reprogram the program
 * flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT0 register
 */
/*@{*/
#define FTFE_RD_FPROT0(base)     (FTFE_FPROT0_REG(base))
#define FTFE_WR_FPROT0(base, value) (FTFE_FPROT0_REG(base) = (value))
#define FTFE_RMW_FPROT0(base, mask, value) (FTFE_WR_FPROT0(base, (FTFE_RD_FPROT0(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT0(base, value) (FTFE_WR_FPROT0(base, FTFE_RD_FPROT0(base) |  (value)))
#define FTFE_CLR_FPROT0(base, value) (FTFE_WR_FPROT0(base, FTFE_RD_FPROT0(base) & ~(value)))
#define FTFE_TOG_FPROT0(base, value) (FTFE_WR_FPROT0(base, FTFE_RD_FPROT0(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FEPROT - EEPROM Protection Register
 ******************************************************************************/

/*!
 * @brief FTFE_FEPROT - EEPROM Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * For devices with FlexNVM: The FEPROT register defines which EEPROM regions of
 * the FlexRAM are protected against program and erase operations. Protected
 * EEPROM regions cannot have their content changed by writing to it. Unprotected
 * regions can be changed by writing to the FlexRAM. For devices with program flash
 * only: This register is reserved and not used.
 */
/*!
 * @name Constants and macros for entire FTFE_FEPROT register
 */
/*@{*/
#define FTFE_RD_FEPROT(base)     (FTFE_FEPROT_REG(base))
#define FTFE_WR_FEPROT(base, value) (FTFE_FEPROT_REG(base) = (value))
#define FTFE_RMW_FEPROT(base, mask, value) (FTFE_WR_FEPROT(base, (FTFE_RD_FEPROT(base) & ~(mask)) | (value)))
#define FTFE_SET_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) |  (value)))
#define FTFE_CLR_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) & ~(value)))
#define FTFE_TOG_FEPROT(base, value) (FTFE_WR_FEPROT(base, FTFE_RD_FEPROT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FDPROT - Data Flash Protection Register
 ******************************************************************************/

/*!
 * @brief FTFE_FDPROT - Data Flash Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * The FDPROT register defines which data flash regions are protected against
 * program and erase operations. Protected Flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by both program and erase
 * operations.
 */
/*!
 * @name Constants and macros for entire FTFE_FDPROT register
 */
/*@{*/
#define FTFE_RD_FDPROT(base)     (FTFE_FDPROT_REG(base))
#define FTFE_WR_FDPROT(base, value) (FTFE_FDPROT_REG(base) = (value))
#define FTFE_RMW_FDPROT(base, mask, value) (FTFE_WR_FDPROT(base, (FTFE_RD_FDPROT(base) & ~(mask)) | (value)))
#define FTFE_SET_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) |  (value)))
#define FTFE_CLR_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) & ~(value)))
#define FTFE_TOG_FDPROT(base, value) (FTFE_WR_FDPROT(base, FTFE_RD_FDPROT(base) ^  (value)))
/*@}*/

/*
 * MK70F12 FTM
 *
 * FlexTimer Module
 *
 * Registers defined in this header file:
 * - FTM_SC - Status and Control
 * - FTM_CNT - Counter
 * - FTM_MOD - Modulo
 * - FTM_CnSC - Channel (n) Status and Control
 * - FTM_CnV - Channel (n) Value
 * - FTM_CNTIN - Counter Initial Value
 * - FTM_STATUS - Capture and Compare Status
 * - FTM_MODE - Features Mode Selection
 * - FTM_SYNC - Synchronization
 * - FTM_OUTINIT - Initial State for Channels Output
 * - FTM_OUTMASK - Output Mask
 * - FTM_COMBINE - Function for Linked Channels
 * - FTM_DEADTIME - Deadtime Insertion Control
 * - FTM_EXTTRIG - FTM External Trigger
 * - FTM_POL - Channels Polarity
 * - FTM_FMS - Fault Mode Status
 * - FTM_FILTER - Input Capture Filter Control
 * - FTM_FLTCTRL - Fault Control
 * - FTM_QDCTRL - Quadrature Decoder Control and Status
 * - FTM_CONF - Configuration
 * - FTM_FLTPOL - FTM Fault Input Polarity
 * - FTM_SYNCONF - Synchronization Configuration
 * - FTM_INVCTRL - FTM Inverting Control
 * - FTM_SWOCTRL - FTM Software Output Control
 * - FTM_PWMLOAD - FTM PWM Load
 */

#define FTM_INSTANCE_COUNT (4U) /*!< Number of instances of the FTM module. */
#define FTM0_IDX (0U) /*!< Instance number for FTM0. */
#define FTM1_IDX (1U) /*!< Instance number for FTM1. */
#define FTM2_IDX (2U) /*!< Instance number for FTM2. */
#define FTM3_IDX (3U) /*!< Instance number for FTM3. */

/*******************************************************************************
 * FTM_SC - Status and Control
 ******************************************************************************/

/*!
 * @brief FTM_SC - Status and Control (RW)
 *
 * Reset value: 0x00000000U
 *
 * SC contains the overflow status flag and control bits used to configure the
 * interrupt enable, FTM configuration, clock source, and prescaler factor. These
 * controls relate to all channels within this module.
 */
/*!
 * @name Constants and macros for entire FTM_SC register
 */
/*@{*/
#define FTM_RD_SC(base)          (FTM_SC_REG(base))
#define FTM_WR_SC(base, value)   (FTM_SC_REG(base) = (value))
#define FTM_RMW_SC(base, mask, value) (FTM_WR_SC(base, (FTM_RD_SC(base) & ~(mask)) | (value)))
#define FTM_SET_SC(base, value)  (FTM_WR_SC(base, FTM_RD_SC(base) |  (value)))
#define FTM_CLR_SC(base, value)  (FTM_WR_SC(base, FTM_RD_SC(base) & ~(value)))
#define FTM_TOG_SC(base, value)  (FTM_WR_SC(base, FTM_RD_SC(base) ^  (value)))
/*@}*/

