pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * I2S_MDR - MCLK Divide Register
 ******************************************************************************/

/*!
 * @brief I2S_MDR - MCLK Divide Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Configures the MCLK Divide Ratio. Although the MCLK Divide Register can be
 * changed when the MCLK divided clock is enabled, additional writes to the MCLK
 * Divide Register are blocked while the Divider Update Flag is set. Writes to the
 * MCLK Divide Register when the MCLK divided clock is disabled do not set the
 * Divider Update Flag.
 */
/*!
 * @name Constants and macros for entire I2S_MDR register
 */
/*@{*/
#define I2S_RD_MDR(base)         (I2S_MDR_REG(base))
#define I2S_WR_MDR(base, value)  (I2S_MDR_REG(base) = (value))
#define I2S_RMW_MDR(base, mask, value) (I2S_WR_MDR(base, (I2S_RD_MDR(base) & ~(mask)) | (value)))
#define I2S_SET_MDR(base, value) (I2S_WR_MDR(base, I2S_RD_MDR(base) |  (value)))
#define I2S_CLR_MDR(base, value) (I2S_WR_MDR(base, I2S_RD_MDR(base) & ~(value)))
#define I2S_TOG_MDR(base, value) (I2S_WR_MDR(base, I2S_RD_MDR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual I2S_MDR bitfields
 */

/*!
 * @name Register I2S_MDR, field DIVIDE[11:0] (RW)
 *
 * The MCLK FRACT must be set equal or less than the MCLK DIVIDE. Sets the MCLK
 * divide ratio such that: MCLK output = MCLK input * ( (FRACT + 1) / (DIVIDE +
 * 1) )
 */
/*@{*/
/*! @brief Read current value of the I2S_MDR_DIVIDE field. */
#define I2S_RD_MDR_DIVIDE(base) ((I2S_MDR_REG(base) & I2S_MDR_DIVIDE_MASK) >> I2S_MDR_DIVIDE_SHIFT)
#define I2S_BRD_MDR_DIVIDE(base) (I2S_RD_MDR_DIVIDE(base))

/*! @brief Set the DIVIDE field to a new value. */
#define I2S_WR_MDR_DIVIDE(base, value) (I2S_RMW_MDR(base, I2S_MDR_DIVIDE_MASK, I2S_MDR_DIVIDE(value)))
#define I2S_BWR_MDR_DIVIDE(base, value) (I2S_WR_MDR_DIVIDE(base, value))
/*@}*/

/*!
 * @name Register I2S_MDR, field FRACT[19:12] (RW)
 *
 * The MCLK FRACT must be set equal or less than the MCLK DIVIDE. Sets the MCLK
 * divide ratio such that: MCLK output = MCLK input * ( (FRACT + 1) / (DIVIDE +
 * 1) )
 */
/*@{*/
/*! @brief Read current value of the I2S_MDR_FRACT field. */
#define I2S_RD_MDR_FRACT(base) ((I2S_MDR_REG(base) & I2S_MDR_FRACT_MASK) >> I2S_MDR_FRACT_SHIFT)
#define I2S_BRD_MDR_FRACT(base) (I2S_RD_MDR_FRACT(base))

/*! @brief Set the FRACT field to a new value. */
#define I2S_WR_MDR_FRACT(base, value) (I2S_RMW_MDR(base, I2S_MDR_FRACT_MASK, I2S_MDR_FRACT(value)))
#define I2S_BWR_MDR_FRACT(base, value) (I2S_WR_MDR_FRACT(base, value))
/*@}*/

/*
 * MK70F12 LCDC
 *
 * Liquid Crystal Display Controller
 *
 * Registers defined in this header file:
 * - LCDC_LSSAR - LCDC screen start address register
 * - LCDC_LSR - LCDC size register
 * - LCDC_LVPWR - LCDC virtual page width register
 * - LCDC_LCPR - LCDC cursor position register
 * - LCDC_LCWHB - LCDC cursor width, height, and blink register
 * - LCDC_LCCMR - LCDC color cursor mapping register
 * - LCDC_LPCR - LCDC panel configuration register
 * - LCDC_LHCR - LCDC horizontal configuration register
 * - LCDC_LVCR - LCDC vertical configuration register
 * - LCDC_LPOR - LCDC panning offset register
 * - LCDC_LPCCR - LCDC PWM contrast control register
 * - LCDC_LDCR - LCDC DMA control register
 * - LCDC_LRMCR - LCDC refresh mode control register
 * - LCDC_LICR - LCDC interrupt configuration register
 * - LCDC_LIER - LCDC interrupt enable register
 * - LCDC_LISR - LCDC interrupt status register
 * - LCDC_LGWSAR - LCDC graphic window start address register
 * - LCDC_LGWSR - LCDC graphic window size register
 * - LCDC_LGWVPWR - LCDC graphic window virtual page width register
 * - LCDC_LGWPOR - LCDC graphic window panning offset register
 * - LCDC_LGWPR - LCDC graphic window position register
 * - LCDC_LGWCR - LCDC graphic window control register
 * - LCDC_LGWDCR - LCDC graphic window DMA control register
 * - LCDC_LAUSCR - LCDC AUS mode control register
 * - LCDC_LAUSCCR - LCDC AUS mode cursor control register
 */

#define LCDC_INSTANCE_COUNT (1U) /*!< Number of instances of the LCDC module. */
#define LCDC_IDX (0U) /*!< Instance number for LCDC. */

/*******************************************************************************
 * LCDC_LSSAR - LCDC screen start address register
 ******************************************************************************/

/*!
 * @brief LCDC_LSSAR - LCDC screen start address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register specifies the LCD screen start address. Refer to LCD screen
 * format for more details.
 */
/*!
 * @name Constants and macros for entire LCDC_LSSAR register
 */
/*@{*/
#define LCDC_RD_LSSAR(base)      (LCDC_LSSAR_REG(base))
#define LCDC_WR_LSSAR(base, value) (LCDC_LSSAR_REG(base) = (value))
#define LCDC_RMW_LSSAR(base, mask, value) (LCDC_WR_LSSAR(base, (LCDC_RD_LSSAR(base) & ~(mask)) | (value)))
#define LCDC_SET_LSSAR(base, value) (LCDC_WR_LSSAR(base, LCDC_RD_LSSAR(base) |  (value)))
#define LCDC_CLR_LSSAR(base, value) (LCDC_WR_LSSAR(base, LCDC_RD_LSSAR(base) & ~(value)))
#define LCDC_TOG_LSSAR(base, value) (LCDC_WR_LSSAR(base, LCDC_RD_LSSAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LSSAR bitfields
 */

/*!
 * @name Register LCDC_LSSAR, field SSA[31:2] (RW)
 *
 * Holds pixel data for a new frame from SSA address. This field must start at a
 * location that enables a complete picture to be stored in a 4 MB memory
 * boundary (A [21:0]). A [31:22] has a fixed value for a picture's image.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LSSAR_SSA field. */
#define LCDC_RD_LSSAR_SSA(base) ((LCDC_LSSAR_REG(base) & LCDC_LSSAR_SSA_MASK) >> LCDC_LSSAR_SSA_SHIFT)
#define LCDC_BRD_LSSAR_SSA(base) (LCDC_RD_LSSAR_SSA(base))

/*! @brief Set the SSA field to a new value. */
#define LCDC_WR_LSSAR_SSA(base, value) (LCDC_RMW_LSSAR(base, LCDC_LSSAR_SSA_MASK, LCDC_LSSAR_SSA(value)))
#define LCDC_BWR_LSSAR_SSA(base, value) (LCDC_WR_LSSAR_SSA(base, value))
/*@}*/

