pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * LCDC_LSR - LCDC size register
 ******************************************************************************/

/*!
 * @brief LCDC_LSR - LCDC size register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the height and width of the LCD screen.
 */
/*!
 * @name Constants and macros for entire LCDC_LSR register
 */
/*@{*/
#define LCDC_RD_LSR(base)        (LCDC_LSR_REG(base))
#define LCDC_WR_LSR(base, value) (LCDC_LSR_REG(base) = (value))
#define LCDC_RMW_LSR(base, mask, value) (LCDC_WR_LSR(base, (LCDC_RD_LSR(base) & ~(mask)) | (value)))
#define LCDC_SET_LSR(base, value) (LCDC_WR_LSR(base, LCDC_RD_LSR(base) |  (value)))
#define LCDC_CLR_LSR(base, value) (LCDC_WR_LSR(base, LCDC_RD_LSR(base) & ~(value)))
#define LCDC_TOG_LSR(base, value) (LCDC_WR_LSR(base, LCDC_RD_LSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LSR bitfields
 */

/*!
 * @name Register LCDC_LSR, field YMAX[9:0] (RW)
 *
 * Specifies the height of LCD panel in terms of pixels or lines. Lines are
 * numbered from 1 to YMAX for a total of YMAX lines.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LSR_YMAX field. */
#define LCDC_RD_LSR_YMAX(base) ((LCDC_LSR_REG(base) & LCDC_LSR_YMAX_MASK) >> LCDC_LSR_YMAX_SHIFT)
#define LCDC_BRD_LSR_YMAX(base) (LCDC_RD_LSR_YMAX(base))

/*! @brief Set the YMAX field to a new value. */
#define LCDC_WR_LSR_YMAX(base, value) (LCDC_RMW_LSR(base, LCDC_LSR_YMAX_MASK, LCDC_LSR_YMAX(value)))
#define LCDC_BWR_LSR_YMAX(base, value) (LCDC_WR_LSR_YMAX(base, value))
/*@}*/

/*!
 * @name Register LCDC_LSR, field XMAX[26:20] (RW)
 *
 * Holds screen x-axis size, divided by 16. For black-and-white panels (1 bpp),
 * XMAX[20] is ignored, forcing the x-axis of the screen size to be a multiple of
 * 32 pixels/line.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LSR_XMAX field. */
#define LCDC_RD_LSR_XMAX(base) ((LCDC_LSR_REG(base) & LCDC_LSR_XMAX_MASK) >> LCDC_LSR_XMAX_SHIFT)
#define LCDC_BRD_LSR_XMAX(base) (LCDC_RD_LSR_XMAX(base))

/*! @brief Set the XMAX field to a new value. */
#define LCDC_WR_LSR_XMAX(base, value) (LCDC_RMW_LSR(base, LCDC_LSR_XMAX_MASK, LCDC_LSR_XMAX(value)))
#define LCDC_BWR_LSR_XMAX(base, value) (LCDC_WR_LSR_XMAX(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LVPWR - LCDC virtual page width register
 ******************************************************************************/

/*!
 * @brief LCDC_LVPWR - LCDC virtual page width register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines virtual page width for LCD panel. Refer to LCD screen
 * format for more details.
 */
/*!
 * @name Constants and macros for entire LCDC_LVPWR register
 */
/*@{*/
#define LCDC_RD_LVPWR(base)      (LCDC_LVPWR_REG(base))
#define LCDC_WR_LVPWR(base, value) (LCDC_LVPWR_REG(base) = (value))
#define LCDC_RMW_LVPWR(base, mask, value) (LCDC_WR_LVPWR(base, (LCDC_RD_LVPWR(base) & ~(mask)) | (value)))
#define LCDC_SET_LVPWR(base, value) (LCDC_WR_LVPWR(base, LCDC_RD_LVPWR(base) |  (value)))
#define LCDC_CLR_LVPWR(base, value) (LCDC_WR_LVPWR(base, LCDC_RD_LVPWR(base) & ~(value)))
#define LCDC_TOG_LVPWR(base, value) (LCDC_WR_LVPWR(base, LCDC_RD_LVPWR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LVPWR bitfields
 */

/*!
 * @name Register LCDC_LVPWR, field VPW[10:0] (RW)
 *
 * Defines virtual page width of LCD panel. VPW bits represent the number of
 * 32-bit words required to hold the data for one virtual line. VPW is used in
 * calculating the starting address representing the beginning of each displayed line.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LVPWR_VPW field. */
#define LCDC_RD_LVPWR_VPW(base) ((LCDC_LVPWR_REG(base) & LCDC_LVPWR_VPW_MASK) >> LCDC_LVPWR_VPW_SHIFT)
#define LCDC_BRD_LVPWR_VPW(base) (LCDC_RD_LVPWR_VPW(base))

/*! @brief Set the VPW field to a new value. */
#define LCDC_WR_LVPWR_VPW(base, value) (LCDC_RMW_LVPWR(base, LCDC_LVPWR_VPW_MASK, LCDC_LVPWR_VPW(value)))
#define LCDC_BWR_LVPWR_VPW(base, value) (LCDC_WR_LVPWR_VPW(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LCPR - LCDC cursor position register
 ******************************************************************************/

/*!
 * @brief LCDC_LCPR - LCDC cursor position register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register determines the starting position of the cursor on the LCD panel.
 */
/*!
 * @name Constants and macros for entire LCDC_LCPR register
 */
/*@{*/
#define LCDC_RD_LCPR(base)       (LCDC_LCPR_REG(base))
#define LCDC_WR_LCPR(base, value) (LCDC_LCPR_REG(base) = (value))
#define LCDC_RMW_LCPR(base, mask, value) (LCDC_WR_LCPR(base, (LCDC_RD_LCPR(base) & ~(mask)) | (value)))
#define LCDC_SET_LCPR(base, value) (LCDC_WR_LCPR(base, LCDC_RD_LCPR(base) |  (value)))
#define LCDC_CLR_LCPR(base, value) (LCDC_WR_LCPR(base, LCDC_RD_LCPR(base) & ~(value)))
#define LCDC_TOG_LCPR(base, value) (LCDC_WR_LCPR(base, LCDC_RD_LCPR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LCPR bitfields
 */

/*!
 * @name Register LCDC_LCPR, field CYP[9:0] (RW)
 *
 * Represents the cursor's vertical starting position Y in pixel count (from 0
 * to YMAX).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCPR_CYP field. */
#define LCDC_RD_LCPR_CYP(base) ((LCDC_LCPR_REG(base) & LCDC_LCPR_CYP_MASK) >> LCDC_LCPR_CYP_SHIFT)
#define LCDC_BRD_LCPR_CYP(base) (LCDC_RD_LCPR_CYP(base))

/*! @brief Set the CYP field to a new value. */
#define LCDC_WR_LCPR_CYP(base, value) (LCDC_RMW_LCPR(base, LCDC_LCPR_CYP_MASK, LCDC_LCPR_CYP(value)))
#define LCDC_BWR_LCPR_CYP(base, value) (LCDC_WR_LCPR_CYP(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCPR, field CXP[25:16] (RW)
 *
 * Represents the cursor's horizontal starting position X in pixel count (from 0
 * to XMAX).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCPR_CXP field. */
#define LCDC_RD_LCPR_CXP(base) ((LCDC_LCPR_REG(base) & LCDC_LCPR_CXP_MASK) >> LCDC_LCPR_CXP_SHIFT)
#define LCDC_BRD_LCPR_CXP(base) (LCDC_RD_LCPR_CXP(base))

/*! @brief Set the CXP field to a new value. */
#define LCDC_WR_LCPR_CXP(base, value) (LCDC_RMW_LCPR(base, LCDC_LCPR_CXP_MASK, LCDC_LCPR_CXP(value)))
#define LCDC_BWR_LCPR_CXP(base, value) (LCDC_WR_LCPR_CXP(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCPR, field OP[28] (RW)
 *
 * Enables/disables arithmetic operations between the background and cursor.
 *
 * Values:
 * - 0 - Disable arithmetic operation
 * - 1 - Enable arithmetic operation
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCPR_OP field. */
#define LCDC_RD_LCPR_OP(base) ((LCDC_LCPR_REG(base) & LCDC_LCPR_OP_MASK) >> LCDC_LCPR_OP_SHIFT)
#define LCDC_BRD_LCPR_OP(base) (BITBAND_ACCESS32(&LCDC_LCPR_REG(base), LCDC_LCPR_OP_SHIFT))

/*! @brief Set the OP field to a new value. */
#define LCDC_WR_LCPR_OP(base, value) (LCDC_RMW_LCPR(base, LCDC_LCPR_OP_MASK, LCDC_LCPR_OP(value)))
#define LCDC_BWR_LCPR_OP(base, value) (BITBAND_ACCESS32(&LCDC_LCPR_REG(base), LCDC_LCPR_OP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LCPR, field CC[31:30] (RW)
 *
 * Controls the arithmetic operations used to generate the cursor color. OP = 0
 * OP = 1, for color mode only 00 Transparent, cursor is disabled. Transparent,
 * cursor is disabled. 01 1 for non-color displays; color defined in LCDC color
 * cursor mapping register (LCCMR) for color displays. Logic OR between LCD display
 * data and the cursor color in LCCMR. 10 Reversed, INV background for non-color
 * displays; INV color defined in LCDC color cursor mapping register (LCCMR) for
 * color displays. Logic XOR between LCD display data and the cursor color in
 * LCCMR. 11 0 for non-color displays; Logic AND between LCD display data and the
 * cursor color in LCCMR. Logic AND between LCD display data and the cursor color
 * in LCCMR.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCPR_CC field. */
#define LCDC_RD_LCPR_CC(base) ((LCDC_LCPR_REG(base) & LCDC_LCPR_CC_MASK) >> LCDC_LCPR_CC_SHIFT)
#define LCDC_BRD_LCPR_CC(base) (LCDC_RD_LCPR_CC(base))

