pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the CC field to a new value. */
#define LCDC_WR_LCPR_CC(base, value) (LCDC_RMW_LCPR(base, LCDC_LCPR_CC_MASK, LCDC_LCPR_CC(value)))
#define LCDC_BWR_LCPR_CC(base, value) (LCDC_WR_LCPR_CC(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LCWHB - LCDC cursor width, height, and blink register
 ******************************************************************************/

/*!
 * @brief LCDC_LCWHB - LCDC cursor width, height, and blink register (RW)
 *
 * Reset value: 0x010100FFU
 *
 * This register determines the cursor's width and height, and how it blinks.
 */
/*!
 * @name Constants and macros for entire LCDC_LCWHB register
 */
/*@{*/
#define LCDC_RD_LCWHB(base)      (LCDC_LCWHB_REG(base))
#define LCDC_WR_LCWHB(base, value) (LCDC_LCWHB_REG(base) = (value))
#define LCDC_RMW_LCWHB(base, mask, value) (LCDC_WR_LCWHB(base, (LCDC_RD_LCWHB(base) & ~(mask)) | (value)))
#define LCDC_SET_LCWHB(base, value) (LCDC_WR_LCWHB(base, LCDC_RD_LCWHB(base) |  (value)))
#define LCDC_CLR_LCWHB(base, value) (LCDC_WR_LCWHB(base, LCDC_RD_LCWHB(base) & ~(value)))
#define LCDC_TOG_LCWHB(base, value) (LCDC_WR_LCWHB(base, LCDC_RD_LCWHB(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LCWHB bitfields
 */

/*!
 * @name Register LCDC_LCWHB, field BD[7:0] (RW)
 *
 * Sets the cursor blink rate. The ERCLK32K clock from the RTC is divided down
 * to provide a 32 Hz clock that is used to clock the 8-bit up counter. When the
 * counter value equals BD, the cursor toggles on/off. Hence larger the BD, slower
 * the cursor will blink. The fastest blinking is disabled when BD is 0.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCWHB_BD field. */
#define LCDC_RD_LCWHB_BD(base) ((LCDC_LCWHB_REG(base) & LCDC_LCWHB_BD_MASK) >> LCDC_LCWHB_BD_SHIFT)
#define LCDC_BRD_LCWHB_BD(base) (LCDC_RD_LCWHB_BD(base))

/*! @brief Set the BD field to a new value. */
#define LCDC_WR_LCWHB_BD(base, value) (LCDC_RMW_LCWHB(base, LCDC_LCWHB_BD_MASK, LCDC_LCWHB_BD(value)))
#define LCDC_BWR_LCWHB_BD(base, value) (LCDC_WR_LCWHB_BD(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCWHB, field CH[20:16] (RW)
 *
 * Specifies the height of hardware cursor in pixels. This field can be any
 * value between 1 and 31 (setting this field to zero disables the cursor).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCWHB_CH field. */
#define LCDC_RD_LCWHB_CH(base) ((LCDC_LCWHB_REG(base) & LCDC_LCWHB_CH_MASK) >> LCDC_LCWHB_CH_SHIFT)
#define LCDC_BRD_LCWHB_CH(base) (LCDC_RD_LCWHB_CH(base))

/*! @brief Set the CH field to a new value. */
#define LCDC_WR_LCWHB_CH(base, value) (LCDC_RMW_LCWHB(base, LCDC_LCWHB_CH_MASK, LCDC_LCWHB_CH(value)))
#define LCDC_BWR_LCWHB_CH(base, value) (LCDC_WR_LCWHB_CH(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCWHB, field CW[28:24] (RW)
 *
 * Specifies the width of hardware cursor in pixels. This field can be any value
 * between 1 and 31 (setting this field to zero disables the cursor).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCWHB_CW field. */
#define LCDC_RD_LCWHB_CW(base) ((LCDC_LCWHB_REG(base) & LCDC_LCWHB_CW_MASK) >> LCDC_LCWHB_CW_SHIFT)
#define LCDC_BRD_LCWHB_CW(base) (LCDC_RD_LCWHB_CW(base))

/*! @brief Set the CW field to a new value. */
#define LCDC_WR_LCWHB_CW(base, value) (LCDC_RMW_LCWHB(base, LCDC_LCWHB_CW_MASK, LCDC_LCWHB_CW(value)))
#define LCDC_BWR_LCWHB_CW(base, value) (LCDC_WR_LCWHB_CW(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCWHB, field BK_EN[31] (RW)
 *
 * Determines whether the blink enable cursor will blink or remain steady.
 *
 * Values:
 * - 0 - Blink is disabled.
 * - 1 - Blink is enabled.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCWHB_BK_EN field. */
#define LCDC_RD_LCWHB_BK_EN(base) ((LCDC_LCWHB_REG(base) & LCDC_LCWHB_BK_EN_MASK) >> LCDC_LCWHB_BK_EN_SHIFT)
#define LCDC_BRD_LCWHB_BK_EN(base) (BITBAND_ACCESS32(&LCDC_LCWHB_REG(base), LCDC_LCWHB_BK_EN_SHIFT))

/*! @brief Set the BK_EN field to a new value. */
#define LCDC_WR_LCWHB_BK_EN(base, value) (LCDC_RMW_LCWHB(base, LCDC_LCWHB_BK_EN_MASK, LCDC_LCWHB_BK_EN(value)))
#define LCDC_BWR_LCWHB_BK_EN(base, value) (BITBAND_ACCESS32(&LCDC_LCWHB_REG(base), LCDC_LCWHB_BK_EN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LCCMR - LCDC color cursor mapping register
 ******************************************************************************/

/*!
 * @brief LCDC_LCCMR - LCDC color cursor mapping register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the cursor color in passive or TFT color modes. If bpp
 * mode setting is smaller than 18bpp, cursor color component bits should be put
 * in the MSBs. For example, if color cursor of RGB=(0x1a, 0x26, 0x05) is wanted
 * when using 16bpp, CUR_COL_R, CUR_COL_G and CUR_COL_B should be set to 0x34,
 * 0x26 and 0x0a.
 */
/*!
 * @name Constants and macros for entire LCDC_LCCMR register
 */
/*@{*/
#define LCDC_RD_LCCMR(base)      (LCDC_LCCMR_REG(base))
#define LCDC_WR_LCCMR(base, value) (LCDC_LCCMR_REG(base) = (value))
#define LCDC_RMW_LCCMR(base, mask, value) (LCDC_WR_LCCMR(base, (LCDC_RD_LCCMR(base) & ~(mask)) | (value)))
#define LCDC_SET_LCCMR(base, value) (LCDC_WR_LCCMR(base, LCDC_RD_LCCMR(base) |  (value)))
#define LCDC_CLR_LCCMR(base, value) (LCDC_WR_LCCMR(base, LCDC_RD_LCCMR(base) & ~(value)))
#define LCDC_TOG_LCCMR(base, value) (LCDC_WR_LCCMR(base, LCDC_RD_LCCMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LCCMR bitfields
 */

/*!
 * @name Register LCDC_LCCMR, field CUR_COL_B[5:0] (RW)
 *
 * Defines the blue component of the cursor color in color mode.
 *
 * Values:
 * - 000000 - No blue
 * - 111111 - Full blue
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCCMR_CUR_COL_B field. */
#define LCDC_RD_LCCMR_CUR_COL_B(base) ((LCDC_LCCMR_REG(base) & LCDC_LCCMR_CUR_COL_B_MASK) >> LCDC_LCCMR_CUR_COL_B_SHIFT)
#define LCDC_BRD_LCCMR_CUR_COL_B(base) (LCDC_RD_LCCMR_CUR_COL_B(base))

/*! @brief Set the CUR_COL_B field to a new value. */
#define LCDC_WR_LCCMR_CUR_COL_B(base, value) (LCDC_RMW_LCCMR(base, LCDC_LCCMR_CUR_COL_B_MASK, LCDC_LCCMR_CUR_COL_B(value)))
#define LCDC_BWR_LCCMR_CUR_COL_B(base, value) (LCDC_WR_LCCMR_CUR_COL_B(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCCMR, field CUR_COL_G[11:6] (RW)
 *
 * Defines the green component of the cursor color in color mode.
 *
 * Values:
 * - 000000 - No green
 * - 111111 - Full green
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCCMR_CUR_COL_G field. */
#define LCDC_RD_LCCMR_CUR_COL_G(base) ((LCDC_LCCMR_REG(base) & LCDC_LCCMR_CUR_COL_G_MASK) >> LCDC_LCCMR_CUR_COL_G_SHIFT)
#define LCDC_BRD_LCCMR_CUR_COL_G(base) (LCDC_RD_LCCMR_CUR_COL_G(base))

