pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the CUR_COL_G field to a new value. */
#define LCDC_WR_LCCMR_CUR_COL_G(base, value) (LCDC_RMW_LCCMR(base, LCDC_LCCMR_CUR_COL_G_MASK, LCDC_LCCMR_CUR_COL_G(value)))
#define LCDC_BWR_LCCMR_CUR_COL_G(base, value) (LCDC_WR_LCCMR_CUR_COL_G(base, value))
/*@}*/

/*!
 * @name Register LCDC_LCCMR, field CUR_COL_R[17:12] (RW)
 *
 * Defines the red component of the cursor color in color mode.
 *
 * Values:
 * - 000000 - No red
 * - 111111 - Full red
 */
/*@{*/
/*! @brief Read current value of the LCDC_LCCMR_CUR_COL_R field. */
#define LCDC_RD_LCCMR_CUR_COL_R(base) ((LCDC_LCCMR_REG(base) & LCDC_LCCMR_CUR_COL_R_MASK) >> LCDC_LCCMR_CUR_COL_R_SHIFT)
#define LCDC_BRD_LCCMR_CUR_COL_R(base) (LCDC_RD_LCCMR_CUR_COL_R(base))

/*! @brief Set the CUR_COL_R field to a new value. */
#define LCDC_WR_LCCMR_CUR_COL_R(base, value) (LCDC_RMW_LCCMR(base, LCDC_LCCMR_CUR_COL_R_MASK, LCDC_LCCMR_CUR_COL_R(value)))
#define LCDC_BWR_LCCMR_CUR_COL_R(base, value) (LCDC_WR_LCCMR_CUR_COL_R(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LPCR - LCDC panel configuration register
 ******************************************************************************/

/*!
 * @brief LCDC_LPCR - LCDC panel configuration register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines all properties of the LCD screen.
 */
/*!
 * @name Constants and macros for entire LCDC_LPCR register
 */
/*@{*/
#define LCDC_RD_LPCR(base)       (LCDC_LPCR_REG(base))
#define LCDC_WR_LPCR(base, value) (LCDC_LPCR_REG(base) = (value))
#define LCDC_RMW_LPCR(base, mask, value) (LCDC_WR_LPCR(base, (LCDC_RD_LPCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LPCR(base, value) (LCDC_WR_LPCR(base, LCDC_RD_LPCR(base) |  (value)))
#define LCDC_CLR_LPCR(base, value) (LCDC_WR_LPCR(base, LCDC_RD_LPCR(base) & ~(value)))
#define LCDC_TOG_LPCR(base, value) (LCDC_WR_LPCR(base, LCDC_RD_LPCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LPCR bitfields
 */

/*!
 * @name Register LCDC_LPCR, field PCD[5:0] (RW)
 *
 * Holds clock divider value. The bus clock is divided by N (PCD plus one) to
 * yield the pixel clock rate. Values of 1 to 63 yield N=2 to 64. Pixel clock rate
 * is faster than LSCLK by a factor equal to the data bus width for monochrome
 * display. For all other displays, pixel clock rate is the same as LSCLK. PCD
 * value must be set such that LSCLK frequency is no more than one third or one
 * fourth of system clock frequency in TFT and CSTN modes respectively, otherwise LD
 * will be incorrect.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_PCD field. */
#define LCDC_RD_LPCR_PCD(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_PCD_MASK) >> LCDC_LPCR_PCD_SHIFT)
#define LCDC_BRD_LPCR_PCD(base) (LCDC_RD_LPCR_PCD(base))

/*! @brief Set the PCD field to a new value. */
#define LCDC_WR_LPCR_PCD(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_PCD_MASK, LCDC_LPCR_PCD(value)))
#define LCDC_BWR_LPCR_PCD(base, value) (LCDC_WR_LPCR_PCD(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field SCLKSEL[7] (RW)
 *
 * Selects whether to enable or disable LSCLK in TFT mode when there is no data
 * output.
 *
 * Values:
 * - 0 - Disable OE and LSCLK in TFT mode when no data output.
 * - 1 - Always enable LSCLK in TFT mode even if there is no data output.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_SCLKSEL field. */
#define LCDC_RD_LPCR_SCLKSEL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_SCLKSEL_MASK) >> LCDC_LPCR_SCLKSEL_SHIFT)
#define LCDC_BRD_LPCR_SCLKSEL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SCLKSEL_SHIFT))

/*! @brief Set the SCLKSEL field to a new value. */
#define LCDC_WR_LPCR_SCLKSEL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_SCLKSEL_MASK, LCDC_LPCR_SCLKSEL(value)))
#define LCDC_BWR_LPCR_SCLKSEL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SCLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field ACD[14:8] (RW)
 *
 * Toggles ACD signal once every 1-16 ACD clock source cycles based on the value
 * specified in this field. The actual number of ACD clock source cycles between
 * toggles is the programmed value plus one. For active mode (TFT=1), this
 * parameter is not used.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_ACD field. */
#define LCDC_RD_LPCR_ACD(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_ACD_MASK) >> LCDC_LPCR_ACD_SHIFT)
#define LCDC_BRD_LPCR_ACD(base) (LCDC_RD_LPCR_ACD(base))

/*! @brief Set the ACD field to a new value. */
#define LCDC_WR_LPCR_ACD(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_ACD_MASK, LCDC_LPCR_ACD(value)))
#define LCDC_BWR_LPCR_ACD(base, value) (LCDC_WR_LPCR_ACD(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field ACDSEL[15] (RW)
 *
 * Selects the clock source used by alternative crystal direction counter.
 *
 * Values:
 * - 0 - Use FLM as a clock source for ACD count.
 * - 1 - Use LP/HSYNC as a clock source for ACD count.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_ACDSEL field. */
#define LCDC_RD_LPCR_ACDSEL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_ACDSEL_MASK) >> LCDC_LPCR_ACDSEL_SHIFT)
#define LCDC_BRD_LPCR_ACDSEL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_ACDSEL_SHIFT))

/*! @brief Set the ACDSEL field to a new value. */
#define LCDC_WR_LPCR_ACDSEL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_ACDSEL_MASK, LCDC_LPCR_ACDSEL(value)))
#define LCDC_BWR_LPCR_ACDSEL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_ACDSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field REV_VS[16] (RW)
 *
 * Selects the vertical scan direction as normal or reverse image flips along
 * the x-axis. The LSSAR register should be changed accordingly if this bit is set
 * so that it points to the end of the image.
 *
 * Values:
 * - 0 - Vertical scan in normal direction.
 * - 1 - Vertical scan in reverse direction.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_REV_VS field. */
#define LCDC_RD_LPCR_REV_VS(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_REV_VS_MASK) >> LCDC_LPCR_REV_VS_SHIFT)
#define LCDC_BRD_LPCR_REV_VS(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_REV_VS_SHIFT))

/*! @brief Set the REV_VS field to a new value. */
#define LCDC_WR_LPCR_REV_VS(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_REV_VS_MASK, LCDC_LPCR_REV_VS(value)))
#define LCDC_BWR_LPCR_REV_VS(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_REV_VS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field SWAP_SEL[17] (RW)
 *
 * LCDC operates in big endian mode internally. This bit controls the swap of
 * data before operation in little endian mode when END_SEL=0. When END_SEL=1, this
 * bit has no affect. When SWAP_SEL = 0, byte 3 (bits 31-24), byte 2 (bits
 * 23-16), byte 1 (bits 15-8), and byte 0 (bits 7-0) data swapped to byte 1, byte 0,
 * byte 3, and byte 2 respectively. When SWAP_SEL = 1 and in 24, 18, 16, or 12 bpp
 * mode, byte 2 and byte 0 are swapped so that the output is BGR instead of RGB.
 * When SWAP_SEL = 1 and in 8, 4, 2, or 1bpp mode, byte 3, byte 2, byte 1, and
 * byte 0 data swapped to byte 0, byte 1, byte 2, and byte 3 respectively.
 *
 * Values:
 * - 0 - 24 bpp, 18 bpp, 16 bpp, 12 bpp mode.
 * - 1 - 8 bpp, 4 bpp, 2 bpp, and 1 bpp mode.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_SWAP_SEL field. */
#define LCDC_RD_LPCR_SWAP_SEL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_SWAP_SEL_MASK) >> LCDC_LPCR_SWAP_SEL_SHIFT)
#define LCDC_BRD_LPCR_SWAP_SEL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SWAP_SEL_SHIFT))

/*! @brief Set the SWAP_SEL field to a new value. */
#define LCDC_WR_LPCR_SWAP_SEL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_SWAP_SEL_MASK, LCDC_LPCR_SWAP_SEL(value)))
#define LCDC_BWR_LPCR_SWAP_SEL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SWAP_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field END_SEL[18] (RW)
 *
 * Selects the image download into memory as big or little endian format.
 *
 * Values:
 * - 0 - Little Endian
 * - 1 - Big Endian
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_END_SEL field. */
#define LCDC_RD_LPCR_END_SEL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_END_SEL_MASK) >> LCDC_LPCR_END_SEL_SHIFT)
#define LCDC_BRD_LPCR_END_SEL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_END_SEL_SHIFT))

/*! @brief Set the END_SEL field to a new value. */
#define LCDC_WR_LPCR_END_SEL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_END_SEL_MASK, LCDC_LPCR_END_SEL(value)))
#define LCDC_BWR_LPCR_END_SEL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_END_SEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field SCLKIDLE[19] (RW)
 *
 * Enables/disables LSCLK when VSYNC is idle in TFT mode.
 *
 * Values:
 * - 0 - Disable LSCLK
 * - 1 - Enable LSCLK
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_SCLKIDLE field. */
#define LCDC_RD_LPCR_SCLKIDLE(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_SCLKIDLE_MASK) >> LCDC_LPCR_SCLKIDLE_SHIFT)
#define LCDC_BRD_LPCR_SCLKIDLE(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SCLKIDLE_SHIFT))

