pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the SCLKIDLE field to a new value. */
#define LCDC_WR_LPCR_SCLKIDLE(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_SCLKIDLE_MASK, LCDC_LPCR_SCLKIDLE(value)))
#define LCDC_BWR_LPCR_SCLKIDLE(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_SCLKIDLE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field OEPOL[20] (RW)
 *
 * Sets the output enable signal polarity.
 *
 * Values:
 * - 0 - Active high
 * - 1 - Active low
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_OEPOL field. */
#define LCDC_RD_LPCR_OEPOL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_OEPOL_MASK) >> LCDC_LPCR_OEPOL_SHIFT)
#define LCDC_BRD_LPCR_OEPOL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_OEPOL_SHIFT))

/*! @brief Set the OEPOL field to a new value. */
#define LCDC_WR_LPCR_OEPOL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_OEPOL_MASK, LCDC_LPCR_OEPOL(value)))
#define LCDC_BWR_LPCR_OEPOL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_OEPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field CLKPOL[21] (RW)
 *
 * Sets the polarity of active edge of LCD shift clock.
 *
 * Values:
 * - 0 - Active on negative edge of LSCLK. In TFT mode, active on positive edge
 *     of LSCLK.
 * - 1 - Active on positive edge of LSCLK. In TFT mode, active on negative edge
 *     of LSCLK.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_CLKPOL field. */
#define LCDC_RD_LPCR_CLKPOL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_CLKPOL_MASK) >> LCDC_LPCR_CLKPOL_SHIFT)
#define LCDC_BRD_LPCR_CLKPOL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_CLKPOL_SHIFT))

/*! @brief Set the CLKPOL field to a new value. */
#define LCDC_WR_LPCR_CLKPOL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_CLKPOL_MASK, LCDC_LPCR_CLKPOL(value)))
#define LCDC_BWR_LPCR_CLKPOL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_CLKPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field LPPOL[22] (RW)
 *
 * Sets the polarity of line pulse signal (LP/HSYNC).
 *
 * Values:
 * - 0 - Active high
 * - 1 - Active low
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_LPPOL field. */
#define LCDC_RD_LPCR_LPPOL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_LPPOL_MASK) >> LCDC_LPCR_LPPOL_SHIFT)
#define LCDC_BRD_LPCR_LPPOL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_LPPOL_SHIFT))

/*! @brief Set the LPPOL field to a new value. */
#define LCDC_WR_LPCR_LPPOL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_LPPOL_MASK, LCDC_LPCR_LPPOL(value)))
#define LCDC_BWR_LPCR_LPPOL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_LPPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field FLMPOL[23] (RW)
 *
 * Sets the polarity of first line marker signal (FLM/VSYNC).
 *
 * Values:
 * - 0 - Active high
 * - 1 - Active low
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_FLMPOL field. */
#define LCDC_RD_LPCR_FLMPOL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_FLMPOL_MASK) >> LCDC_LPCR_FLMPOL_SHIFT)
#define LCDC_BRD_LPCR_FLMPOL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_FLMPOL_SHIFT))

/*! @brief Set the FLMPOL field to a new value. */
#define LCDC_WR_LPCR_FLMPOL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_FLMPOL_MASK, LCDC_LPCR_FLMPOL(value)))
#define LCDC_BWR_LPCR_FLMPOL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_FLMPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field PIXPOL[24] (RW)
 *
 * Sets the pixels polarity.
 *
 * Values:
 * - 0 - Active high
 * - 1 - Active low
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_PIXPOL field. */
#define LCDC_RD_LPCR_PIXPOL(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_PIXPOL_MASK) >> LCDC_LPCR_PIXPOL_SHIFT)
#define LCDC_BRD_LPCR_PIXPOL(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_PIXPOL_SHIFT))

/*! @brief Set the PIXPOL field to a new value. */
#define LCDC_WR_LPCR_PIXPOL(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_PIXPOL_MASK, LCDC_LPCR_PIXPOL(value)))
#define LCDC_BWR_LPCR_PIXPOL(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_PIXPOL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field BPIX[27:25] (RW)
 *
 * Indicates the number of bits per pixel in memory. To set normal 18 bpp mode:
 * BPIX = 110, END_SEL = 1, and SWAP_SEL = X (don't care). To set Microsoft
 * PAL_BGR 18 bpp mode: BPIX = 110, END_SEL = 0, and SWAP_SEL = 1. See Display Data
 * Mapping for more information.
 *
 * Values:
 * - 000 - 1 bpp, FRC bypassed
 * - 001 - 2 bpp
 * - 010 - 4 bpp
 * - 011 - 8 bpp
 * - 100 - 12 bpp (16-bits of memory used)
 * - 101 - 16 bpp
 * - 110 - 18 bpp (32-bits of memory used)
 * - 111 - 24 bpp (32-bits of memory used)
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_BPIX field. */
#define LCDC_RD_LPCR_BPIX(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_BPIX_MASK) >> LCDC_LPCR_BPIX_SHIFT)
#define LCDC_BRD_LPCR_BPIX(base) (LCDC_RD_LPCR_BPIX(base))

/*! @brief Set the BPIX field to a new value. */
#define LCDC_WR_LPCR_BPIX(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_BPIX_MASK, LCDC_LPCR_BPIX(value)))
#define LCDC_BWR_LPCR_BPIX(base, value) (LCDC_WR_LPCR_BPIX(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field PBSIZ[29:28] (RW)
 *
 * Specifies the panel bus width. Applicable for monochrome monitors. For
 * passive color panels, only 8-bit panel bus width is supported. For active mode,
 * these bits are not applicable. See for TFT data line assignments.
 *
 * Values:
 * - 000 - 1-bit
 * - 001 - 2-bit
 * - 010 - 4-bit
 * - 011 - 8-bit
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_PBSIZ field. */
#define LCDC_RD_LPCR_PBSIZ(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_PBSIZ_MASK) >> LCDC_LPCR_PBSIZ_SHIFT)
#define LCDC_BRD_LPCR_PBSIZ(base) (LCDC_RD_LPCR_PBSIZ(base))

/*! @brief Set the PBSIZ field to a new value. */
#define LCDC_WR_LPCR_PBSIZ(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_PBSIZ_MASK, LCDC_LPCR_PBSIZ(value)))
#define LCDC_BWR_LPCR_PBSIZ(base, value) (LCDC_WR_LPCR_PBSIZ(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field COLOR[30] (RW)
 *
 * In passive mode, this bit activates 3 channels of FRC to allow the use of
 * special 2 2/3 pixels per output vector format. Please refer to #3456 for
 * TFT/COLOR setting usage.
 *
 * Values:
 * - 0 - LCD panel is a Monochrome display.
 * - 1 - LCD panel is a Color display.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_COLOR field. */
#define LCDC_RD_LPCR_COLOR(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_COLOR_MASK) >> LCDC_LPCR_COLOR_SHIFT)
#define LCDC_BRD_LPCR_COLOR(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_COLOR_SHIFT))

/*! @brief Set the COLOR field to a new value. */
#define LCDC_WR_LPCR_COLOR(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_COLOR_MASK, LCDC_LPCR_COLOR(value)))
#define LCDC_BWR_LPCR_COLOR(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_COLOR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCR, field TFT[31] (RW)
 *
 * Controls the format and timing of output control signals. Active and passive
 * displays use different signal timing formats as described in Panel Interface
 * Signals and Timing . TFT also controls the use of FRC in color mode. The
 * following table shows the TFT/COLOR setting usage. TFT/COLOR settings TFT Color LCD
 * display 0 0 Monochrome 0 1 CSTN 1 0 ̶ 1 1 TFT
 *
 * Values:
 * - 0 - LCD panel is a passive display.
 * - 1 - LCD panel is an active display: "digital CRT" signal format, FRC is
 *     bypassed.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCR_TFT field. */
#define LCDC_RD_LPCR_TFT(base) ((LCDC_LPCR_REG(base) & LCDC_LPCR_TFT_MASK) >> LCDC_LPCR_TFT_SHIFT)
#define LCDC_BRD_LPCR_TFT(base) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_TFT_SHIFT))

