pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TFT field to a new value. */
#define LCDC_WR_LPCR_TFT(base, value) (LCDC_RMW_LPCR(base, LCDC_LPCR_TFT_MASK, LCDC_LPCR_TFT(value)))
#define LCDC_BWR_LPCR_TFT(base, value) (BITBAND_ACCESS32(&LCDC_LPCR_REG(base), LCDC_LPCR_TFT_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LHCR - LCDC horizontal configuration register
 ******************************************************************************/

/*!
 * @brief LCDC_LHCR - LCDC horizontal configuration register (RW)
 *
 * Reset value: 0x04000000U
 *
 * This register defines the horizontal sync pulse timing. To determine the
 * proper settings, please refer to the panel's data sheet.
 */
/*!
 * @name Constants and macros for entire LCDC_LHCR register
 */
/*@{*/
#define LCDC_RD_LHCR(base)       (LCDC_LHCR_REG(base))
#define LCDC_WR_LHCR(base, value) (LCDC_LHCR_REG(base) = (value))
#define LCDC_RMW_LHCR(base, mask, value) (LCDC_WR_LHCR(base, (LCDC_RD_LHCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LHCR(base, value) (LCDC_WR_LHCR(base, LCDC_RD_LHCR(base) |  (value)))
#define LCDC_CLR_LHCR(base, value) (LCDC_WR_LHCR(base, LCDC_RD_LHCR(base) & ~(value)))
#define LCDC_TOG_LHCR(base, value) (LCDC_WR_LHCR(base, LCDC_RD_LHCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LHCR bitfields
 */

/*!
 * @name Register LCDC_LHCR, field H_WAIT_2[7:0] (RW)
 *
 * In TFT mode, it specifies the number of SCLK periods between the end of HSYNC
 * and the beginning of OE signal. Total delay time equals (H_WAIT_2 + 3). In
 * CSTN mode, it specifies the number of SCLK periods between the end of the LP
 * signal and the first display data in each line. Total delay time equals (H_WAIT_2
 * + 2) of SCLK periods.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LHCR_H_WAIT_2 field. */
#define LCDC_RD_LHCR_H_WAIT_2(base) ((LCDC_LHCR_REG(base) & LCDC_LHCR_H_WAIT_2_MASK) >> LCDC_LHCR_H_WAIT_2_SHIFT)
#define LCDC_BRD_LHCR_H_WAIT_2(base) (LCDC_RD_LHCR_H_WAIT_2(base))

/*! @brief Set the H_WAIT_2 field to a new value. */
#define LCDC_WR_LHCR_H_WAIT_2(base, value) (LCDC_RMW_LHCR(base, LCDC_LHCR_H_WAIT_2_MASK, LCDC_LHCR_H_WAIT_2(value)))
#define LCDC_BWR_LHCR_H_WAIT_2(base, value) (LCDC_WR_LHCR_H_WAIT_2(base, value))
/*@}*/

/*!
 * @name Register LCDC_LHCR, field H_WAIT_1[15:8] (RW)
 *
 * In TFT mode, it specifies the number of SCLK periods between the end of OE
 * signal and the beginning of HSYNC. Total delay time equals (H_WAIT_1 + 1) of
 * SCLK periods. In CSTN mode, it specifies the number of SCLK periods between the
 * last display data and the beginning of the LP signal. Total delay time equals
 * (H_WAIT_1 + 1) of SCLK periods.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LHCR_H_WAIT_1 field. */
#define LCDC_RD_LHCR_H_WAIT_1(base) ((LCDC_LHCR_REG(base) & LCDC_LHCR_H_WAIT_1_MASK) >> LCDC_LHCR_H_WAIT_1_SHIFT)
#define LCDC_BRD_LHCR_H_WAIT_1(base) (LCDC_RD_LHCR_H_WAIT_1(base))

/*! @brief Set the H_WAIT_1 field to a new value. */
#define LCDC_WR_LHCR_H_WAIT_1(base, value) (LCDC_RMW_LHCR(base, LCDC_LHCR_H_WAIT_1_MASK, LCDC_LHCR_H_WAIT_1(value)))
#define LCDC_BWR_LHCR_H_WAIT_1(base, value) (LCDC_WR_LHCR_H_WAIT_1(base, value))
/*@}*/

/*!
 * @name Register LCDC_LHCR, field H_WIDTH[31:26] (RW)
 *
 * Specifies the number of SCLK periods for which HSYNC is activated. The active
 * time is equal to (H_WIDTH + 1) of the SCLK periods.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LHCR_H_WIDTH field. */
#define LCDC_RD_LHCR_H_WIDTH(base) ((LCDC_LHCR_REG(base) & LCDC_LHCR_H_WIDTH_MASK) >> LCDC_LHCR_H_WIDTH_SHIFT)
#define LCDC_BRD_LHCR_H_WIDTH(base) (LCDC_RD_LHCR_H_WIDTH(base))

/*! @brief Set the H_WIDTH field to a new value. */
#define LCDC_WR_LHCR_H_WIDTH(base, value) (LCDC_RMW_LHCR(base, LCDC_LHCR_H_WIDTH_MASK, LCDC_LHCR_H_WIDTH(value)))
#define LCDC_BWR_LHCR_H_WIDTH(base, value) (LCDC_WR_LHCR_H_WIDTH(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LVCR - LCDC vertical configuration register
 ******************************************************************************/

/*!
 * @brief LCDC_LVCR - LCDC vertical configuration register (RW)
 *
 * Reset value: 0x04000000U
 *
 * This register defines the vertical sync pulse timing. To determine the proper
 * settings, please refer to the panel's data sheet.
 */
/*!
 * @name Constants and macros for entire LCDC_LVCR register
 */
/*@{*/
#define LCDC_RD_LVCR(base)       (LCDC_LVCR_REG(base))
#define LCDC_WR_LVCR(base, value) (LCDC_LVCR_REG(base) = (value))
#define LCDC_RMW_LVCR(base, mask, value) (LCDC_WR_LVCR(base, (LCDC_RD_LVCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LVCR(base, value) (LCDC_WR_LVCR(base, LCDC_RD_LVCR(base) |  (value)))
#define LCDC_CLR_LVCR(base, value) (LCDC_WR_LVCR(base, LCDC_RD_LVCR(base) & ~(value)))
#define LCDC_TOG_LVCR(base, value) (LCDC_WR_LVCR(base, LCDC_RD_LVCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LVCR bitfields
 */

/*!
 * @name Register LCDC_LVCR, field V_WAIT_2[7:0] (RW)
 *
 * Defines the delay, in lines, between the end of VSYNC pulse and the beginning
 * of OE pulse of the first line in active mode (TFT=1). The actual delay is
 * (V_WAIT_2 ) lines. Set this field to zero for passive non-color mode. The minimum
 * value of this field is 0x01.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LVCR_V_WAIT_2 field. */
#define LCDC_RD_LVCR_V_WAIT_2(base) ((LCDC_LVCR_REG(base) & LCDC_LVCR_V_WAIT_2_MASK) >> LCDC_LVCR_V_WAIT_2_SHIFT)
#define LCDC_BRD_LVCR_V_WAIT_2(base) (LCDC_RD_LVCR_V_WAIT_2(base))

/*! @brief Set the V_WAIT_2 field to a new value. */
#define LCDC_WR_LVCR_V_WAIT_2(base, value) (LCDC_RMW_LVCR(base, LCDC_LVCR_V_WAIT_2_MASK, LCDC_LVCR_V_WAIT_2(value)))
#define LCDC_BWR_LVCR_V_WAIT_2(base, value) (LCDC_WR_LVCR_V_WAIT_2(base, value))
/*@}*/

/*!
 * @name Register LCDC_LVCR, field V_WAIT_1[15:8] (RW)
 *
 * Defines the delay, in lines, between the end of OE pulse and the beginning of
 * VSYNC pulse for active mode (TFT=1). The actual delay is (V_WAIT_1) lines. In
 * passive color mode, this field is the delay, measured in virtual clock
 * periods, between the last line of the frame to the beginning of next frame. This
 * field has no meaning in passive non-color mode.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LVCR_V_WAIT_1 field. */
#define LCDC_RD_LVCR_V_WAIT_1(base) ((LCDC_LVCR_REG(base) & LCDC_LVCR_V_WAIT_1_MASK) >> LCDC_LVCR_V_WAIT_1_SHIFT)
#define LCDC_BRD_LVCR_V_WAIT_1(base) (LCDC_RD_LVCR_V_WAIT_1(base))

