pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the V_WAIT_1 field to a new value. */
#define LCDC_WR_LVCR_V_WAIT_1(base, value) (LCDC_RMW_LVCR(base, LCDC_LVCR_V_WAIT_1_MASK, LCDC_LVCR_V_WAIT_1(value)))
#define LCDC_BWR_LVCR_V_WAIT_1(base, value) (LCDC_WR_LVCR_V_WAIT_1(base, value))
/*@}*/

/*!
 * @name Register LCDC_LVCR, field V_WIDTH[31:26] (RW)
 *
 * Specifies the width, in lines, of VSYNC pulse for active mode (TFT=1). For a
 * value of "000001", a vertical sync pulse encompasses one HSYNC pulse. For a
 * value of "000002", a vertical sync pulse encompasses two HSYNC pulses, and so
 * on. For passive mode (TFT=0) and non-color mode, see Horizontal Sync Pulse
 * Timing in Passive Mode diagram .
 */
/*@{*/
/*! @brief Read current value of the LCDC_LVCR_V_WIDTH field. */
#define LCDC_RD_LVCR_V_WIDTH(base) ((LCDC_LVCR_REG(base) & LCDC_LVCR_V_WIDTH_MASK) >> LCDC_LVCR_V_WIDTH_SHIFT)
#define LCDC_BRD_LVCR_V_WIDTH(base) (LCDC_RD_LVCR_V_WIDTH(base))

/*! @brief Set the V_WIDTH field to a new value. */
#define LCDC_WR_LVCR_V_WIDTH(base, value) (LCDC_RMW_LVCR(base, LCDC_LVCR_V_WIDTH_MASK, LCDC_LVCR_V_WIDTH(value)))
#define LCDC_BWR_LVCR_V_WIDTH(base, value) (LCDC_WR_LVCR_V_WIDTH(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LPOR - LCDC panning offset register
 ******************************************************************************/

/*!
 * @brief LCDC_LPOR - LCDC panning offset register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register sets up panning for the image.
 */
/*!
 * @name Constants and macros for entire LCDC_LPOR register
 */
/*@{*/
#define LCDC_RD_LPOR(base)       (LCDC_LPOR_REG(base))
#define LCDC_WR_LPOR(base, value) (LCDC_LPOR_REG(base) = (value))
#define LCDC_RMW_LPOR(base, mask, value) (LCDC_WR_LPOR(base, (LCDC_RD_LPOR(base) & ~(mask)) | (value)))
#define LCDC_SET_LPOR(base, value) (LCDC_WR_LPOR(base, LCDC_RD_LPOR(base) |  (value)))
#define LCDC_CLR_LPOR(base, value) (LCDC_WR_LPOR(base, LCDC_RD_LPOR(base) & ~(value)))
#define LCDC_TOG_LPOR(base, value) (LCDC_WR_LPOR(base, LCDC_RD_LPOR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LPOR bitfields
 */

/*!
 * @name Register LCDC_LPOR, field POS[4:0] (RW)
 *
 * Defines the number of bits that the data from memory is panned to the left
 * before processing. POS is read by the LCDC once at the beginning of each frame.
 * For example, in 4 bpp mode, setting POS = 4 shifts 16-bits, which means
 * panning the image by 4 pixels left. Shifting data more than 32 bits should use LSSAR
 * register setting. 18 and 24 bpp panning should use LSSAR register setting. To
 * achieve panning of the final image by N bits: Bits per pixel POS Effective #
 * of pixels panned on image 1 N N 2 2N N 4 4N N 8 8N N 12/16 16N N
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPOR_POS field. */
#define LCDC_RD_LPOR_POS(base) ((LCDC_LPOR_REG(base) & LCDC_LPOR_POS_MASK) >> LCDC_LPOR_POS_SHIFT)
#define LCDC_BRD_LPOR_POS(base) (LCDC_RD_LPOR_POS(base))

/*! @brief Set the POS field to a new value. */
#define LCDC_WR_LPOR_POS(base, value) (LCDC_RMW_LPOR(base, LCDC_LPOR_POS_MASK, LCDC_LPOR_POS(value)))
#define LCDC_BWR_LPOR_POS(base, value) (LCDC_WR_LPOR_POS(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LPCCR - LCDC PWM contrast control register
 ******************************************************************************/

/*!
 * @brief LCDC_LPCCR - LCDC PWM contrast control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the signal output at the contrast pin that controls
 * contrast of the LCD panel.
 */
/*!
 * @name Constants and macros for entire LCDC_LPCCR register
 */
/*@{*/
#define LCDC_RD_LPCCR(base)      (LCDC_LPCCR_REG(base))
#define LCDC_WR_LPCCR(base, value) (LCDC_LPCCR_REG(base) = (value))
#define LCDC_RMW_LPCCR(base, mask, value) (LCDC_WR_LPCCR(base, (LCDC_RD_LPCCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LPCCR(base, value) (LCDC_WR_LPCCR(base, LCDC_RD_LPCCR(base) |  (value)))
#define LCDC_CLR_LPCCR(base, value) (LCDC_WR_LPCCR(base, LCDC_RD_LPCCR(base) & ~(value)))
#define LCDC_TOG_LPCCR(base, value) (LCDC_WR_LPCCR(base, LCDC_RD_LPCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LPCCR bitfields
 */

/*!
 * @name Register LCDC_LPCCR, field PW[7:0] (RW)
 *
 * Controls the pulse-width of the built-in PWM that controls the contrast of
 * LCD screen.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCCR_PW field. */
#define LCDC_RD_LPCCR_PW(base) ((LCDC_LPCCR_REG(base) & LCDC_LPCCR_PW_MASK) >> LCDC_LPCCR_PW_SHIFT)
#define LCDC_BRD_LPCCR_PW(base) (LCDC_RD_LPCCR_PW(base))

/*! @brief Set the PW field to a new value. */
#define LCDC_WR_LPCCR_PW(base, value) (LCDC_RMW_LPCCR(base, LCDC_LPCCR_PW_MASK, LCDC_LPCCR_PW(value)))
#define LCDC_BWR_LPCCR_PW(base, value) (LCDC_WR_LPCCR_PW(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCCR, field CC_EN[8] (RW)
 *
 * Enables/disables the contrast control function.
 *
 * Values:
 * - 0 - Contrast control is off.
 * - 1 - Contrast control is on.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCCR_CC_EN field. */
#define LCDC_RD_LPCCR_CC_EN(base) ((LCDC_LPCCR_REG(base) & LCDC_LPCCR_CC_EN_MASK) >> LCDC_LPCCR_CC_EN_SHIFT)
#define LCDC_BRD_LPCCR_CC_EN(base) (BITBAND_ACCESS32(&LCDC_LPCCR_REG(base), LCDC_LPCCR_CC_EN_SHIFT))

/*! @brief Set the CC_EN field to a new value. */
#define LCDC_WR_LPCCR_CC_EN(base, value) (LCDC_RMW_LPCCR(base, LCDC_LPCCR_CC_EN_MASK, LCDC_LPCCR_CC_EN(value)))
#define LCDC_BWR_LPCCR_CC_EN(base, value) (BITBAND_ACCESS32(&LCDC_LPCCR_REG(base), LCDC_LPCCR_CC_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LPCCR, field SCR[10:9] (RW)
 *
 * Selects the input clock source for PWM counter. PWM output frequency is equal
 * to the frequency of input clock divided by 256.
 *
 * Values:
 * - 00 - Line pulse
 * - 01 - Pixel clock
 * - 10 - LCD clock
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCCR_SCR field. */
#define LCDC_RD_LPCCR_SCR(base) ((LCDC_LPCCR_REG(base) & LCDC_LPCCR_SCR_MASK) >> LCDC_LPCCR_SCR_SHIFT)
#define LCDC_BRD_LPCCR_SCR(base) (LCDC_RD_LPCCR_SCR(base))

/*! @brief Set the SCR field to a new value. */
#define LCDC_WR_LPCCR_SCR(base, value) (LCDC_RMW_LPCCR(base, LCDC_LPCCR_SCR_MASK, LCDC_LPCCR_SCR(value)))
#define LCDC_BWR_LPCCR_SCR(base, value) (LCDC_WR_LPCCR_SCR(base, value))
/*@}*/

/*!
 * @name Register LCDC_LPCCR, field LDMSK[15] (RW)
 *
 * Enables/disables the LD output to zero .
 *
 * Values:
 * - 0 - LD [23:0] is normal.
 * - 1 - LD [23:0] always equals 0.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LPCCR_LDMSK field. */
#define LCDC_RD_LPCCR_LDMSK(base) ((LCDC_LPCCR_REG(base) & LCDC_LPCCR_LDMSK_MASK) >> LCDC_LPCCR_LDMSK_SHIFT)
#define LCDC_BRD_LPCCR_LDMSK(base) (BITBAND_ACCESS32(&LCDC_LPCCR_REG(base), LCDC_LPCCR_LDMSK_SHIFT))

