pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the LDMSK field to a new value. */
#define LCDC_WR_LPCCR_LDMSK(base, value) (LCDC_RMW_LPCCR(base, LCDC_LPCCR_LDMSK_MASK, LCDC_LPCCR_LDMSK(value)))
#define LCDC_BWR_LPCCR_LDMSK(base, value) (BITBAND_ACCESS32(&LCDC_LPCCR_REG(base), LCDC_LPCCR_LDMSK_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LDCR - LCDC DMA control register
 ******************************************************************************/

/*!
 * @brief LCDC_LDCR - LCDC DMA control register (RW)
 *
 * Reset value: 0x80040060U
 *
 * There is a 128 x 32 bit line buffer in the LCDC that stores DMA data from
 * system memory. LDCR controls DMA burst length and when to trigger a DMA burst in
 * terms of number of data bytes left in the pixel buffer.
 */
/*!
 * @name Constants and macros for entire LCDC_LDCR register
 */
/*@{*/
#define LCDC_RD_LDCR(base)       (LCDC_LDCR_REG(base))
#define LCDC_WR_LDCR(base, value) (LCDC_LDCR_REG(base) = (value))
#define LCDC_RMW_LDCR(base, mask, value) (LCDC_WR_LDCR(base, (LCDC_RD_LDCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LDCR(base, value) (LCDC_WR_LDCR(base, LCDC_RD_LDCR(base) |  (value)))
#define LCDC_CLR_LDCR(base, value) (LCDC_WR_LDCR(base, LCDC_RD_LDCR(base) & ~(value)))
#define LCDC_TOG_LDCR(base, value) (LCDC_WR_LDCR(base, LCDC_RD_LDCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LDCR bitfields
 */

/*!
 * @name Register LCDC_LDCR, field TM[6:0] (RW)
 *
 * Sets the low-level mark in the pixel buffer to trigger a DMA request. The
 * low-level mark equals the number of words left in the pixel buffer.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LDCR_TM field. */
#define LCDC_RD_LDCR_TM(base) ((LCDC_LDCR_REG(base) & LCDC_LDCR_TM_MASK) >> LCDC_LDCR_TM_SHIFT)
#define LCDC_BRD_LDCR_TM(base) (LCDC_RD_LDCR_TM(base))

/*! @brief Set the TM field to a new value. */
#define LCDC_WR_LDCR_TM(base, value) (LCDC_RMW_LDCR(base, LCDC_LDCR_TM_MASK, LCDC_LDCR_TM(value)))
#define LCDC_BWR_LDCR_TM(base, value) (LCDC_WR_LDCR_TM(base, value))
/*@}*/

/*!
 * @name Register LCDC_LDCR, field HM[22:16] (RW)
 *
 * Establishes the high mark for DMA requests. For dynamic burst length, after
 * DMA request is made, data is loaded and pixel buffer continues to be filled
 * until the number of empty words left in DMA FIFO is equal to the high mark minus
 * 2. Minimum HM setting in dynamic burst is 3. For fixed burst length, burst
 * length (in words) of each request is equal to the DMA high mark setting and its
 * value must be larger than TM.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LDCR_HM field. */
#define LCDC_RD_LDCR_HM(base) ((LCDC_LDCR_REG(base) & LCDC_LDCR_HM_MASK) >> LCDC_LDCR_HM_SHIFT)
#define LCDC_BRD_LDCR_HM(base) (LCDC_RD_LDCR_HM(base))

/*! @brief Set the HM field to a new value. */
#define LCDC_WR_LDCR_HM(base, value) (LCDC_RMW_LDCR(base, LCDC_LDCR_HM_MASK, LCDC_LDCR_HM(value)))
#define LCDC_BWR_LDCR_HM(base, value) (LCDC_WR_LDCR_HM(base, value))
/*@}*/

/*!
 * @name Register LCDC_LDCR, field BURST[31] (RW)
 *
 * Determines whether the burst length is fixed or dynamic.
 *
 * Values:
 * - 0 - Burst length is dynamic.
 * - 1 - Burst length is fixed.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LDCR_BURST field. */
#define LCDC_RD_LDCR_BURST(base) ((LCDC_LDCR_REG(base) & LCDC_LDCR_BURST_MASK) >> LCDC_LDCR_BURST_SHIFT)
#define LCDC_BRD_LDCR_BURST(base) (BITBAND_ACCESS32(&LCDC_LDCR_REG(base), LCDC_LDCR_BURST_SHIFT))

/*! @brief Set the BURST field to a new value. */
#define LCDC_WR_LDCR_BURST(base, value) (LCDC_RMW_LDCR(base, LCDC_LDCR_BURST_MASK, LCDC_LDCR_BURST(value)))
#define LCDC_BWR_LDCR_BURST(base, value) (BITBAND_ACCESS32(&LCDC_LDCR_REG(base), LCDC_LDCR_BURST_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LRMCR - LCDC refresh mode control register
 ******************************************************************************/

/*!
 * @brief LCDC_LRMCR - LCDC refresh mode control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the refresh characteristics. SELF_REF must be set
 * while the LCDC is already enabled with SIM_MCR[LCDSTART]=1. On entering
 * self-refresh mode, LSCLK and LD[23:0] signals stay low. HYSN and VSYN operate normally.
 * Except for SSA, LRMCR, BGLUT and GWLUT registers, all configurations must be
 * performed before enabling the LCDC to avoid a malfunction. SSA must always
 * match the address range of the RAM selected. If the user wants to switch between
 * various types of RAM, LCDC must be disabled before switching.
 */
/*!
 * @name Constants and macros for entire LCDC_LRMCR register
 */
/*@{*/
#define LCDC_RD_LRMCR(base)      (LCDC_LRMCR_REG(base))
#define LCDC_WR_LRMCR(base, value) (LCDC_LRMCR_REG(base) = (value))
#define LCDC_RMW_LRMCR(base, mask, value) (LCDC_WR_LRMCR(base, (LCDC_RD_LRMCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LRMCR(base, value) (LCDC_WR_LRMCR(base, LCDC_RD_LRMCR(base) |  (value)))
#define LCDC_CLR_LRMCR(base, value) (LCDC_WR_LRMCR(base, LCDC_RD_LRMCR(base) & ~(value)))
#define LCDC_TOG_LRMCR(base, value) (LCDC_WR_LRMCR(base, LCDC_RD_LRMCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LRMCR bitfields
 */

/*!
 * @name Register LCDC_LRMCR, field SELF_REF[0] (RW)
 *
 * Enables/disables self-refresh mode.
 *
 * Values:
 * - 0 - Disable self-refresh
 * - 1 - Enable self-refresh
 */
/*@{*/
/*! @brief Read current value of the LCDC_LRMCR_SELF_REF field. */
#define LCDC_RD_LRMCR_SELF_REF(base) ((LCDC_LRMCR_REG(base) & LCDC_LRMCR_SELF_REF_MASK) >> LCDC_LRMCR_SELF_REF_SHIFT)
#define LCDC_BRD_LRMCR_SELF_REF(base) (BITBAND_ACCESS32(&LCDC_LRMCR_REG(base), LCDC_LRMCR_SELF_REF_SHIFT))

/*! @brief Set the SELF_REF field to a new value. */
#define LCDC_WR_LRMCR_SELF_REF(base, value) (LCDC_RMW_LRMCR(base, LCDC_LRMCR_SELF_REF_MASK, LCDC_LRMCR_SELF_REF(value)))
#define LCDC_BWR_LRMCR_SELF_REF(base, value) (BITBAND_ACCESS32(&LCDC_LRMCR_REG(base), LCDC_LRMCR_SELF_REF_SHIFT) = (value))
/*@}*/

