pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * LCDC_LICR - LCDC interrupt configuration register
 ******************************************************************************/

/*!
 * @brief LCDC_LICR - LCDC interrupt configuration register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register configures the interrupt conditions. The LCDC selects between
 * triggering an interrupt at either the End of Frame or at the Beginning of
 * Frame. This register works in conjunction with the LIER to enable LCDC interrupts.
 * If an EOF interrupt is desired, then set INTCON=0 and LIER[EOF_EN]=1. If a BOF
 * interrupt is desired, then set INTCON=1 and LIER[BOF_EN]=1. The graphic
 * window interrupt are enabled in the same manner by modifying the GW_INT_CON bit and
 * LIEF register.
 */
/*!
 * @name Constants and macros for entire LCDC_LICR register
 */
/*@{*/
#define LCDC_RD_LICR(base)       (LCDC_LICR_REG(base))
#define LCDC_WR_LICR(base, value) (LCDC_LICR_REG(base) = (value))
#define LCDC_RMW_LICR(base, mask, value) (LCDC_WR_LICR(base, (LCDC_RD_LICR(base) & ~(mask)) | (value)))
#define LCDC_SET_LICR(base, value) (LCDC_WR_LICR(base, LCDC_RD_LICR(base) |  (value)))
#define LCDC_CLR_LICR(base, value) (LCDC_WR_LICR(base, LCDC_RD_LICR(base) & ~(value)))
#define LCDC_TOG_LICR(base, value) (LCDC_WR_LICR(base, LCDC_RD_LICR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LICR bitfields
 */

/*!
 * @name Register LCDC_LICR, field INTCON[0] (RW)
 *
 * Determines if an interrupt condition is set at the beginning or end of frame
 * condition. Refer to #2364 for INTSYN/INTCON setting usage.
 *
 * Values:
 * - 0 - Interrupt flag is set when the end of frame (EOF) is reached.
 * - 1 - Interrupt flag is set when the beginning of frame (BOF) is reached.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LICR_INTCON field. */
#define LCDC_RD_LICR_INTCON(base) ((LCDC_LICR_REG(base) & LCDC_LICR_INTCON_MASK) >> LCDC_LICR_INTCON_SHIFT)
#define LCDC_BRD_LICR_INTCON(base) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_INTCON_SHIFT))

/*! @brief Set the INTCON field to a new value. */
#define LCDC_WR_LICR_INTCON(base, value) (LCDC_RMW_LICR(base, LCDC_LICR_INTCON_MASK, LCDC_LICR_INTCON(value)))
#define LCDC_BWR_LICR_INTCON(base, value) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_INTCON_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LICR, field INTSYN[2] (RW)
 *
 * Determines if an interrupt flag is set during last/first data of frame
 * loading or on last/first data of frame output to the LCD panel. Please refer to the
 * following table for INTSYN/INTCON setting usage. There is a latency between
 * loading last/first data of the frame to output to the LCD panel. INTSYN/INTCON
 * settings INTSYN INTCON Description 0 0 Interrupt flag is set on loading last
 * data of frame from memory. 0 1 Interrupt flag is set on loading first data of
 * frame from memory. 1 0 Interrupt flag is set on output of last data of frame to
 * LCD panel. 1 1 Interrupt flag is set on output of first data of frame to LCD
 * panel.
 *
 * Values:
 * - 0 - Interrupt flag is set on loading the last/first data of frame from
 *     memory.
 * - 1 - Interrupt flag is set on output of the last/first data of frame to LCD
 *     panel.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LICR_INTSYN field. */
#define LCDC_RD_LICR_INTSYN(base) ((LCDC_LICR_REG(base) & LCDC_LICR_INTSYN_MASK) >> LCDC_LICR_INTSYN_SHIFT)
#define LCDC_BRD_LICR_INTSYN(base) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_INTSYN_SHIFT))

/*! @brief Set the INTSYN field to a new value. */
#define LCDC_WR_LICR_INTSYN(base, value) (LCDC_RMW_LICR(base, LCDC_LICR_INTSYN_MASK, LCDC_LICR_INTSYN(value)))
#define LCDC_BWR_LICR_INTSYN(base, value) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_INTSYN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LICR, field GW_INT_CON[4] (RW)
 *
 * Determines if an interrupt condition is set at the beginning or end of
 * graphic window condition.
 *
 * Values:
 * - 0 - Interrupt flag is set when end of graphic window is reached.
 * - 1 - Interrupt flag is set when beginning of graphic window is reached.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LICR_GW_INT_CON field. */
#define LCDC_RD_LICR_GW_INT_CON(base) ((LCDC_LICR_REG(base) & LCDC_LICR_GW_INT_CON_MASK) >> LCDC_LICR_GW_INT_CON_SHIFT)
#define LCDC_BRD_LICR_GW_INT_CON(base) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_GW_INT_CON_SHIFT))

/*! @brief Set the GW_INT_CON field to a new value. */
#define LCDC_WR_LICR_GW_INT_CON(base, value) (LCDC_RMW_LICR(base, LCDC_LICR_GW_INT_CON_MASK, LCDC_LICR_GW_INT_CON(value)))
#define LCDC_BWR_LICR_GW_INT_CON(base, value) (BITBAND_ACCESS32(&LCDC_LICR_REG(base), LCDC_LICR_GW_INT_CON_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LIER - LCDC interrupt enable register
 ******************************************************************************/

/*!
 * @brief LCDC_LIER - LCDC interrupt enable register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register enables the LCDC to generate an interrupt. When the interrupt
 * is disabled, its status can still be observed in the Interrupt Status Register.
 */
/*!
 * @name Constants and macros for entire LCDC_LIER register
 */
/*@{*/
#define LCDC_RD_LIER(base)       (LCDC_LIER_REG(base))
#define LCDC_WR_LIER(base, value) (LCDC_LIER_REG(base) = (value))
#define LCDC_RMW_LIER(base, mask, value) (LCDC_WR_LIER(base, (LCDC_RD_LIER(base) & ~(mask)) | (value)))
#define LCDC_SET_LIER(base, value) (LCDC_WR_LIER(base, LCDC_RD_LIER(base) |  (value)))
#define LCDC_CLR_LIER(base, value) (LCDC_WR_LIER(base, LCDC_RD_LIER(base) & ~(value)))
#define LCDC_TOG_LIER(base, value) (LCDC_WR_LIER(base, LCDC_RD_LIER(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LIER bitfields
 */

/*!
 * @name Register LCDC_LIER, field BOF_EN[0] (RW)
 *
 * Enables or masks the background plane beginning of frame interrupt.
 * LICR[INTCON] must be 1 to use the BOF interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_BOF_EN field. */
#define LCDC_RD_LIER_BOF_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_BOF_EN_MASK) >> LCDC_LIER_BOF_EN_SHIFT)
#define LCDC_BRD_LIER_BOF_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_BOF_EN_SHIFT))

