pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the BOF_EN field to a new value. */
#define LCDC_WR_LIER_BOF_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_BOF_EN_MASK, LCDC_LIER_BOF_EN(value)))
#define LCDC_BWR_LIER_BOF_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_BOF_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LIER, field EOF_EN[1] (RW)
 *
 * Enables or masks the background plane end of frame interrupt. LICR[INTCON]
 * must be 0 to use the EOF interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_EOF_EN field. */
#define LCDC_RD_LIER_EOF_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_EOF_EN_MASK) >> LCDC_LIER_EOF_EN_SHIFT)
#define LCDC_BRD_LIER_EOF_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_EOF_EN_SHIFT))

/*! @brief Set the EOF_EN field to a new value. */
#define LCDC_WR_LIER_EOF_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_EOF_EN_MASK, LCDC_LIER_EOF_EN(value)))
#define LCDC_BWR_LIER_EOF_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_EOF_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LIER, field UDR_ERR_EN[3] (RW)
 *
 * Enables or masks the background plane under-run error interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_UDR_ERR_EN field. */
#define LCDC_RD_LIER_UDR_ERR_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_UDR_ERR_EN_MASK) >> LCDC_LIER_UDR_ERR_EN_SHIFT)
#define LCDC_BRD_LIER_UDR_ERR_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_UDR_ERR_EN_SHIFT))

/*! @brief Set the UDR_ERR_EN field to a new value. */
#define LCDC_WR_LIER_UDR_ERR_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_UDR_ERR_EN_MASK, LCDC_LIER_UDR_ERR_EN(value)))
#define LCDC_BWR_LIER_UDR_ERR_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_UDR_ERR_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LIER, field GW_BOF_EN[4] (RW)
 *
 * Enables or masks the graphic window beginning of frame interrupt.
 * LICR[GW_INT_CON] must be 1 to use the Graphic Window BOF interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_GW_BOF_EN field. */
#define LCDC_RD_LIER_GW_BOF_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_GW_BOF_EN_MASK) >> LCDC_LIER_GW_BOF_EN_SHIFT)
#define LCDC_BRD_LIER_GW_BOF_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_BOF_EN_SHIFT))

/*! @brief Set the GW_BOF_EN field to a new value. */
#define LCDC_WR_LIER_GW_BOF_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_GW_BOF_EN_MASK, LCDC_LIER_GW_BOF_EN(value)))
#define LCDC_BWR_LIER_GW_BOF_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_BOF_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LIER, field GW_EOF_EN[5] (RW)
 *
 * Enables or masks the graphic window end of frame interrupt. LICR[GW_INT_CON]
 * must be 0 to use the Graphic Window EOF interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_GW_EOF_EN field. */
#define LCDC_RD_LIER_GW_EOF_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_GW_EOF_EN_MASK) >> LCDC_LIER_GW_EOF_EN_SHIFT)
#define LCDC_BRD_LIER_GW_EOF_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_EOF_EN_SHIFT))

/*! @brief Set the GW_EOF_EN field to a new value. */
#define LCDC_WR_LIER_GW_EOF_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_GW_EOF_EN_MASK, LCDC_LIER_GW_EOF_EN(value)))
#define LCDC_BWR_LIER_GW_EOF_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_EOF_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LIER, field GW_UDR_ERR_EN[7] (RW)
 *
 * Enables or masks the graphic window under-run error interrupt.
 *
 * Values:
 * - 0 - Mask interrupt.
 * - 1 - Enable interrupt.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LIER_GW_UDR_ERR_EN field. */
#define LCDC_RD_LIER_GW_UDR_ERR_EN(base) ((LCDC_LIER_REG(base) & LCDC_LIER_GW_UDR_ERR_EN_MASK) >> LCDC_LIER_GW_UDR_ERR_EN_SHIFT)
#define LCDC_BRD_LIER_GW_UDR_ERR_EN(base) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_UDR_ERR_EN_SHIFT))

/*! @brief Set the GW_UDR_ERR_EN field to a new value. */
#define LCDC_WR_LIER_GW_UDR_ERR_EN(base, value) (LCDC_RMW_LIER(base, LCDC_LIER_GW_UDR_ERR_EN_MASK, LCDC_LIER_GW_UDR_ERR_EN(value)))
#define LCDC_BWR_LIER_GW_UDR_ERR_EN(base, value) (BITBAND_ACCESS32(&LCDC_LIER_REG(base), LCDC_LIER_GW_UDR_ERR_EN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LISR - LCDC interrupt status register
 ******************************************************************************/

/*!
 * @brief LCDC_LISR - LCDC interrupt status register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register indicates whether an interrupt condition has occurred or not.
 * The status bit is set whenever the interrupt condition is met. If any bit in
 * this register is set and the corresponding bit in LIER is set, LCDC interrupt
 * pin is asserted to the interrupt controller. The status bit is cleared by
 * reading the register.
 */
/*!
 * @name Constants and macros for entire LCDC_LISR register
 */
/*@{*/
#define LCDC_RD_LISR(base)       (LCDC_LISR_REG(base))
/*@}*/

/*
 * Constants & macros for individual LCDC_LISR bitfields
 */

/*!
 * @name Register LCDC_LISR, field BOF[0] (RO)
 *
 * Indicates whether the beginning of frame has reached. It is cleared by
 * reading the status register, at power on reset, or when the LCDC is disabled.
 *
 * Values:
 * - 0 - Interrupt has not occurred.
 * - 1 - Interrupt has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_BOF field. */
#define LCDC_RD_LISR_BOF(base) ((LCDC_LISR_REG(base) & LCDC_LISR_BOF_MASK) >> LCDC_LISR_BOF_SHIFT)
#define LCDC_BRD_LISR_BOF(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_BOF_SHIFT))
/*@}*/

/*!
 * @name Register LCDC_LISR, field EOF[1] (RO)
 *
 * Indicates whether the end of frame has reached. It is cleared by reading the
 * status register, at power on reset, or when the LCDC is disabled.
 *
 * Values:
 * - 0 - Interrupt has not occurred.
 * - 1 - Interrupt has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_EOF field. */
#define LCDC_RD_LISR_EOF(base) ((LCDC_LISR_REG(base) & LCDC_LISR_EOF_MASK) >> LCDC_LISR_EOF_SHIFT)
#define LCDC_BRD_LISR_EOF(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_EOF_SHIFT))
/*@}*/

/*!
 * @name Register LCDC_LISR, field UDR_ERR[3] (RO)
 *
 * Indicates whether the LCDC FIFO has hit an under-run condition. This is when
 * the data output rate is faster than the data input rate to the FIFO. Under-run
 * can cause erroneous data output to LD. LD data output rate must be adjusted
 * to prevent this error.
 *
 * Values:
 * - 0 - Interrupt has not occurred.
 * - 1 - Interrupt has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_UDR_ERR field. */
#define LCDC_RD_LISR_UDR_ERR(base) ((LCDC_LISR_REG(base) & LCDC_LISR_UDR_ERR_MASK) >> LCDC_LISR_UDR_ERR_SHIFT)
#define LCDC_BRD_LISR_UDR_ERR(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_UDR_ERR_SHIFT))
/*@}*/

/*!
 * @name Register LCDC_LISR, field GW_BOF[4] (RO)
 *
 * Indicates whether the beginning of graphic window has reached. It is cleared
 * by reading the status register, at power on reset, or when the LCDC is
 * disabled.
 *
 * Values:
 * - 0 - Interrupt has not occurred.
 * - 1 - Interrupt has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_GW_BOF field. */
#define LCDC_RD_LISR_GW_BOF(base) ((LCDC_LISR_REG(base) & LCDC_LISR_GW_BOF_MASK) >> LCDC_LISR_GW_BOF_SHIFT)
#define LCDC_BRD_LISR_GW_BOF(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_GW_BOF_SHIFT))
/*@}*/

/*!
 * @name Register LCDC_LISR, field GW_EOF[5] (RO)
 *
 * Indicates whether the end of graphic window has reached. It is cleared by
 * reading the status register, at power on reset, or when the LCDC is disabled.
 *
 * Values:
 * - 0 - Interrupt has not occurred.
 * - 1 - Interrupt has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_GW_EOF field. */
#define LCDC_RD_LISR_GW_EOF(base) ((LCDC_LISR_REG(base) & LCDC_LISR_GW_EOF_MASK) >> LCDC_LISR_GW_EOF_SHIFT)
#define LCDC_BRD_LISR_GW_EOF(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_GW_EOF_SHIFT))
/*@}*/

/*!
 * @name Register LCDC_LISR, field GW_UDR_ERR[7] (RO)
 *
 * Indicates whether the LCDC FIFO in graphic window plan has hit an under-run
 * condition. This is when the data output rate is faster than the data input rate
 * to the FIFO of the graphic window plan. Under-run can cause erroneous data
 * output to LD. LD data output rate must be adjusted to prevent this error.
 *
 * Values:
 * - 0 - Graphic window under run has not occurred.
 * - 1 - Graphic window under run has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LISR_GW_UDR_ERR field. */
#define LCDC_RD_LISR_GW_UDR_ERR(base) ((LCDC_LISR_REG(base) & LCDC_LISR_GW_UDR_ERR_MASK) >> LCDC_LISR_GW_UDR_ERR_SHIFT)
#define LCDC_BRD_LISR_GW_UDR_ERR(base) (BITBAND_ACCESS32(&LCDC_LISR_REG(base), LCDC_LISR_GW_UDR_ERR_SHIFT))
/*@}*/

