pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * LCDC_LGWSAR - LCDC graphic window start address register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWSAR - LCDC graphic window start address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the starting address of the graphic window image. Refer
 * to Graphic Window on Screen for more details.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWSAR register
 */
/*@{*/
#define LCDC_RD_LGWSAR(base)     (LCDC_LGWSAR_REG(base))
#define LCDC_WR_LGWSAR(base, value) (LCDC_LGWSAR_REG(base) = (value))
#define LCDC_RMW_LGWSAR(base, mask, value) (LCDC_WR_LGWSAR(base, (LCDC_RD_LGWSAR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWSAR(base, value) (LCDC_WR_LGWSAR(base, LCDC_RD_LGWSAR(base) |  (value)))
#define LCDC_CLR_LGWSAR(base, value) (LCDC_WR_LGWSAR(base, LCDC_RD_LGWSAR(base) & ~(value)))
#define LCDC_TOG_LGWSAR(base, value) (LCDC_WR_LGWSAR(base, LCDC_RD_LGWSAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWSAR bitfields
 */

/*!
 * @name Register LCDC_LGWSAR, field GWSA[31:2] (RW)
 *
 * Holds the starting address of the graphic window picture. This field must
 * start at a location that enables a complete graphic window picture to be stored
 * in a 4Mbyte memory boundary (A[21:0]). A[31:22] has a fixed value for the
 * graphic window picture's image.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWSAR_GWSA field. */
#define LCDC_RD_LGWSAR_GWSA(base) ((LCDC_LGWSAR_REG(base) & LCDC_LGWSAR_GWSA_MASK) >> LCDC_LGWSAR_GWSA_SHIFT)
#define LCDC_BRD_LGWSAR_GWSA(base) (LCDC_RD_LGWSAR_GWSA(base))

/*! @brief Set the GWSA field to a new value. */
#define LCDC_WR_LGWSAR_GWSA(base, value) (LCDC_RMW_LGWSAR(base, LCDC_LGWSAR_GWSA_MASK, LCDC_LGWSAR_GWSA(value)))
#define LCDC_BWR_LGWSAR_GWSA(base, value) (LCDC_WR_LGWSAR_GWSA(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LGWSR - LCDC graphic window size register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWSR - LCDC graphic window size register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the height and width of the graphic window on the LCD
 * screen.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWSR register
 */
/*@{*/
#define LCDC_RD_LGWSR(base)      (LCDC_LGWSR_REG(base))
#define LCDC_WR_LGWSR(base, value) (LCDC_LGWSR_REG(base) = (value))
#define LCDC_RMW_LGWSR(base, mask, value) (LCDC_WR_LGWSR(base, (LCDC_RD_LGWSR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWSR(base, value) (LCDC_WR_LGWSR(base, LCDC_RD_LGWSR(base) |  (value)))
#define LCDC_CLR_LGWSR(base, value) (LCDC_WR_LGWSR(base, LCDC_RD_LGWSR(base) & ~(value)))
#define LCDC_TOG_LGWSR(base, value) (LCDC_WR_LGWSR(base, LCDC_RD_LGWSR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWSR bitfields
 */

/*!
 * @name Register LCDC_LGWSR, field GWH[9:0] (RW)
 *
 * Specifies height of the graphic window in terms of pixels or lines. The lines
 * are numbered from 1 to GW_YMAX for a total of GW_YMAX lines. Graphic window
 * size cannot be set to 0.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWSR_GWH field. */
#define LCDC_RD_LGWSR_GWH(base) ((LCDC_LGWSR_REG(base) & LCDC_LGWSR_GWH_MASK) >> LCDC_LGWSR_GWH_SHIFT)
#define LCDC_BRD_LGWSR_GWH(base) (LCDC_RD_LGWSR_GWH(base))

/*! @brief Set the GWH field to a new value. */
#define LCDC_WR_LGWSR_GWH(base, value) (LCDC_RMW_LGWSR(base, LCDC_LGWSR_GWH_MASK, LCDC_LGWSR_GWH(value)))
#define LCDC_BWR_LGWSR_GWH(base, value) (LCDC_WR_LGWSR_GWH(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWSR, field GWW[26:20] (RW)
 *
 * Holds graphic window x-axis size divided by 16. For black-and-white panels (1
 * bpp), GW_XMAX [20] is ignored, forcing the x-axis of the screen size to be a
 * multiple of 32 pixels/line. Graphic window size cannot be set to 0.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWSR_GWW field. */
#define LCDC_RD_LGWSR_GWW(base) ((LCDC_LGWSR_REG(base) & LCDC_LGWSR_GWW_MASK) >> LCDC_LGWSR_GWW_SHIFT)
#define LCDC_BRD_LGWSR_GWW(base) (LCDC_RD_LGWSR_GWW(base))

/*! @brief Set the GWW field to a new value. */
#define LCDC_WR_LGWSR_GWW(base, value) (LCDC_RMW_LGWSR(base, LCDC_LGWSR_GWW_MASK, LCDC_LGWSR_GWW(value)))
#define LCDC_BWR_LGWSR_GWW(base, value) (LCDC_WR_LGWSR_GWW(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LGWVPWR - LCDC graphic window virtual page width register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWVPWR - LCDC graphic window virtual page width register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the virtual page width for the graphic window picture
 * on the LCD screen. Refer to Graphic Window on Screen for more details.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWVPWR register
 */
/*@{*/
#define LCDC_RD_LGWVPWR(base)    (LCDC_LGWVPWR_REG(base))
#define LCDC_WR_LGWVPWR(base, value) (LCDC_LGWVPWR_REG(base) = (value))
#define LCDC_RMW_LGWVPWR(base, mask, value) (LCDC_WR_LGWVPWR(base, (LCDC_RD_LGWVPWR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWVPWR(base, value) (LCDC_WR_LGWVPWR(base, LCDC_RD_LGWVPWR(base) |  (value)))
#define LCDC_CLR_LGWVPWR(base, value) (LCDC_WR_LGWVPWR(base, LCDC_RD_LGWVPWR(base) & ~(value)))
#define LCDC_TOG_LGWVPWR(base, value) (LCDC_WR_LGWVPWR(base, LCDC_RD_LGWVPWR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWVPWR bitfields
 */

/*!
 * @name Register LCDC_LGWVPWR, field GWVPW[10:0] (RW)
 *
 * Defines the virtual page width of the graphic window picture. VPW bits
 * represent the number of 32-bit words required to hold the data for one virtual line.
 * GWVPW is used in calculating the starting address representing the beginning
 * of each line of the graphic window picture.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWVPWR_GWVPW field. */
#define LCDC_RD_LGWVPWR_GWVPW(base) ((LCDC_LGWVPWR_REG(base) & LCDC_LGWVPWR_GWVPW_MASK) >> LCDC_LGWVPWR_GWVPW_SHIFT)
#define LCDC_BRD_LGWVPWR_GWVPW(base) (LCDC_RD_LGWVPWR_GWVPW(base))

/*! @brief Set the GWVPW field to a new value. */
#define LCDC_WR_LGWVPWR_GWVPW(base, value) (LCDC_RMW_LGWVPWR(base, LCDC_LGWVPWR_GWVPW_MASK, LCDC_LGWVPWR_GWVPW(value)))
#define LCDC_BWR_LGWVPWR_GWVPW(base, value) (LCDC_WR_LGWVPWR_GWVPW(base, value))
/*@}*/

