pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * LCDC_LGWPOR - LCDC graphic window panning offset register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWPOR - LCDC graphic window panning offset register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register sets up panning for the graphic window.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWPOR register
 */
/*@{*/
#define LCDC_RD_LGWPOR(base)     (LCDC_LGWPOR_REG(base))
#define LCDC_WR_LGWPOR(base, value) (LCDC_LGWPOR_REG(base) = (value))
#define LCDC_RMW_LGWPOR(base, mask, value) (LCDC_WR_LGWPOR(base, (LCDC_RD_LGWPOR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWPOR(base, value) (LCDC_WR_LGWPOR(base, LCDC_RD_LGWPOR(base) |  (value)))
#define LCDC_CLR_LGWPOR(base, value) (LCDC_WR_LGWPOR(base, LCDC_RD_LGWPOR(base) & ~(value)))
#define LCDC_TOG_LGWPOR(base, value) (LCDC_WR_LGWPOR(base, LCDC_RD_LGWPOR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWPOR bitfields
 */

/*!
 * @name Register LCDC_LGWPOR, field GWPO[4:0] (RW)
 *
 * Defines the number of bits that the graphic window data from memory is panned
 * to the left before processing. GWPO is read by the LCDC once at the beginning
 * of each frame. For example, in 4 bpp mode, setting GWPO = 4 shifts 16 bits
 * which means panning the image by 4 pixels left. Shifting data more than 32 bits
 * in graphic window should use LGWSAR register setting. 18 and 24 bpp graphic
 * window panning should use LGWSAR register setting. To achieve panning of the
 * final image by N bits: Bits per pixel GWPO Effective number of pixels panned 1 N
 * N 2 2N N 4 4N N 8 8N N 12/16 16N N
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWPOR_GWPO field. */
#define LCDC_RD_LGWPOR_GWPO(base) ((LCDC_LGWPOR_REG(base) & LCDC_LGWPOR_GWPO_MASK) >> LCDC_LGWPOR_GWPO_SHIFT)
#define LCDC_BRD_LGWPOR_GWPO(base) (LCDC_RD_LGWPOR_GWPO(base))

/*! @brief Set the GWPO field to a new value. */
#define LCDC_WR_LGWPOR_GWPO(base, value) (LCDC_RMW_LGWPOR(base, LCDC_LGWPOR_GWPO_MASK, LCDC_LGWPOR_GWPO(value)))
#define LCDC_BWR_LGWPOR_GWPO(base, value) (LCDC_WR_LGWPOR_GWPO(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LGWPR - LCDC graphic window position register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWPR - LCDC graphic window position register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register determines the starting position of the graphic window on the
 * LCD panel. If any part of the graphic window is not displayed on the screen,
 * then the entire graphic window will disappear. Take caution when changing the
 * LGWPR and LGWSR registers.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWPR register
 */
/*@{*/
#define LCDC_RD_LGWPR(base)      (LCDC_LGWPR_REG(base))
#define LCDC_WR_LGWPR(base, value) (LCDC_LGWPR_REG(base) = (value))
#define LCDC_RMW_LGWPR(base, mask, value) (LCDC_WR_LGWPR(base, (LCDC_RD_LGWPR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWPR(base, value) (LCDC_WR_LGWPR(base, LCDC_RD_LGWPR(base) |  (value)))
#define LCDC_CLR_LGWPR(base, value) (LCDC_WR_LGWPR(base, LCDC_RD_LGWPR(base) & ~(value)))
#define LCDC_TOG_LGWPR(base, value) (LCDC_WR_LGWPR(base, LCDC_RD_LGWPR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWPR bitfields
 */

/*!
 * @name Register LCDC_LGWPR, field GWYP[9:0] (RW)
 *
 * Represents the graphic window's vertical starting position in line (from 0 to
 * YMAX).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWPR_GWYP field. */
#define LCDC_RD_LGWPR_GWYP(base) ((LCDC_LGWPR_REG(base) & LCDC_LGWPR_GWYP_MASK) >> LCDC_LGWPR_GWYP_SHIFT)
#define LCDC_BRD_LGWPR_GWYP(base) (LCDC_RD_LGWPR_GWYP(base))

/*! @brief Set the GWYP field to a new value. */
#define LCDC_WR_LGWPR_GWYP(base, value) (LCDC_RMW_LGWPR(base, LCDC_LGWPR_GWYP_MASK, LCDC_LGWPR_GWYP(value)))
#define LCDC_BWR_LGWPR_GWYP(base, value) (LCDC_WR_LGWPR_GWYP(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWPR, field GWXP[25:16] (RW)
 *
 * Represents the graphic window's horizontal starting position in pixel count
 * (from 0 to XMAX).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWPR_GWXP field. */
#define LCDC_RD_LGWPR_GWXP(base) ((LCDC_LGWPR_REG(base) & LCDC_LGWPR_GWXP_MASK) >> LCDC_LGWPR_GWXP_SHIFT)
#define LCDC_BRD_LGWPR_GWXP(base) (LCDC_RD_LGWPR_GWXP(base))

/*! @brief Set the GWXP field to a new value. */
#define LCDC_WR_LGWPR_GWXP(base, value) (LCDC_RMW_LGWPR(base, LCDC_LGWPR_GWXP_MASK, LCDC_LGWPR_GWXP(value)))
#define LCDC_BWR_LGWPR_GWXP(base, value) (LCDC_WR_LGWPR_GWXP(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LGWCR - LCDC graphic window control register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWCR - LCDC graphic window control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the behaviors of graphic window. In AUS mode, use
 * LAUSCR for color keying values. If using 16 or 12 bpp, it will use the least
 * significant bits for comparison. If using 8 or 4 bpp, it uses the 18 bpp data from
 * the GWLUT.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWCR register
 */
/*@{*/
#define LCDC_RD_LGWCR(base)      (LCDC_LGWCR_REG(base))
#define LCDC_WR_LGWCR(base, value) (LCDC_LGWCR_REG(base) = (value))
#define LCDC_RMW_LGWCR(base, mask, value) (LCDC_WR_LGWCR(base, (LCDC_RD_LGWCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWCR(base, value) (LCDC_WR_LGWCR(base, LCDC_RD_LGWCR(base) |  (value)))
#define LCDC_CLR_LGWCR(base, value) (LCDC_WR_LGWCR(base, LCDC_RD_LGWCR(base) & ~(value)))
#define LCDC_TOG_LGWCR(base, value) (LCDC_WR_LGWCR(base, LCDC_RD_LGWCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWCR bitfields
 */

/*!
 * @name Register LCDC_LGWCR, field GWCKB[5:0] (RW)
 *
 * Values:
 * - 000000 - No blue
 * - 111111 - Full blue
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWCKB field. */
#define LCDC_RD_LGWCR_GWCKB(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWCKB_MASK) >> LCDC_LGWCR_GWCKB_SHIFT)
#define LCDC_BRD_LGWCR_GWCKB(base) (LCDC_RD_LGWCR_GWCKB(base))

/*! @brief Set the GWCKB field to a new value. */
#define LCDC_WR_LGWCR_GWCKB(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWCKB_MASK, LCDC_LGWCR_GWCKB(value)))
#define LCDC_BWR_LGWCR_GWCKB(base, value) (LCDC_WR_LGWCR_GWCKB(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GWCKG[11:6] (RW)
 *
 * Values:
 * - 000000 - No green
 * - 111111 - Full green
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWCKG field. */
#define LCDC_RD_LGWCR_GWCKG(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWCKG_MASK) >> LCDC_LGWCR_GWCKG_SHIFT)
#define LCDC_BRD_LGWCR_GWCKG(base) (LCDC_RD_LGWCR_GWCKG(base))

/*! @brief Set the GWCKG field to a new value. */
#define LCDC_WR_LGWCR_GWCKG(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWCKG_MASK, LCDC_LGWCR_GWCKG(value)))
#define LCDC_BWR_LGWCR_GWCKG(base, value) (LCDC_WR_LGWCR_GWCKG(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GWCKR[17:12] (RW)
 *
 * Values:
 * - 000000 - No red
 * - 111111 - Full red
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWCKR field. */
#define LCDC_RD_LGWCR_GWCKR(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWCKR_MASK) >> LCDC_LGWCR_GWCKR_SHIFT)
#define LCDC_BRD_LGWCR_GWCKR(base) (LCDC_RD_LGWCR_GWCKR(base))

/*! @brief Set the GWCKR field to a new value. */
#define LCDC_WR_LGWCR_GWCKR(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWCKR_MASK, LCDC_LGWCR_GWCKR(value)))
#define LCDC_BWR_LGWCR_GWCKR(base, value) (LCDC_WR_LGWCR_GWCKR(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GW_RVS[21] (RW)
 *
 * Selects the graphic window vertical scan direction as normal or reverse
 * (graphic window image flips along the x-axis). The LGWSAR register should be
 * changed accordingly to point to the end of the graphic window data.
 *
 * Values:
 * - 0 - Vertical scan in normal direction.
 * - 1 - Vertical scan in reverse direction.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GW_RVS field. */
#define LCDC_RD_LGWCR_GW_RVS(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GW_RVS_MASK) >> LCDC_LGWCR_GW_RVS_SHIFT)
#define LCDC_BRD_LGWCR_GW_RVS(base) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GW_RVS_SHIFT))

/*! @brief Set the GW_RVS field to a new value. */
#define LCDC_WR_LGWCR_GW_RVS(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GW_RVS_MASK, LCDC_LGWCR_GW_RVS(value)))
#define LCDC_BWR_LGWCR_GW_RVS(base, value) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GW_RVS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GWE[22] (RW)
 *
 * Enables/disables graphic window displayed on screen.
 *
 * Values:
 * - 0 - Disable graphic window on screen.
 * - 1 - Enable graphic window on screen.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWE field. */
#define LCDC_RD_LGWCR_GWE(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWE_MASK) >> LCDC_LGWCR_GWE_SHIFT)
#define LCDC_BRD_LGWCR_GWE(base) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GWE_SHIFT))

