pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the GWE field to a new value. */
#define LCDC_WR_LGWCR_GWE(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWE_MASK, LCDC_LGWCR_GWE(value)))
#define LCDC_BWR_LGWCR_GWE(base, value) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GWE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GWCKE[23] (RW)
 *
 * Enables/disables graphic window color keying.
 *
 * Values:
 * - 0 - Disable color keying of graphic window.
 * - 1 - Enable color keying of graphic window.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWCKE field. */
#define LCDC_RD_LGWCR_GWCKE(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWCKE_MASK) >> LCDC_LGWCR_GWCKE_SHIFT)
#define LCDC_BRD_LGWCR_GWCKE(base) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GWCKE_SHIFT))

/*! @brief Set the GWCKE field to a new value. */
#define LCDC_WR_LGWCR_GWCKE(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWCKE_MASK, LCDC_LGWCR_GWCKE(value)))
#define LCDC_BWR_LGWCR_GWCKE(base, value) (BITBAND_ACCESS32(&LCDC_LGWCR_REG(base), LCDC_LGWCR_GWCKE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCDC_LGWCR, field GWAV[31:24] (RW)
 *
 * Defines the graphic window alpha value used for alpha blending between
 * graphic window and background plane.
 *
 * Values:
 * - 0 - Graphic window totally transparent (not displayed on LCD screen).
 * - 1 - Graphic window totally opaque (completely visible on LCD screen).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWCR_GWAV field. */
#define LCDC_RD_LGWCR_GWAV(base) ((LCDC_LGWCR_REG(base) & LCDC_LGWCR_GWAV_MASK) >> LCDC_LGWCR_GWAV_SHIFT)
#define LCDC_BRD_LGWCR_GWAV(base) (LCDC_RD_LGWCR_GWAV(base))

/*! @brief Set the GWAV field to a new value. */
#define LCDC_WR_LGWCR_GWAV(base, value) (LCDC_RMW_LGWCR(base, LCDC_LGWCR_GWAV_MASK, LCDC_LGWCR_GWAV(value)))
#define LCDC_BWR_LGWCR_GWAV(base, value) (LCDC_WR_LGWCR_GWAV(base, value))
/*@}*/

/*******************************************************************************
 * LCDC_LGWDCR - LCDC graphic window DMA control register
 ******************************************************************************/

/*!
 * @brief LCDC_LGWDCR - LCDC graphic window DMA control register (RW)
 *
 * Reset value: 0x80040060U
 *
 * There is a 128 x 32 bit line buffer in the LCDC that stores graphic window
 * data from system memory. LGWDCE controls the DMA burst length and when to
 * trigger a DMA burst in terms of the number of data bytes left in the pixel buffer.
 */
/*!
 * @name Constants and macros for entire LCDC_LGWDCR register
 */
/*@{*/
#define LCDC_RD_LGWDCR(base)     (LCDC_LGWDCR_REG(base))
#define LCDC_WR_LGWDCR(base, value) (LCDC_LGWDCR_REG(base) = (value))
#define LCDC_RMW_LGWDCR(base, mask, value) (LCDC_WR_LGWDCR(base, (LCDC_RD_LGWDCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LGWDCR(base, value) (LCDC_WR_LGWDCR(base, LCDC_RD_LGWDCR(base) |  (value)))
#define LCDC_CLR_LGWDCR(base, value) (LCDC_WR_LGWDCR(base, LCDC_RD_LGWDCR(base) & ~(value)))
#define LCDC_TOG_LGWDCR(base, value) (LCDC_WR_LGWDCR(base, LCDC_RD_LGWDCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LGWDCR bitfields
 */

/*!
 * @name Register LCDC_LGWDCR, field GWTM[6:0] (RW)
 *
 * Sets low level mark in the graphic window FIFO to trigger a DMA request. Low
 * level mark equals the number of words left in the pixel buffer.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWDCR_GWTM field. */
#define LCDC_RD_LGWDCR_GWTM(base) ((LCDC_LGWDCR_REG(base) & LCDC_LGWDCR_GWTM_MASK) >> LCDC_LGWDCR_GWTM_SHIFT)
#define LCDC_BRD_LGWDCR_GWTM(base) (LCDC_RD_LGWDCR_GWTM(base))

/*! @brief Set the GWTM field to a new value. */
#define LCDC_WR_LGWDCR_GWTM(base, value) (LCDC_RMW_LGWDCR(base, LCDC_LGWDCR_GWTM_MASK, LCDC_LGWDCR_GWTM(value)))
#define LCDC_BWR_LGWDCR_GWTM(base, value) (LCDC_WR_LGWDCR_GWTM(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWDCR, field GWHM[22:16] (RW)
 *
 * Establishes high mark for DMA requests. For dynamic burst length, once DMA
 * request is made, data is loaded and the graphic window FIFO continues to be
 * filled until the number of empty words left in the graphic window FIFO is equal to
 * the high mark minus 2. Minimum GWHM setting in dynamic burst is 3. For fixed
 * burst length, burst length (in words) of each request is equal to the DMA high
 * mark setting and its value must be larger than GWTM.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWDCR_GWHM field. */
#define LCDC_RD_LGWDCR_GWHM(base) ((LCDC_LGWDCR_REG(base) & LCDC_LGWDCR_GWHM_MASK) >> LCDC_LGWDCR_GWHM_SHIFT)
#define LCDC_BRD_LGWDCR_GWHM(base) (LCDC_RD_LGWDCR_GWHM(base))

/*! @brief Set the GWHM field to a new value. */
#define LCDC_WR_LGWDCR_GWHM(base, value) (LCDC_RMW_LGWDCR(base, LCDC_LGWDCR_GWHM_MASK, LCDC_LGWDCR_GWHM(value)))
#define LCDC_BWR_LGWDCR_GWHM(base, value) (LCDC_WR_LGWDCR_GWHM(base, value))
/*@}*/

/*!
 * @name Register LCDC_LGWDCR, field GWBT[31] (RW)
 *
 * Determines whether burst length is fixed or dynamic in graphic window plane.
 *
 * Values:
 * - 0 - Burst length is dynamic.
 * - 1 - Burst length is fixed.
 */
/*@{*/
/*! @brief Read current value of the LCDC_LGWDCR_GWBT field. */
#define LCDC_RD_LGWDCR_GWBT(base) ((LCDC_LGWDCR_REG(base) & LCDC_LGWDCR_GWBT_MASK) >> LCDC_LGWDCR_GWBT_SHIFT)
#define LCDC_BRD_LGWDCR_GWBT(base) (BITBAND_ACCESS32(&LCDC_LGWDCR_REG(base), LCDC_LGWDCR_GWBT_SHIFT))

/*! @brief Set the GWBT field to a new value. */
#define LCDC_WR_LGWDCR_GWBT(base, value) (LCDC_RMW_LGWDCR(base, LCDC_LGWDCR_GWBT_MASK, LCDC_LGWDCR_GWBT(value)))
#define LCDC_BWR_LGWDCR_GWBT(base, value) (BITBAND_ACCESS32(&LCDC_LGWDCR_REG(base), LCDC_LGWDCR_GWBT_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LAUSCR - LCDC AUS mode control register
 ******************************************************************************/

/*!
 * @brief LCDC_LAUSCR - LCDC AUS mode control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register determines the behavior of LCDC in AUS mode.
 */
/*!
 * @name Constants and macros for entire LCDC_LAUSCR register
 */
/*@{*/
#define LCDC_RD_LAUSCR(base)     (LCDC_LAUSCR_REG(base))
#define LCDC_WR_LAUSCR(base, value) (LCDC_LAUSCR_REG(base) = (value))
#define LCDC_RMW_LAUSCR(base, mask, value) (LCDC_WR_LAUSCR(base, (LCDC_RD_LAUSCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LAUSCR(base, value) (LCDC_WR_LAUSCR(base, LCDC_RD_LAUSCR(base) |  (value)))
#define LCDC_CLR_LAUSCR(base, value) (LCDC_WR_LAUSCR(base, LCDC_RD_LAUSCR(base) & ~(value)))
#define LCDC_TOG_LAUSCR(base, value) (LCDC_WR_LAUSCR(base, LCDC_RD_LAUSCR(base) ^  (value)))
/*@}*/

