pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual LCDC_LAUSCR bitfields
 */

/*!
 * @name Register LCDC_LAUSCR, field AGWCKB[7:0] (RW)
 *
 * Defines the blue component of graphic window color keying (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCR_AGWCKB field. */
#define LCDC_RD_LAUSCR_AGWCKB(base) ((LCDC_LAUSCR_REG(base) & LCDC_LAUSCR_AGWCKB_MASK) >> LCDC_LAUSCR_AGWCKB_SHIFT)
#define LCDC_BRD_LAUSCR_AGWCKB(base) (LCDC_RD_LAUSCR_AGWCKB(base))

/*! @brief Set the AGWCKB field to a new value. */
#define LCDC_WR_LAUSCR_AGWCKB(base, value) (LCDC_RMW_LAUSCR(base, LCDC_LAUSCR_AGWCKB_MASK, LCDC_LAUSCR_AGWCKB(value)))
#define LCDC_BWR_LAUSCR_AGWCKB(base, value) (LCDC_WR_LAUSCR_AGWCKB(base, value))
/*@}*/

/*!
 * @name Register LCDC_LAUSCR, field AGWCKG[15:8] (RW)
 *
 * Defines the green component of graphic window color keying (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCR_AGWCKG field. */
#define LCDC_RD_LAUSCR_AGWCKG(base) ((LCDC_LAUSCR_REG(base) & LCDC_LAUSCR_AGWCKG_MASK) >> LCDC_LAUSCR_AGWCKG_SHIFT)
#define LCDC_BRD_LAUSCR_AGWCKG(base) (LCDC_RD_LAUSCR_AGWCKG(base))

/*! @brief Set the AGWCKG field to a new value. */
#define LCDC_WR_LAUSCR_AGWCKG(base, value) (LCDC_RMW_LAUSCR(base, LCDC_LAUSCR_AGWCKG_MASK, LCDC_LAUSCR_AGWCKG(value)))
#define LCDC_BWR_LAUSCR_AGWCKG(base, value) (LCDC_WR_LAUSCR_AGWCKG(base, value))
/*@}*/

/*!
 * @name Register LCDC_LAUSCR, field AGWCKR[23:16] (RW)
 *
 * Defines the red component of graphic window color keying (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCR_AGWCKR field. */
#define LCDC_RD_LAUSCR_AGWCKR(base) ((LCDC_LAUSCR_REG(base) & LCDC_LAUSCR_AGWCKR_MASK) >> LCDC_LAUSCR_AGWCKR_SHIFT)
#define LCDC_BRD_LAUSCR_AGWCKR(base) (LCDC_RD_LAUSCR_AGWCKR(base))

/*! @brief Set the AGWCKR field to a new value. */
#define LCDC_WR_LAUSCR_AGWCKR(base, value) (LCDC_RMW_LAUSCR(base, LCDC_LAUSCR_AGWCKR_MASK, LCDC_LAUSCR_AGWCKR(value)))
#define LCDC_BWR_LAUSCR_AGWCKR(base, value) (LCDC_WR_LAUSCR_AGWCKR(base, value))
/*@}*/

/*!
 * @name Register LCDC_LAUSCR, field AUS_Mode[31] (RW)
 *
 * Determines whether LCDC enters AUS mode or not. When BPIX = 101, supports 16
 * bpp AUO panel. When BPIX = 110, supports 24 bpp AUO panel.
 *
 * Values:
 * - 0 - Normal mode
 * - 1 - AUS mode
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCR_AUS_Mode field. */
#define LCDC_RD_LAUSCR_AUS_Mode(base) ((LCDC_LAUSCR_REG(base) & LCDC_LAUSCR_AUS_Mode_MASK) >> LCDC_LAUSCR_AUS_Mode_SHIFT)
#define LCDC_BRD_LAUSCR_AUS_Mode(base) (BITBAND_ACCESS32(&LCDC_LAUSCR_REG(base), LCDC_LAUSCR_AUS_Mode_SHIFT))

/*! @brief Set the AUS_Mode field to a new value. */
#define LCDC_WR_LAUSCR_AUS_Mode(base, value) (LCDC_RMW_LAUSCR(base, LCDC_LAUSCR_AUS_Mode_MASK, LCDC_LAUSCR_AUS_Mode(value)))
#define LCDC_BWR_LAUSCR_AUS_Mode(base, value) (BITBAND_ACCESS32(&LCDC_LAUSCR_REG(base), LCDC_LAUSCR_AUS_Mode_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCDC_LAUSCCR - LCDC AUS mode cursor control register
 ******************************************************************************/

/*!
 * @brief LCDC_LAUSCCR - LCDC AUS mode cursor control register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register determines the color map of cursor in AUS mode. In 16 bpp mode,
 * this register uses bits [21:17] for Red, [13:8] for Green, and [5:1] for Blue.
 */
/*!
 * @name Constants and macros for entire LCDC_LAUSCCR register
 */
/*@{*/
#define LCDC_RD_LAUSCCR(base)    (LCDC_LAUSCCR_REG(base))
#define LCDC_WR_LAUSCCR(base, value) (LCDC_LAUSCCR_REG(base) = (value))
#define LCDC_RMW_LAUSCCR(base, mask, value) (LCDC_WR_LAUSCCR(base, (LCDC_RD_LAUSCCR(base) & ~(mask)) | (value)))
#define LCDC_SET_LAUSCCR(base, value) (LCDC_WR_LAUSCCR(base, LCDC_RD_LAUSCCR(base) |  (value)))
#define LCDC_CLR_LAUSCCR(base, value) (LCDC_WR_LAUSCCR(base, LCDC_RD_LAUSCCR(base) & ~(value)))
#define LCDC_TOG_LAUSCCR(base, value) (LCDC_WR_LAUSCCR(base, LCDC_RD_LAUSCCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCDC_LAUSCCR bitfields
 */

/*!
 * @name Register LCDC_LAUSCCR, field ACUR_COL_B[7:0] (RW)
 *
 * Defines the blue component of cursor color in color mode (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCCR_ACUR_COL_B field. */
#define LCDC_RD_LAUSCCR_ACUR_COL_B(base) ((LCDC_LAUSCCR_REG(base) & LCDC_LAUSCCR_ACUR_COL_B_MASK) >> LCDC_LAUSCCR_ACUR_COL_B_SHIFT)
#define LCDC_BRD_LAUSCCR_ACUR_COL_B(base) (LCDC_RD_LAUSCCR_ACUR_COL_B(base))

/*! @brief Set the ACUR_COL_B field to a new value. */
#define LCDC_WR_LAUSCCR_ACUR_COL_B(base, value) (LCDC_RMW_LAUSCCR(base, LCDC_LAUSCCR_ACUR_COL_B_MASK, LCDC_LAUSCCR_ACUR_COL_B(value)))
#define LCDC_BWR_LAUSCCR_ACUR_COL_B(base, value) (LCDC_WR_LAUSCCR_ACUR_COL_B(base, value))
/*@}*/

/*!
 * @name Register LCDC_LAUSCCR, field ACUR_COL_G[15:8] (RW)
 *
 * Defines the green component of cursor color in color mode (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCCR_ACUR_COL_G field. */
#define LCDC_RD_LAUSCCR_ACUR_COL_G(base) ((LCDC_LAUSCCR_REG(base) & LCDC_LAUSCCR_ACUR_COL_G_MASK) >> LCDC_LAUSCCR_ACUR_COL_G_SHIFT)
#define LCDC_BRD_LAUSCCR_ACUR_COL_G(base) (LCDC_RD_LAUSCCR_ACUR_COL_G(base))

/*! @brief Set the ACUR_COL_G field to a new value. */
#define LCDC_WR_LAUSCCR_ACUR_COL_G(base, value) (LCDC_RMW_LAUSCCR(base, LCDC_LAUSCCR_ACUR_COL_G_MASK, LCDC_LAUSCCR_ACUR_COL_G(value)))
#define LCDC_BWR_LAUSCCR_ACUR_COL_G(base, value) (LCDC_WR_LAUSCCR_ACUR_COL_G(base, value))
/*@}*/

/*!
 * @name Register LCDC_LAUSCCR, field ACUR_COL_R[23:16] (RW)
 *
 * Defines the red component of cursor color in color mode (AUS mode only).
 */
/*@{*/
/*! @brief Read current value of the LCDC_LAUSCCR_ACUR_COL_R field. */
#define LCDC_RD_LAUSCCR_ACUR_COL_R(base) ((LCDC_LAUSCCR_REG(base) & LCDC_LAUSCCR_ACUR_COL_R_MASK) >> LCDC_LAUSCCR_ACUR_COL_R_SHIFT)
#define LCDC_BRD_LAUSCCR_ACUR_COL_R(base) (LCDC_RD_LAUSCCR_ACUR_COL_R(base))

/*! @brief Set the ACUR_COL_R field to a new value. */
#define LCDC_WR_LAUSCCR_ACUR_COL_R(base, value) (LCDC_RMW_LAUSCCR(base, LCDC_LAUSCCR_ACUR_COL_R_MASK, LCDC_LAUSCCR_ACUR_COL_R(value)))
#define LCDC_BWR_LAUSCCR_ACUR_COL_R(base, value) (LCDC_WR_LAUSCCR_ACUR_COL_R(base, value))
/*@}*/

