pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the CACHEADDR field to a new value. */
#define LMEM_WR_PCCLCR_CACHEADDR(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_CACHEADDR_MASK, LMEM_PCCLCR_CACHEADDR(value)))
#define LMEM_BWR_PCCLCR_CACHEADDR(base, value) (LMEM_WR_PCCLCR_CACHEADDR(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field WSEL[14] (RW)
 *
 * Selects the way for line commands.
 *
 * Values:
 * - 0 - Way 0
 * - 1 - Way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_WSEL field. */
#define LMEM_RD_PCCLCR_WSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_WSEL_MASK) >> LMEM_PCCLCR_WSEL_SHIFT)
#define LMEM_BRD_PCCLCR_WSEL(base) (LMEM_RD_PCCLCR_WSEL(base))

/*! @brief Set the WSEL field to a new value. */
#define LMEM_WR_PCCLCR_WSEL(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_WSEL_MASK, LMEM_PCCLCR_WSEL(value)))
#define LMEM_BWR_PCCLCR_WSEL(base, value) (LMEM_WR_PCCLCR_WSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field TDSEL[16] (RW)
 *
 * Selects tag or data for search and read or write commands.
 *
 * Values:
 * - 0 - Data
 * - 1 - Tag
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_TDSEL field. */
#define LMEM_RD_PCCLCR_TDSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_TDSEL_MASK) >> LMEM_PCCLCR_TDSEL_SHIFT)
#define LMEM_BRD_PCCLCR_TDSEL(base) (LMEM_RD_PCCLCR_TDSEL(base))

/*! @brief Set the TDSEL field to a new value. */
#define LMEM_WR_PCCLCR_TDSEL(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_TDSEL_MASK, LMEM_PCCLCR_TDSEL(value)))
#define LMEM_BWR_PCCLCR_TDSEL(base, value) (LMEM_WR_PCCLCR_TDSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCIVB[20] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the valid bit If command used physical address and a hit, then this bit
 * shows the initial state of the valid bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCIVB field. */
#define LMEM_RD_PCCLCR_LCIVB(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCIVB_MASK) >> LMEM_PCCLCR_LCIVB_SHIFT)
#define LMEM_BRD_PCCLCR_LCIVB(base) (LMEM_RD_PCCLCR_LCIVB(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCIMB[21] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the modified bit If command used physical address and a hit, then this bit
 * shows the initial state of the modified bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCIMB field. */
#define LMEM_RD_PCCLCR_LCIMB(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCIMB_MASK) >> LMEM_PCCLCR_LCIMB_SHIFT)
#define LMEM_BRD_PCCLCR_LCIMB(base) (LMEM_RD_PCCLCR_LCIMB(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCWAY[22] (RO)
 *
 * Indicates the way used by the line command.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCWAY field. */
#define LMEM_RD_PCCLCR_LCWAY(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCWAY_MASK) >> LMEM_PCCLCR_LCWAY_SHIFT)
#define LMEM_BRD_PCCLCR_LCWAY(base) (LMEM_RD_PCCLCR_LCWAY(base))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LCMD[25:24] (RW)
 *
 * Values:
 * - 00 - Search and read or write
 * - 01 - Invalidate
 * - 10 - Push
 * - 11 - Clear
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LCMD field. */
#define LMEM_RD_PCCLCR_LCMD(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LCMD_MASK) >> LMEM_PCCLCR_LCMD_SHIFT)
#define LMEM_BRD_PCCLCR_LCMD(base) (LMEM_RD_PCCLCR_LCMD(base))

/*! @brief Set the LCMD field to a new value. */
#define LMEM_WR_PCCLCR_LCMD(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LCMD_MASK, LMEM_PCCLCR_LCMD(value)))
#define LMEM_BWR_PCCLCR_LCMD(base, value) (LMEM_WR_PCCLCR_LCMD(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LADSEL[26] (RW)
 *
 * When using the cache address, the way must also be specified in CLCR[WSEL].
 * When using the physical address, both ways are searched and the command is
 * performed only if a hit.
 *
 * Values:
 * - 0 - Cache address
 * - 1 - Physical address
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LADSEL field. */
#define LMEM_RD_PCCLCR_LADSEL(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LADSEL_MASK) >> LMEM_PCCLCR_LADSEL_SHIFT)
#define LMEM_BRD_PCCLCR_LADSEL(base) (LMEM_RD_PCCLCR_LADSEL(base))

/*! @brief Set the LADSEL field to a new value. */
#define LMEM_WR_PCCLCR_LADSEL(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LADSEL_MASK, LMEM_PCCLCR_LADSEL(value)))
#define LMEM_BWR_PCCLCR_LADSEL(base, value) (LMEM_WR_PCCLCR_LADSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCLCR, field LACC[27] (RW)
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCLCR_LACC field. */
#define LMEM_RD_PCCLCR_LACC(base) ((LMEM_PCCLCR_REG(base) & LMEM_PCCLCR_LACC_MASK) >> LMEM_PCCLCR_LACC_SHIFT)
#define LMEM_BRD_PCCLCR_LACC(base) (LMEM_RD_PCCLCR_LACC(base))

/*! @brief Set the LACC field to a new value. */
#define LMEM_WR_PCCLCR_LACC(base, value) (LMEM_RMW_PCCLCR(base, LMEM_PCCLCR_LACC_MASK, LMEM_PCCLCR_LACC(value)))
#define LMEM_BWR_PCCLCR_LACC(base, value) (LMEM_WR_PCCLCR_LACC(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PCCSAR - Cache search address register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCSAR - Cache search address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CSAR register is used to define the explicit cache address or the
 * physical address for line-sized commands specified in the CLCR[LADSEL] bit.
 */
/*!
 * @name Constants and macros for entire LMEM_PCCSAR register
 */
/*@{*/
#define LMEM_RD_PCCSAR(base)     (LMEM_PCCSAR_REG(base))
#define LMEM_WR_PCCSAR(base, value) (LMEM_PCCSAR_REG(base) = (value))
#define LMEM_RMW_PCCSAR(base, mask, value) (LMEM_WR_PCCSAR(base, (LMEM_RD_PCCSAR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCSAR(base, value) (LMEM_WR_PCCSAR(base, LMEM_RD_PCCSAR(base) |  (value)))
#define LMEM_CLR_PCCSAR(base, value) (LMEM_WR_PCCSAR(base, LMEM_RD_PCCSAR(base) & ~(value)))
#define LMEM_TOG_PCCSAR(base, value) (LMEM_WR_PCCSAR(base, LMEM_RD_PCCSAR(base) ^  (value)))
/*@}*/

