pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual LMEM_PCCSAR bitfields
 */

/*!
 * @name Register LMEM_PCCSAR, field LGO[0] (RW)
 *
 * Setting this bit initiates the cache line command indicated by bits 27-24.
 * Reading this bit indicates if a line command is active This bit stays set until
 * the command completes. Writing zero has no effect. This bit is shared with
 * CLCR[LGO]
 *
 * Values:
 * - 0 - Write: no effect. Read: no line command active.
 * - 1 - Write: initiate line command indicated by bits CLCR[27:24]. Read: line
 *     command active.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCSAR_LGO field. */
#define LMEM_RD_PCCSAR_LGO(base) ((LMEM_PCCSAR_REG(base) & LMEM_PCCSAR_LGO_MASK) >> LMEM_PCCSAR_LGO_SHIFT)
#define LMEM_BRD_PCCSAR_LGO(base) (LMEM_RD_PCCSAR_LGO(base))

/*! @brief Set the LGO field to a new value. */
#define LMEM_WR_PCCSAR_LGO(base, value) (LMEM_RMW_PCCSAR(base, LMEM_PCCSAR_LGO_MASK, LMEM_PCCSAR_LGO(value)))
#define LMEM_BWR_PCCSAR_LGO(base, value) (LMEM_WR_PCCSAR_LGO(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCSAR, field PHYADDR[31:2] (RW)
 *
 * PHYADDR represents bits [31:2] of the system address. CSAR[31:12] bits are
 * used for tag compare CSAR[11:4] bits are used to access the tag arrays
 * CSAR[11:2] bits are used to access the data arrays
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCSAR_PHYADDR field. */
#define LMEM_RD_PCCSAR_PHYADDR(base) ((LMEM_PCCSAR_REG(base) & LMEM_PCCSAR_PHYADDR_MASK) >> LMEM_PCCSAR_PHYADDR_SHIFT)
#define LMEM_BRD_PCCSAR_PHYADDR(base) (LMEM_RD_PCCSAR_PHYADDR(base))

/*! @brief Set the PHYADDR field to a new value. */
#define LMEM_WR_PCCSAR_PHYADDR(base, value) (LMEM_RMW_PCCSAR(base, LMEM_PCCSAR_PHYADDR_MASK, LMEM_PCCSAR_PHYADDR(value)))
#define LMEM_BWR_PCCSAR_PHYADDR(base, value) (LMEM_WR_PCCSAR_PHYADDR(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PCCCVR - Cache read/write value register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCCVR - Cache read/write value register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CCVR register is used to source write data or return read data for the
 * commands specified in the CLCR register.
 */
/*!
 * @name Constants and macros for entire LMEM_PCCCVR register
 */
/*@{*/
#define LMEM_RD_PCCCVR(base)     (LMEM_PCCCVR_REG(base))
#define LMEM_WR_PCCCVR(base, value) (LMEM_PCCCVR_REG(base) = (value))
#define LMEM_RMW_PCCCVR(base, mask, value) (LMEM_WR_PCCCVR(base, (LMEM_RD_PCCCVR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCCVR(base, value) (LMEM_WR_PCCCVR(base, LMEM_RD_PCCCVR(base) |  (value)))
#define LMEM_CLR_PCCCVR(base, value) (LMEM_WR_PCCCVR(base, LMEM_RD_PCCCVR(base) & ~(value)))
#define LMEM_TOG_PCCCVR(base, value) (LMEM_WR_PCCCVR(base, LMEM_RD_PCCCVR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * LMEM_PCCRMR - Cache regions mode register
 ******************************************************************************/

/*!
 * @brief LMEM_PCCRMR - Cache regions mode register (RW)
 *
 * Reset value: 0xAA0FA000U
 *
 * The CRMR register allows you to demote the cache mode of various subregions
 * within the device's memory map. Demoting the cache mode reduces the cache
 * function applied to a memory region from write-back to write-through to
 * non-cacheable. After a region is demoted, its cache mode can only be raised by a reset,
 * which returns it to its default state. To maintain cache coherency, changes to
 * the cache mode should be completed while the address space being changed is
 * not being accessed or the cache is disabled. Before a cache mode change,
 * complete a cache clear all command to push and invalidate any cache entries that may
 * have changed. The address/module assignment of the 16 subregions is
 * device-specific and are detailed in the Chip Configuration section. Some of the regions
 * may not be used (non-cacheable), and some regions may not be capable of
 * write-back.
 */
/*!
 * @name Constants and macros for entire LMEM_PCCRMR register
 */
/*@{*/
#define LMEM_RD_PCCRMR(base)     (LMEM_PCCRMR_REG(base))
#define LMEM_WR_PCCRMR(base, value) (LMEM_PCCRMR_REG(base) = (value))
#define LMEM_RMW_PCCRMR(base, mask, value) (LMEM_WR_PCCRMR(base, (LMEM_RD_PCCRMR(base) & ~(mask)) | (value)))
#define LMEM_SET_PCCRMR(base, value) (LMEM_WR_PCCRMR(base, LMEM_RD_PCCRMR(base) |  (value)))
#define LMEM_CLR_PCCRMR(base, value) (LMEM_WR_PCCRMR(base, LMEM_RD_PCCRMR(base) & ~(value)))
#define LMEM_TOG_PCCRMR(base, value) (LMEM_WR_PCCRMR(base, LMEM_RD_PCCRMR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LMEM_PCCRMR bitfields
 */

/*!
 * @name Register LMEM_PCCRMR, field R15[1:0] (RW)
 *
 * Controls the cache mode for region 15
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R15 field. */
#define LMEM_RD_PCCRMR_R15(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R15_MASK) >> LMEM_PCCRMR_R15_SHIFT)
#define LMEM_BRD_PCCRMR_R15(base) (LMEM_RD_PCCRMR_R15(base))

/*! @brief Set the R15 field to a new value. */
#define LMEM_WR_PCCRMR_R15(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R15_MASK, LMEM_PCCRMR_R15(value)))
#define LMEM_BWR_PCCRMR_R15(base, value) (LMEM_WR_PCCRMR_R15(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R14[3:2] (RW)
 *
 * Controls the cache mode for region 14
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R14 field. */
#define LMEM_RD_PCCRMR_R14(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R14_MASK) >> LMEM_PCCRMR_R14_SHIFT)
#define LMEM_BRD_PCCRMR_R14(base) (LMEM_RD_PCCRMR_R14(base))

/*! @brief Set the R14 field to a new value. */
#define LMEM_WR_PCCRMR_R14(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R14_MASK, LMEM_PCCRMR_R14(value)))
#define LMEM_BWR_PCCRMR_R14(base, value) (LMEM_WR_PCCRMR_R14(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R13[5:4] (RW)
 *
 * Controls the cache mode for region 13
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R13 field. */
#define LMEM_RD_PCCRMR_R13(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R13_MASK) >> LMEM_PCCRMR_R13_SHIFT)
#define LMEM_BRD_PCCRMR_R13(base) (LMEM_RD_PCCRMR_R13(base))

/*! @brief Set the R13 field to a new value. */
#define LMEM_WR_PCCRMR_R13(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R13_MASK, LMEM_PCCRMR_R13(value)))
#define LMEM_BWR_PCCRMR_R13(base, value) (LMEM_WR_PCCRMR_R13(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R12[7:6] (RW)
 *
 * Controls the cache mode for region 12
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R12 field. */
#define LMEM_RD_PCCRMR_R12(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R12_MASK) >> LMEM_PCCRMR_R12_SHIFT)
#define LMEM_BRD_PCCRMR_R12(base) (LMEM_RD_PCCRMR_R12(base))

/*! @brief Set the R12 field to a new value. */
#define LMEM_WR_PCCRMR_R12(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R12_MASK, LMEM_PCCRMR_R12(value)))
#define LMEM_BWR_PCCRMR_R12(base, value) (LMEM_WR_PCCRMR_R12(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R11[9:8] (RW)
 *
 * Controls the cache mode for region 11
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R11 field. */
#define LMEM_RD_PCCRMR_R11(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R11_MASK) >> LMEM_PCCRMR_R11_SHIFT)
#define LMEM_BRD_PCCRMR_R11(base) (LMEM_RD_PCCRMR_R11(base))

/*! @brief Set the R11 field to a new value. */
#define LMEM_WR_PCCRMR_R11(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R11_MASK, LMEM_PCCRMR_R11(value)))
#define LMEM_BWR_PCCRMR_R11(base, value) (LMEM_WR_PCCRMR_R11(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R10[11:10] (RW)
 *
 * Controls the cache mode for region 10
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R10 field. */
#define LMEM_RD_PCCRMR_R10(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R10_MASK) >> LMEM_PCCRMR_R10_SHIFT)
#define LMEM_BRD_PCCRMR_R10(base) (LMEM_RD_PCCRMR_R10(base))

/*! @brief Set the R10 field to a new value. */
#define LMEM_WR_PCCRMR_R10(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R10_MASK, LMEM_PCCRMR_R10(value)))
#define LMEM_BWR_PCCRMR_R10(base, value) (LMEM_WR_PCCRMR_R10(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R9[13:12] (RW)
 *
 * Controls the cache mode for region 9
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R9 field. */
#define LMEM_RD_PCCRMR_R9(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R9_MASK) >> LMEM_PCCRMR_R9_SHIFT)
#define LMEM_BRD_PCCRMR_R9(base) (LMEM_RD_PCCRMR_R9(base))

/*! @brief Set the R9 field to a new value. */
#define LMEM_WR_PCCRMR_R9(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R9_MASK, LMEM_PCCRMR_R9(value)))
#define LMEM_BWR_PCCRMR_R9(base, value) (LMEM_WR_PCCRMR_R9(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R8[15:14] (RW)
 *
 * Controls the cache mode for region 8
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R8 field. */
#define LMEM_RD_PCCRMR_R8(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R8_MASK) >> LMEM_PCCRMR_R8_SHIFT)
#define LMEM_BRD_PCCRMR_R8(base) (LMEM_RD_PCCRMR_R8(base))

/*! @brief Set the R8 field to a new value. */
#define LMEM_WR_PCCRMR_R8(base, value) (LMEM_RMW_PCCRMR(base, LMEM_PCCRMR_R8_MASK, LMEM_PCCRMR_R8(value)))
#define LMEM_BWR_PCCRMR_R8(base, value) (LMEM_WR_PCCRMR_R8(base, value))
/*@}*/

/*!
 * @name Register LMEM_PCCRMR, field R7[17:16] (RW)
 *
 * Controls the cache mode for region 7
 *
 * Values:
 * - 00 - Non-cacheable
 * - 01 - Non-cacheable
 * - 10 - Write-through
 * - 11 - Write-back
 */
/*@{*/
/*! @brief Read current value of the LMEM_PCCRMR_R7 field. */
#define LMEM_RD_PCCRMR_R7(base) ((LMEM_PCCRMR_REG(base) & LMEM_PCCRMR_R7_MASK) >> LMEM_PCCRMR_R7_SHIFT)
#define LMEM_BRD_PCCRMR_R7(base) (LMEM_RD_PCCRMR_R7(base))

