pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the CACHEADDR field to a new value. */
#define LMEM_WR_PSCLCR_CACHEADDR(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_CACHEADDR_MASK, LMEM_PSCLCR_CACHEADDR(value)))
#define LMEM_BWR_PSCLCR_CACHEADDR(base, value) (LMEM_WR_PSCLCR_CACHEADDR(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field WSEL[14] (RW)
 *
 * Selects the way for line commands.
 *
 * Values:
 * - 0 - Way 0
 * - 1 - Way 1
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_WSEL field. */
#define LMEM_RD_PSCLCR_WSEL(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_WSEL_MASK) >> LMEM_PSCLCR_WSEL_SHIFT)
#define LMEM_BRD_PSCLCR_WSEL(base) (LMEM_RD_PSCLCR_WSEL(base))

/*! @brief Set the WSEL field to a new value. */
#define LMEM_WR_PSCLCR_WSEL(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_WSEL_MASK, LMEM_PSCLCR_WSEL(value)))
#define LMEM_BWR_PSCLCR_WSEL(base, value) (LMEM_WR_PSCLCR_WSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field TDSEL[16] (RW)
 *
 * Selects tag or data for search and read or write commands.
 *
 * Values:
 * - 0 - Data
 * - 1 - Tag
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_TDSEL field. */
#define LMEM_RD_PSCLCR_TDSEL(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_TDSEL_MASK) >> LMEM_PSCLCR_TDSEL_SHIFT)
#define LMEM_BRD_PSCLCR_TDSEL(base) (LMEM_RD_PSCLCR_TDSEL(base))

/*! @brief Set the TDSEL field to a new value. */
#define LMEM_WR_PSCLCR_TDSEL(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_TDSEL_MASK, LMEM_PSCLCR_TDSEL(value)))
#define LMEM_BWR_PSCLCR_TDSEL(base, value) (LMEM_WR_PSCLCR_TDSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LCIVB[20] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the valid bit If command used physical address and a hit, then this bit
 * shows the initial state of the valid bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LCIVB field. */
#define LMEM_RD_PSCLCR_LCIVB(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LCIVB_MASK) >> LMEM_PSCLCR_LCIVB_SHIFT)
#define LMEM_BRD_PSCLCR_LCIVB(base) (LMEM_RD_PSCLCR_LCIVB(base))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LCIMB[21] (RO)
 *
 * If command used cache address and way, then this bit shows the initial state
 * of the modified bit If command used physical address and a hit, then this bit
 * shows the initial state of the modified bit. If a miss, this bit reads zero.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LCIMB field. */
#define LMEM_RD_PSCLCR_LCIMB(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LCIMB_MASK) >> LMEM_PSCLCR_LCIMB_SHIFT)
#define LMEM_BRD_PSCLCR_LCIMB(base) (LMEM_RD_PSCLCR_LCIMB(base))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LCWAY[22] (RO)
 *
 * Indicates the way used by the line command.
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LCWAY field. */
#define LMEM_RD_PSCLCR_LCWAY(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LCWAY_MASK) >> LMEM_PSCLCR_LCWAY_SHIFT)
#define LMEM_BRD_PSCLCR_LCWAY(base) (LMEM_RD_PSCLCR_LCWAY(base))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LCMD[25:24] (RW)
 *
 * Values:
 * - 00 - Search and read or write
 * - 01 - Invalidate
 * - 10 - Push
 * - 11 - Clear
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LCMD field. */
#define LMEM_RD_PSCLCR_LCMD(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LCMD_MASK) >> LMEM_PSCLCR_LCMD_SHIFT)
#define LMEM_BRD_PSCLCR_LCMD(base) (LMEM_RD_PSCLCR_LCMD(base))

/*! @brief Set the LCMD field to a new value. */
#define LMEM_WR_PSCLCR_LCMD(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_LCMD_MASK, LMEM_PSCLCR_LCMD(value)))
#define LMEM_BWR_PSCLCR_LCMD(base, value) (LMEM_WR_PSCLCR_LCMD(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LADSEL[26] (RW)
 *
 * When using the cache address, the way must also be specified in CLCR[WSEL].
 * When using the physical address, both ways are searched and the command is
 * performed only if a hit.
 *
 * Values:
 * - 0 - Cache address
 * - 1 - Physical address
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LADSEL field. */
#define LMEM_RD_PSCLCR_LADSEL(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LADSEL_MASK) >> LMEM_PSCLCR_LADSEL_SHIFT)
#define LMEM_BRD_PSCLCR_LADSEL(base) (LMEM_RD_PSCLCR_LADSEL(base))

/*! @brief Set the LADSEL field to a new value. */
#define LMEM_WR_PSCLCR_LADSEL(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_LADSEL_MASK, LMEM_PSCLCR_LADSEL(value)))
#define LMEM_BWR_PSCLCR_LADSEL(base, value) (LMEM_WR_PSCLCR_LADSEL(base, value))
/*@}*/

/*!
 * @name Register LMEM_PSCLCR, field LACC[27] (RW)
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
/*@{*/
/*! @brief Read current value of the LMEM_PSCLCR_LACC field. */
#define LMEM_RD_PSCLCR_LACC(base) ((LMEM_PSCLCR_REG(base) & LMEM_PSCLCR_LACC_MASK) >> LMEM_PSCLCR_LACC_SHIFT)
#define LMEM_BRD_PSCLCR_LACC(base) (LMEM_RD_PSCLCR_LACC(base))

/*! @brief Set the LACC field to a new value. */
#define LMEM_WR_PSCLCR_LACC(base, value) (LMEM_RMW_PSCLCR(base, LMEM_PSCLCR_LACC_MASK, LMEM_PSCLCR_LACC(value)))
#define LMEM_BWR_PSCLCR_LACC(base, value) (LMEM_WR_PSCLCR_LACC(base, value))
/*@}*/

/*******************************************************************************
 * LMEM_PSCSAR - Cache search address register
 ******************************************************************************/

/*!
 * @brief LMEM_PSCSAR - Cache search address register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The CSAR register is used to define the explicit cache address or the
 * physical address for line-sized commands specified in the CLCR[LADSEL] bit.
 */
/*!
 * @name Constants and macros for entire LMEM_PSCSAR register
 */
/*@{*/
#define LMEM_RD_PSCSAR(base)     (LMEM_PSCSAR_REG(base))
#define LMEM_WR_PSCSAR(base, value) (LMEM_PSCSAR_REG(base) = (value))
#define LMEM_RMW_PSCSAR(base, mask, value) (LMEM_WR_PSCSAR(base, (LMEM_RD_PSCSAR(base) & ~(mask)) | (value)))
#define LMEM_SET_PSCSAR(base, value) (LMEM_WR_PSCSAR(base, LMEM_RD_PSCSAR(base) |  (value)))
#define LMEM_CLR_PSCSAR(base, value) (LMEM_WR_PSCSAR(base, LMEM_RD_PSCSAR(base) & ~(value)))
#define LMEM_TOG_PSCSAR(base, value) (LMEM_WR_PSCSAR(base, LMEM_RD_PSCSAR(base) ^  (value)))
/*@}*/

