pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * MCG_C10 - MCG Control 10 Register
 ******************************************************************************/

/*!
 * @brief MCG_C10 - MCG Control 10 Register (RW)
 *
 * Reset value: 0x80U
 */
/*!
 * @name Constants and macros for entire MCG_C10 register
 */
/*@{*/
#define MCG_RD_C10(base)         (MCG_C10_REG(base))
#define MCG_WR_C10(base, value)  (MCG_C10_REG(base) = (value))
#define MCG_RMW_C10(base, mask, value) (MCG_WR_C10(base, (MCG_RD_C10(base) & ~(mask)) | (value)))
#define MCG_SET_C10(base, value) (MCG_WR_C10(base, MCG_RD_C10(base) |  (value)))
#define MCG_CLR_C10(base, value) (MCG_WR_C10(base, MCG_RD_C10(base) & ~(value)))
#define MCG_TOG_C10(base, value) (MCG_WR_C10(base, MCG_RD_C10(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C10 bitfields
 */

/*!
 * @name Register MCG_C10, field EREFS1[2] (RW)
 *
 * Selects the source for the OSC1 external reference clock. Refer to the
 * Oscillator chapter for more details.
 *
 * Values:
 * - 0 - External reference clock requested.
 * - 1 - Oscillator requested.
 */
/*@{*/
/*! @brief Read current value of the MCG_C10_EREFS1 field. */
#define MCG_RD_C10_EREFS1(base) ((MCG_C10_REG(base) & MCG_C10_EREFS1_MASK) >> MCG_C10_EREFS1_SHIFT)
#define MCG_BRD_C10_EREFS1(base) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_EREFS1_SHIFT))

/*! @brief Set the EREFS1 field to a new value. */
#define MCG_WR_C10_EREFS1(base, value) (MCG_RMW_C10(base, MCG_C10_EREFS1_MASK, MCG_C10_EREFS1(value)))
#define MCG_BWR_C10_EREFS1(base, value) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_EREFS1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C10, field HGO1[3] (RW)
 *
 * Controls the OSC1 crystal oscillator mode of operation Refer to the
 * Oscillator chapter for more details.
 *
 * Values:
 * - 0 - Configure crystal oscillator for low-power operation.
 * - 1 - Configure crystal oscillator for high-gain operation.
 */
/*@{*/
/*! @brief Read current value of the MCG_C10_HGO1 field. */
#define MCG_RD_C10_HGO1(base) ((MCG_C10_REG(base) & MCG_C10_HGO1_MASK) >> MCG_C10_HGO1_SHIFT)
#define MCG_BRD_C10_HGO1(base) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_HGO1_SHIFT))

/*! @brief Set the HGO1 field to a new value. */
#define MCG_WR_C10_HGO1(base, value) (MCG_RMW_C10(base, MCG_C10_HGO1_MASK, MCG_C10_HGO1(value)))
#define MCG_BWR_C10_HGO1(base, value) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_HGO1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C10, field RANGE1[5:4] (RW)
 *
 * Selects the frequency range for the OSC1 crystal oscillator or external clock
 * source. Refer to the Oscillator chapter for more details and the device data
 * sheet for the frequency ranges used.
 *
 * Values:
 * - 00 - Encoding 0 - Low frequency range selected for the crystal oscillator .
 * - 01 - Encoding 1 - High frequency range selected for the crystal oscillator .
 */
/*@{*/
/*! @brief Read current value of the MCG_C10_RANGE1 field. */
#define MCG_RD_C10_RANGE1(base) ((MCG_C10_REG(base) & MCG_C10_RANGE1_MASK) >> MCG_C10_RANGE1_SHIFT)
#define MCG_BRD_C10_RANGE1(base) (MCG_RD_C10_RANGE1(base))

/*! @brief Set the RANGE1 field to a new value. */
#define MCG_WR_C10_RANGE1(base, value) (MCG_RMW_C10(base, MCG_C10_RANGE1_MASK, MCG_C10_RANGE1(value)))
#define MCG_BWR_C10_RANGE1(base, value) (MCG_WR_C10_RANGE1(base, value))
/*@}*/

/*!
 * @name Register MCG_C10, field LOCRE2[7] (RW)
 *
 * Determines if a interrupt or reset request is made following a loss of OSC1
 * external reference clock. The LOCRE2 only has an affect when LOCS2 is set.
 *
 * Values:
 * - 0 - Interrupt request is generated on a loss of OSC1 external reference
 *     clock.
 * - 1 - Reset request is generated on a loss of OSC1 external reference clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_C10_LOCRE2 field. */
#define MCG_RD_C10_LOCRE2(base) ((MCG_C10_REG(base) & MCG_C10_LOCRE2_MASK) >> MCG_C10_LOCRE2_SHIFT)
#define MCG_BRD_C10_LOCRE2(base) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_LOCRE2_SHIFT))

/*! @brief Set the LOCRE2 field to a new value. */
#define MCG_WR_C10_LOCRE2(base, value) (MCG_RMW_C10(base, MCG_C10_LOCRE2_MASK, MCG_C10_LOCRE2(value)))
#define MCG_BWR_C10_LOCRE2(base, value) (BITBAND_ACCESS8(&MCG_C10_REG(base), MCG_C10_LOCRE2_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_C11 - MCG Control 11 Register
 ******************************************************************************/

/*!
 * @brief MCG_C11 - MCG Control 11 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C11 register
 */
/*@{*/
#define MCG_RD_C11(base)         (MCG_C11_REG(base))
#define MCG_WR_C11(base, value)  (MCG_C11_REG(base) = (value))
#define MCG_RMW_C11(base, mask, value) (MCG_WR_C11(base, (MCG_RD_C11(base) & ~(mask)) | (value)))
#define MCG_SET_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) |  (value)))
#define MCG_CLR_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) & ~(value)))
#define MCG_TOG_C11(base, value) (MCG_WR_C11(base, MCG_RD_C11(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C11 bitfields
 */

/*!
 * @name Register MCG_C11, field PRDIV1[2:0] (RW)
 *
 * Selects the amount to divide down the external reference clock selected by
 * REFSEL2 for PLL1. The resulting frequency must be in a valid reference range.
 * After the PLL1 is enabled (by setting either PLLCLKEN1 or PLLS), the PRDIV1
 * value must not be changed when LOCK1 is zero. PLL1 External Reference Divide
 * Factor PRDIV1 Divide Factor 000 1 001 2 010 3 011 4 100 5 101 6 110 7 111 8
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PRDIV1 field. */
#define MCG_RD_C11_PRDIV1(base) ((MCG_C11_REG(base) & MCG_C11_PRDIV1_MASK) >> MCG_C11_PRDIV1_SHIFT)
#define MCG_BRD_C11_PRDIV1(base) (MCG_RD_C11_PRDIV1(base))

/*! @brief Set the PRDIV1 field to a new value. */
#define MCG_WR_C11_PRDIV1(base, value) (MCG_RMW_C11(base, MCG_C11_PRDIV1_MASK, MCG_C11_PRDIV1(value)))
#define MCG_BWR_C11_PRDIV1(base, value) (MCG_WR_C11_PRDIV1(base, value))
/*@}*/

/*!
 * @name Register MCG_C11, field PLLCS[4] (RW)
 *
 * Controls whether the PLL0 or PLL1 output is selected as the MCG source when
 * CLKS are programmed in PLL Engaged External (PEE) mode (CLKS[1:0]=00 and
 * IREFS=0 and PLLS=1).
 *
 * Values:
 * - 0 - PLL0 output clock is selected.
 * - 1 - PLL1 output clock is selected.
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PLLCS field. */
#define MCG_RD_C11_PLLCS(base) ((MCG_C11_REG(base) & MCG_C11_PLLCS_MASK) >> MCG_C11_PLLCS_SHIFT)
#define MCG_BRD_C11_PLLCS(base) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCS_SHIFT))

/*! @brief Set the PLLCS field to a new value. */
#define MCG_WR_C11_PLLCS(base, value) (MCG_RMW_C11(base, MCG_C11_PLLCS_MASK, MCG_C11_PLLCS(value)))
#define MCG_BWR_C11_PLLCS(base, value) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C11, field PLLSTEN1[5] (RW)
 *
 * Enables the PLL1 Clock during Normal Stop (In Low Power Stop modes, the PLL1
 * clock gets disabled even if PLLSTEN1=1. All other power modes, PLLSTEN1 bit
 * has no affect and does not enable the PLL1 Clock to run if it is written to 1.
 *
 * Values:
 * - 0 - PLL1 clocks (MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X) are disabled in
 *     any of the Stop modes.
 * - 1 - PLL1 and its clocks (MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X) are
 *     enabled if system is in Normal Stop mode.
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PLLSTEN1 field. */
#define MCG_RD_C11_PLLSTEN1(base) ((MCG_C11_REG(base) & MCG_C11_PLLSTEN1_MASK) >> MCG_C11_PLLSTEN1_SHIFT)
#define MCG_BRD_C11_PLLSTEN1(base) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLSTEN1_SHIFT))

/*! @brief Set the PLLSTEN1 field to a new value. */
#define MCG_WR_C11_PLLSTEN1(base, value) (MCG_RMW_C11(base, MCG_C11_PLLSTEN1_MASK, MCG_C11_PLLSTEN1(value)))
#define MCG_BWR_C11_PLLSTEN1(base, value) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLSTEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C11, field PLLCLKEN1[6] (RW)
 *
 * Enables the PLL1 independent of PLLS and enables the PLL clocks for use as
 * MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X. (PRDIV1 needs to be programmed to the
 * correct divider to generate a PLL1 reference clock in a valid reference range
 * prior to setting the PLLCLKEN1 bit.) Setting PLLCLKEN1 will enable the PLL1
 * selected external oscillator if not already enabled. Whenever the PLL1 is being
 * enabled by means of the PLLCLKEN1 bit, and the external oscillator is being
 * used as the reference clock, the OSCINIT1 bit should be checked to make sure it
 * is set.
 *
 * Values:
 * - 0 - MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X are inactive
 * - 1 - MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X are active unless MCG is in a
 *     bypass mode with LP=1 (BLPI or BLPE).
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PLLCLKEN1 field. */
#define MCG_RD_C11_PLLCLKEN1(base) ((MCG_C11_REG(base) & MCG_C11_PLLCLKEN1_MASK) >> MCG_C11_PLLCLKEN1_SHIFT)
#define MCG_BRD_C11_PLLCLKEN1(base) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCLKEN1_SHIFT))

/*! @brief Set the PLLCLKEN1 field to a new value. */
#define MCG_WR_C11_PLLCLKEN1(base, value) (MCG_RMW_C11(base, MCG_C11_PLLCLKEN1_MASK, MCG_C11_PLLCLKEN1(value)))
#define MCG_BWR_C11_PLLCLKEN1(base, value) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLCLKEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C11, field PLLREFSEL1[7] (RW)
 *
 * Selects the PLL1 external reference clock source.
 *
 * Values:
 * - 0 - Selects OSC0 clock source as its external reference clock.
 * - 1 - Selects OSC1 clock source as its external reference clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_C11_PLLREFSEL1 field. */
#define MCG_RD_C11_PLLREFSEL1(base) ((MCG_C11_REG(base) & MCG_C11_PLLREFSEL1_MASK) >> MCG_C11_PLLREFSEL1_SHIFT)
#define MCG_BRD_C11_PLLREFSEL1(base) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLREFSEL1_SHIFT))

/*! @brief Set the PLLREFSEL1 field to a new value. */
#define MCG_WR_C11_PLLREFSEL1(base, value) (MCG_RMW_C11(base, MCG_C11_PLLREFSEL1_MASK, MCG_C11_PLLREFSEL1(value)))
#define MCG_BWR_C11_PLLREFSEL1(base, value) (BITBAND_ACCESS8(&MCG_C11_REG(base), MCG_C11_PLLREFSEL1_SHIFT) = (value))
/*@}*/

