pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * MCG_C12 - MCG Control 12 Register
 ******************************************************************************/

/*!
 * @brief MCG_C12 - MCG Control 12 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_C12 register
 */
/*@{*/
#define MCG_RD_C12(base)         (MCG_C12_REG(base))
#define MCG_WR_C12(base, value)  (MCG_C12_REG(base) = (value))
#define MCG_RMW_C12(base, mask, value) (MCG_WR_C12(base, (MCG_RD_C12(base) & ~(mask)) | (value)))
#define MCG_SET_C12(base, value) (MCG_WR_C12(base, MCG_RD_C12(base) |  (value)))
#define MCG_CLR_C12(base, value) (MCG_WR_C12(base, MCG_RD_C12(base) & ~(value)))
#define MCG_TOG_C12(base, value) (MCG_WR_C12(base, MCG_RD_C12(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_C12 bitfields
 */

/*!
 * @name Register MCG_C12, field VDIV1[4:0] (RW)
 *
 * Selects the amount to divide the VCO output of the PLL1. The VDIV1 bits
 * establish the multiplication factor (M) applied to the reference clock frequency.
 * After the PLL1 is enabled (by setting either PLLCLKEN1 or PLLS), the VDIV1
 * value must not be changed when LOCK1 is zero. PLL1 VCO Divide Factor VDIV1
 * Multiply Factor VDIV1 Multiply Factor VDIV1 Multiply Factor VDIV1 Multiply Factor
 * 00000 16 01000 24 10000 32 11000 40 00001 17 01001 25 10001 33 11001 41 00010 18
 * 01010 26 10010 34 11010 42 00011 19 01011 27 10011 35 11011 43 00100 20 01100
 * 28 10100 36 11100 44 00101 21 01101 29 10101 37 11101 45 00110 22 01110 30
 * 10110 38 11110 46 00111 23 01111 31 10111 39 11111 47
 */
/*@{*/
/*! @brief Read current value of the MCG_C12_VDIV1 field. */
#define MCG_RD_C12_VDIV1(base) ((MCG_C12_REG(base) & MCG_C12_VDIV1_MASK) >> MCG_C12_VDIV1_SHIFT)
#define MCG_BRD_C12_VDIV1(base) (MCG_RD_C12_VDIV1(base))

/*! @brief Set the VDIV1 field to a new value. */
#define MCG_WR_C12_VDIV1(base, value) (MCG_RMW_C12(base, MCG_C12_VDIV1_MASK, MCG_C12_VDIV1(value)))
#define MCG_BWR_C12_VDIV1(base, value) (MCG_WR_C12_VDIV1(base, value))
/*@}*/

/*!
 * @name Register MCG_C12, field CME2[5] (RW)
 *
 * Enables the loss of clock monitor for the OSC1 external reference clock.
 * LOCRE2 will determine if a reset or interrupt request is geneated following a loss
 * of OSC1 external reference clock. The CME2 bit should only be set to a logic
 * 1 when the MCG is in an operational mode that uses the external clock (PEE or
 * PBE) . Whenever the CME2 bit is set to a logic 1, the value of the RANGE1 bits
 * in the C10 register should not be changed. CME2 bit should be set to a logic
 * 0 before the MCG enters any Stop mode. Otherwise, a reset request may occur
 * while in Stop mode.
 *
 * Values:
 * - 0 - External clock monitor for OSC1 is disabled.
 * - 1 - Generate a reset request on loss of external clock on OSC1.
 */
/*@{*/
/*! @brief Read current value of the MCG_C12_CME2 field. */
#define MCG_RD_C12_CME2(base) ((MCG_C12_REG(base) & MCG_C12_CME2_MASK) >> MCG_C12_CME2_SHIFT)
#define MCG_BRD_C12_CME2(base) (BITBAND_ACCESS8(&MCG_C12_REG(base), MCG_C12_CME2_SHIFT))

/*! @brief Set the CME2 field to a new value. */
#define MCG_WR_C12_CME2(base, value) (MCG_RMW_C12(base, MCG_C12_CME2_MASK, MCG_C12_CME2(value)))
#define MCG_BWR_C12_CME2(base, value) (BITBAND_ACCESS8(&MCG_C12_REG(base), MCG_C12_CME2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_C12, field LOLIE1[7] (RW)
 *
 * Determines if an interrupt request is made following a loss of lock
 * indication for PLL1. This bit only has an affect when LOLS1 is set.
 *
 * Values:
 * - 0 - No interrupt request is generated on loss of lock on PLL1.
 * - 1 - Generate an interrupt request on loss of lock on PLL1.
 */
/*@{*/
/*! @brief Read current value of the MCG_C12_LOLIE1 field. */
#define MCG_RD_C12_LOLIE1(base) ((MCG_C12_REG(base) & MCG_C12_LOLIE1_MASK) >> MCG_C12_LOLIE1_SHIFT)
#define MCG_BRD_C12_LOLIE1(base) (BITBAND_ACCESS8(&MCG_C12_REG(base), MCG_C12_LOLIE1_SHIFT))

/*! @brief Set the LOLIE1 field to a new value. */
#define MCG_WR_C12_LOLIE1(base, value) (MCG_RMW_C12(base, MCG_C12_LOLIE1_MASK, MCG_C12_LOLIE1(value)))
#define MCG_BWR_C12_LOLIE1(base, value) (BITBAND_ACCESS8(&MCG_C12_REG(base), MCG_C12_LOLIE1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * MCG_S2 - MCG Status 2 Register
 ******************************************************************************/

/*!
 * @brief MCG_S2 - MCG Status 2 Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire MCG_S2 register
 */
/*@{*/
#define MCG_RD_S2(base)          (MCG_S2_REG(base))
#define MCG_WR_S2(base, value)   (MCG_S2_REG(base) = (value))
#define MCG_RMW_S2(base, mask, value) (MCG_WR_S2(base, (MCG_RD_S2(base) & ~(mask)) | (value)))
#define MCG_SET_S2(base, value)  (MCG_WR_S2(base, MCG_RD_S2(base) |  (value)))
#define MCG_CLR_S2(base, value)  (MCG_WR_S2(base, MCG_RD_S2(base) & ~(value)))
#define MCG_TOG_S2(base, value)  (MCG_WR_S2(base, MCG_RD_S2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCG_S2 bitfields
 */

/*!
 * @name Register MCG_S2, field LOCS2[0] (W1C)
 *
 * This bit indicates when a loss of OSC1 external reference clock has occurred.
 * LOCRE2 determines if a reset or interrupt is generated when LOCS2 is set.
 * This bit is cleared by writing a logic 1 to it when set.
 *
 * Values:
 * - 0 - No loss of OSC1 external reference clock has occurred.
 * - 1 - Loss of OSC1 external reference clock has occurred.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_LOCS2 field. */
#define MCG_RD_S2_LOCS2(base) ((MCG_S2_REG(base) & MCG_S2_LOCS2_MASK) >> MCG_S2_LOCS2_SHIFT)
#define MCG_BRD_S2_LOCS2(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_LOCS2_SHIFT))

/*! @brief Set the LOCS2 field to a new value. */
#define MCG_WR_S2_LOCS2(base, value) (MCG_RMW_S2(base, MCG_S2_LOCS2_MASK, MCG_S2_LOCS2(value)))
#define MCG_BWR_S2_LOCS2(base, value) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_LOCS2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register MCG_S2, field OSCINIT1[1] (RO)
 *
 * This bit is set after the initialization cycles of the 2nd crystal oscillator
 * clock have completed. Refer to the Oscillator block guide for more details.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_OSCINIT1 field. */
#define MCG_RD_S2_OSCINIT1(base) ((MCG_S2_REG(base) & MCG_S2_OSCINIT1_MASK) >> MCG_S2_OSCINIT1_SHIFT)
#define MCG_BRD_S2_OSCINIT1(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_OSCINIT1_SHIFT))
/*@}*/

/*!
 * @name Register MCG_S2, field PLLCST[4] (RO)
 *
 * The PLLCST indicates the PLL clock selected by PLLCS. The PLLCST bit does not
 * updated immediately after a write to the PLLCS bit due internal
 * synchronization between clock domains.
 *
 * Values:
 * - 0 - Source of PLLCS is PLL0 clock.
 * - 1 - Source of PLLCS is PLL1 clock.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_PLLCST field. */
#define MCG_RD_S2_PLLCST(base) ((MCG_S2_REG(base) & MCG_S2_PLLCST_MASK) >> MCG_S2_PLLCST_SHIFT)
#define MCG_BRD_S2_PLLCST(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_PLLCST_SHIFT))
/*@}*/

/*!
 * @name Register MCG_S2, field LOCK1[6] (RO)
 *
 * This bit indicates whether PLL1 has acquired lock. PLL1 Lock detection is
 * disabled when not operating in either PBE or PEE mode unless PLLCLKEN1=1 and the
 * MCG is not configured in BLPI or BLPE mode. While the PLL1 clock is locking to
 * the desired frequncy, MCGPLL1CLK, MCGPLL1CLK2X, and MCGDDRCLK2X will be gated
 * off until the LOCK1 bit gets asserted. If the lock status bit is set,
 * changing the value of the PRDIV1[2:0] bits in the C8 register or the VDIV2[4:0] bits
 * in the C9 register causes the lock status bit to clear and stay cleared until
 * the PLL1 has reacquired lock. Loss of PLL1 reference clock will also cause the
 * LOCK1 bit to clear until PLL1 has reacquired lock. Entry into LLS, VLPS, or
 * regular Stop with PLLSTEN1=0 also causes the lock status bit to clear and stay
 * cleared until Stop mode is exited and the PLL1 has reacquired lock. Any time
 * the PLL1 is enabled and the LOCK1 bit is cleared, the MCGPLL1CLK, MCGPLL1CLK2X,
 * and MCGDDRCLK2X will be gated off until the LOCK1 bit is asserted again.
 *
 * Values:
 * - 0 - PLL1 is currently unlocked.
 * - 1 - PLL1 is currently locked.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_LOCK1 field. */
#define MCG_RD_S2_LOCK1(base) ((MCG_S2_REG(base) & MCG_S2_LOCK1_MASK) >> MCG_S2_LOCK1_SHIFT)
#define MCG_BRD_S2_LOCK1(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_LOCK1_SHIFT))
/*@}*/

/*!
 * @name Register MCG_S2, field LOLS1[7] (RO)
 *
 * This bit is a sticky bit indicating the lock status for the PLL1. LOLS1 is
 * set if after acquiring lock, the PLL1 output frequency has fallen outside the
 * lock exit frequency tolerance, D unl . LOLIE1 determines whether an interrupt
 * request is made when LOLS1 is set. This bit is cleared by reset or by writing a
 * logic 1 to it when set. Writing a logic 0 to this bit has no effect.
 *
 * Values:
 * - 0 - PLL1 has not lost lock since LOLS1 was last cleared.
 * - 1 - PLL1 has lost lock since LOLS1 was last cleared.
 */
/*@{*/
/*! @brief Read current value of the MCG_S2_LOLS1 field. */
#define MCG_RD_S2_LOLS1(base) ((MCG_S2_REG(base) & MCG_S2_LOLS1_MASK) >> MCG_S2_LOLS1_SHIFT)
#define MCG_BRD_S2_LOLS1(base) (BITBAND_ACCESS8(&MCG_S2_REG(base), MCG_S2_LOLS1_SHIFT))
/*@}*/

