pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the SRAMLAP field to a new value. */
#define MCM_WR_CR_SRAMLAP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMLAP_MASK, MCM_CR_SRAMLAP(value)))
#define MCM_BWR_CR_SRAMLAP(base, value) (MCM_WR_CR_SRAMLAP(base, value))
/*@}*/

/*!
 * @name Register MCM_CR, field SRAMLWP[30] (RW)
 *
 * When this bit is set, writes to SRAM_L array generates a bus error.
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_SRAMLWP field. */
#define MCM_RD_CR_SRAMLWP(base) ((MCM_CR_REG(base) & MCM_CR_SRAMLWP_MASK) >> MCM_CR_SRAMLWP_SHIFT)
#define MCM_BRD_CR_SRAMLWP(base) (MCM_RD_CR_SRAMLWP(base))

/*! @brief Set the SRAMLWP field to a new value. */
#define MCM_WR_CR_SRAMLWP(base, value) (MCM_RMW_CR(base, MCM_CR_SRAMLWP_MASK, MCM_CR_SRAMLWP(value)))
#define MCM_BWR_CR_SRAMLWP(base, value) (MCM_WR_CR_SRAMLWP(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ISCR - Interrupt Status and control Register
 ******************************************************************************/

/*!
 * @brief MCM_ISCR - Interrupt Status and control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCM_ISCR register defines the configuration and reports status for a
 * number of core-related interrupt exception conditions. It includes the enable and
 * status bits associated with the core's floating-point exceptions, bus errors
 * associated with the core's cache write buffer, and events associated with the
 * debug ETB module. The individual event indicators are first qualified with
 * their exception enables and then logically summed to form an interrupt request
 * sent to the core's NVIC. Bits 15-8 are read-only indicator flags based on the
 * processor's FPSCR register. Attempted writes to these bits are ignored. Once set,
 * the flags remain asserted until software clears the corresponding FPSCR bit.
 */
/*!
 * @name Constants and macros for entire MCM_ISCR register
 */
/*@{*/
#define MCM_RD_ISCR(base)        (MCM_ISCR_REG(base))
#define MCM_WR_ISCR(base, value) (MCM_ISCR_REG(base) = (value))
#define MCM_RMW_ISCR(base, mask, value) (MCM_WR_ISCR(base, (MCM_RD_ISCR(base) & ~(mask)) | (value)))
#define MCM_SET_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) |  (value)))
#define MCM_CLR_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) & ~(value)))
#define MCM_TOG_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ISCR bitfields
 */

/*!
 * @name Register MCM_ISCR, field IRQ[1] (W1C)
 *
 * If ETBCC[RSPT] is set to 01b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0 - No pending interrupt
 * - 1 - Due to the ETB counter expiring, a normal interrupt is pending
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_IRQ field. */
#define MCM_RD_ISCR_IRQ(base) ((MCM_ISCR_REG(base) & MCM_ISCR_IRQ_MASK) >> MCM_ISCR_IRQ_SHIFT)
#define MCM_BRD_ISCR_IRQ(base) (MCM_RD_ISCR_IRQ(base))

/*! @brief Set the IRQ field to a new value. */
#define MCM_WR_ISCR_IRQ(base, value) (MCM_RMW_ISCR(base, (MCM_ISCR_IRQ_MASK | MCM_ISCR_NMI_MASK | MCM_ISCR_CWBER_MASK), MCM_ISCR_IRQ(value)))
#define MCM_BWR_ISCR_IRQ(base, value) (MCM_WR_ISCR_IRQ(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field NMI[2] (W1C)
 *
 * If ETBCC[RSPT] is set to 10b, this bit is set when the ETB counter expires.
 *
 * Values:
 * - 0 - No pending NMI
 * - 1 - Due to the ETB counter expiring, an NMI is pending
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_NMI field. */
#define MCM_RD_ISCR_NMI(base) ((MCM_ISCR_REG(base) & MCM_ISCR_NMI_MASK) >> MCM_ISCR_NMI_SHIFT)
#define MCM_BRD_ISCR_NMI(base) (MCM_RD_ISCR_NMI(base))

/*! @brief Set the NMI field to a new value. */
#define MCM_WR_ISCR_NMI(base, value) (MCM_RMW_ISCR(base, (MCM_ISCR_NMI_MASK | MCM_ISCR_IRQ_MASK | MCM_ISCR_CWBER_MASK), MCM_ISCR_NMI(value)))
#define MCM_BWR_ISCR_NMI(base, value) (MCM_WR_ISCR_NMI(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field DHREQ[3] (RO)
 *
 * Indicates that a debug halt request is initiated due to a ETB counter
 * expiration, ETBCC[2:0] = 3b111 & ETBCV[10:0] = 11h0. This bit is cleared when the
 * counter is disabled or when the ETB counter is reloaded.
 *
 * Values:
 * - 0 - No debug halt request
 * - 1 - Debug halt request initiated
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_DHREQ field. */
#define MCM_RD_ISCR_DHREQ(base) ((MCM_ISCR_REG(base) & MCM_ISCR_DHREQ_MASK) >> MCM_ISCR_DHREQ_SHIFT)
#define MCM_BRD_ISCR_DHREQ(base) (MCM_RD_ISCR_DHREQ(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field CWBER[4] (W1C)
 *
 * Signals a data transfer from the core's cache write buffer was terminated
 * with a bus error. This bit only sets when the corresponding enable bit (CWBEE) is
 * set. The corresponding core fault address, attributes and write data are
 * typically retrieved from the FADR, FATR, and FDR registers during the interrupt
 * service routine before clearing the CWBER flag.
 *
 * Values:
 * - 0 - No error
 * - 1 - Error occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_CWBER field. */
#define MCM_RD_ISCR_CWBER(base) ((MCM_ISCR_REG(base) & MCM_ISCR_CWBER_MASK) >> MCM_ISCR_CWBER_SHIFT)
#define MCM_BRD_ISCR_CWBER(base) (MCM_RD_ISCR_CWBER(base))

/*! @brief Set the CWBER field to a new value. */
#define MCM_WR_ISCR_CWBER(base, value) (MCM_RMW_ISCR(base, (MCM_ISCR_CWBER_MASK | MCM_ISCR_IRQ_MASK | MCM_ISCR_NMI_MASK), MCM_ISCR_CWBER(value)))
#define MCM_BWR_ISCR_CWBER(base, value) (MCM_WR_ISCR_CWBER(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIOC[8] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IOC] bit and signals an
 * illegal operation has been detected in the processor's FPU. Once set, this bit
 * remains set until software clears the FPSCR[IOC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIOC field. */
#define MCM_RD_ISCR_FIOC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIOC_MASK) >> MCM_ISCR_FIOC_SHIFT)
#define MCM_BRD_ISCR_FIOC(base) (MCM_RD_ISCR_FIOC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FDZC[9] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[DZC] bit and signals a
 * divide by zero has been detected in the processor's FPU. Once set, this bit remains
 * set until software clears the FPSCR[DZC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FDZC field. */
#define MCM_RD_ISCR_FDZC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FDZC_MASK) >> MCM_ISCR_FDZC_SHIFT)
#define MCM_BRD_ISCR_FDZC(base) (MCM_RD_ISCR_FDZC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FOFC[10] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[OFC] bit and signals an
 * overflow has been detected in the processor's FPU. Once set, this bit remains set
 * until software clears the FPSCR[OFC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FOFC field. */
#define MCM_RD_ISCR_FOFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FOFC_MASK) >> MCM_ISCR_FOFC_SHIFT)
#define MCM_BRD_ISCR_FOFC(base) (MCM_RD_ISCR_FOFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FUFC[11] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[UFC] bit and signals an
 * underflow has been detected in the processor's FPU. Once set, this bit remains set
 * until software clears the FPSCR[UFC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FUFC field. */
#define MCM_RD_ISCR_FUFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FUFC_MASK) >> MCM_ISCR_FUFC_SHIFT)
#define MCM_BRD_ISCR_FUFC(base) (MCM_RD_ISCR_FUFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIXC[12] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IXC] bit and signals an
 * inexact number has been detected in the processor's FPU. Once set, this bit
 * remains set until software clears the FPSCR[IXC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIXC field. */
#define MCM_RD_ISCR_FIXC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIXC_MASK) >> MCM_ISCR_FIXC_SHIFT)
#define MCM_BRD_ISCR_FIXC(base) (MCM_RD_ISCR_FIXC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIDC[15] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IDC] bit and signals input
 * denormalized number has been detected in the processor's FPU. Once set, this
 * bit remains set until software clears the FPSCR[IDC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIDC field. */
#define MCM_RD_ISCR_FIDC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIDC_MASK) >> MCM_ISCR_FIDC_SHIFT)
#define MCM_BRD_ISCR_FIDC(base) (MCM_RD_ISCR_FIDC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field CWBEE[20] (RW)
 *
 * Enables the generation of an interrupt in response to a bus error termination
 * reported on a system bus transfer initiated from the cache's write buffer.
 *
 * Values:
 * - 0 - Disable error interrupt
 * - 1 - Enable error interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_CWBEE field. */
#define MCM_RD_ISCR_CWBEE(base) ((MCM_ISCR_REG(base) & MCM_ISCR_CWBEE_MASK) >> MCM_ISCR_CWBEE_SHIFT)
#define MCM_BRD_ISCR_CWBEE(base) (MCM_RD_ISCR_CWBEE(base))

