pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * MK70F12 NFC
 *
 * NAND flash controller
 *
 * Registers defined in this header file:
 * - NFC_CMD1 - Flash command 1
 * - NFC_CMD2 - Flash command 2
 * - NFC_CAR - Column address
 * - NFC_RAR - Row address
 * - NFC_RPT - Flash command repeat
 * - NFC_RAI - Row address increment
 * - NFC_SR1 - Flash status 1
 * - NFC_SR2 - Flash status 2
 * - NFC_DMA1 - DMA channel 1 address
 * - NFC_DMACFG - DMA configuration
 * - NFC_SWAP - Cach swap
 * - NFC_SECSZ - Sector size
 * - NFC_CFG - Flash configuration
 * - NFC_DMA2 - DMA channel 2 address
 * - NFC_ISR - Interrupt status
 */

#define NFC_INSTANCE_COUNT (1U) /*!< Number of instances of the NFC module. */
#define NFC_IDX (0U) /*!< Instance number for NFC. */

/*******************************************************************************
 * NFC_CMD1 - Flash command 1
 ******************************************************************************/

/*!
 * @brief NFC_CMD1 - Flash command 1 (RW)
 *
 * Reset value: 0x30FF0000U
 */
/*!
 * @name Constants and macros for entire NFC_CMD1 register
 */
/*@{*/
#define NFC_RD_CMD1(base)        (NFC_CMD1_REG(base))
#define NFC_WR_CMD1(base, value) (NFC_CMD1_REG(base) = (value))
#define NFC_RMW_CMD1(base, mask, value) (NFC_WR_CMD1(base, (NFC_RD_CMD1(base) & ~(mask)) | (value)))
#define NFC_SET_CMD1(base, value) (NFC_WR_CMD1(base, NFC_RD_CMD1(base) |  (value)))
#define NFC_CLR_CMD1(base, value) (NFC_WR_CMD1(base, NFC_RD_CMD1(base) & ~(value)))
#define NFC_TOG_CMD1(base, value) (NFC_WR_CMD1(base, NFC_RD_CMD1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_CMD1 bitfields
 */

/*!
 * @name Register NFC_CMD1, field BYTE3[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD1_BYTE3 field. */
#define NFC_RD_CMD1_BYTE3(base) ((NFC_CMD1_REG(base) & NFC_CMD1_BYTE3_MASK) >> NFC_CMD1_BYTE3_SHIFT)
#define NFC_BRD_CMD1_BYTE3(base) (NFC_RD_CMD1_BYTE3(base))

/*! @brief Set the BYTE3 field to a new value. */
#define NFC_WR_CMD1_BYTE3(base, value) (NFC_RMW_CMD1(base, NFC_CMD1_BYTE3_MASK, NFC_CMD1_BYTE3(value)))
#define NFC_BWR_CMD1_BYTE3(base, value) (NFC_WR_CMD1_BYTE3(base, value))
/*@}*/

/*!
 * @name Register NFC_CMD1, field BYTE2[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD1_BYTE2 field. */
#define NFC_RD_CMD1_BYTE2(base) ((NFC_CMD1_REG(base) & NFC_CMD1_BYTE2_MASK) >> NFC_CMD1_BYTE2_SHIFT)
#define NFC_BRD_CMD1_BYTE2(base) (NFC_RD_CMD1_BYTE2(base))

/*! @brief Set the BYTE2 field to a new value. */
#define NFC_WR_CMD1_BYTE2(base, value) (NFC_RMW_CMD1(base, NFC_CMD1_BYTE2_MASK, NFC_CMD1_BYTE2(value)))
#define NFC_BWR_CMD1_BYTE2(base, value) (NFC_WR_CMD1_BYTE2(base, value))
/*@}*/

/*******************************************************************************
 * NFC_CMD2 - Flash command 2
 ******************************************************************************/

/*!
 * @brief NFC_CMD2 - Flash command 2 (RW)
 *
 * Reset value: 0x007EE000U
 */
/*!
 * @name Constants and macros for entire NFC_CMD2 register
 */
/*@{*/
#define NFC_RD_CMD2(base)        (NFC_CMD2_REG(base))
#define NFC_WR_CMD2(base, value) (NFC_CMD2_REG(base) = (value))
#define NFC_RMW_CMD2(base, mask, value) (NFC_WR_CMD2(base, (NFC_RD_CMD2(base) & ~(mask)) | (value)))
#define NFC_SET_CMD2(base, value) (NFC_WR_CMD2(base, NFC_RD_CMD2(base) |  (value)))
#define NFC_CLR_CMD2(base, value) (NFC_WR_CMD2(base, NFC_RD_CMD2(base) & ~(value)))
#define NFC_TOG_CMD2(base, value) (NFC_WR_CMD2(base, NFC_RD_CMD2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_CMD2 bitfields
 */

/*!
 * @name Register NFC_CMD2, field BUSY_START[0] (RW)
 *
 * This busy indicator is repeated in the NFC_ISR register. Read to this
 * bitfield indicates BUSY whereas write indicates START.
 *
 * Values:
 * - 0 - During reads, flash controller is idle and it is okay to send next
 *     command. During writes, no action.
 * - 1 - During reads, command execution is busy. During writes, start command
 *     execution.
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD2_BUSY_START field. */
#define NFC_RD_CMD2_BUSY_START(base) ((NFC_CMD2_REG(base) & NFC_CMD2_BUSY_START_MASK) >> NFC_CMD2_BUSY_START_SHIFT)
#define NFC_BRD_CMD2_BUSY_START(base) (BITBAND_ACCESS32(&NFC_CMD2_REG(base), NFC_CMD2_BUSY_START_SHIFT))

/*! @brief Set the BUSY_START field to a new value. */
#define NFC_WR_CMD2_BUSY_START(base, value) (NFC_RMW_CMD2(base, NFC_CMD2_BUSY_START_MASK, NFC_CMD2_BUSY_START(value)))
#define NFC_BWR_CMD2_BUSY_START(base, value) (BITBAND_ACCESS32(&NFC_CMD2_REG(base), NFC_CMD2_BUSY_START_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CMD2, field BUFNO[2:1] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD2_BUFNO field. */
#define NFC_RD_CMD2_BUFNO(base) ((NFC_CMD2_REG(base) & NFC_CMD2_BUFNO_MASK) >> NFC_CMD2_BUFNO_SHIFT)
#define NFC_BRD_CMD2_BUFNO(base) (NFC_RD_CMD2_BUFNO(base))

/*! @brief Set the BUFNO field to a new value. */
#define NFC_WR_CMD2_BUFNO(base, value) (NFC_RMW_CMD2(base, NFC_CMD2_BUFNO_MASK, NFC_CMD2_BUFNO(value)))
#define NFC_BWR_CMD2_BUFNO(base, value) (NFC_WR_CMD2_BUFNO(base, value))
/*@}*/

/*!
 * @name Register NFC_CMD2, field CODE[23:8] (RW)
 *
 * Each bit indicates a certain action. If the bit is set, the corresponding
 * action is executed after writing 1 to START. The following are some configuration
 * examples (other sequences are possible):
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD2_CODE field. */
#define NFC_RD_CMD2_CODE(base) ((NFC_CMD2_REG(base) & NFC_CMD2_CODE_MASK) >> NFC_CMD2_CODE_SHIFT)
#define NFC_BRD_CMD2_CODE(base) (NFC_RD_CMD2_CODE(base))

/*! @brief Set the CODE field to a new value. */
#define NFC_WR_CMD2_CODE(base, value) (NFC_RMW_CMD2(base, NFC_CMD2_CODE_MASK, NFC_CMD2_CODE(value)))
#define NFC_BWR_CMD2_CODE(base, value) (NFC_WR_CMD2_CODE(base, value))
/*@}*/

/*!
 * @name Register NFC_CMD2, field BYTE1[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CMD2_BYTE1 field. */
#define NFC_RD_CMD2_BYTE1(base) ((NFC_CMD2_REG(base) & NFC_CMD2_BYTE1_MASK) >> NFC_CMD2_BYTE1_SHIFT)
#define NFC_BRD_CMD2_BYTE1(base) (NFC_RD_CMD2_BYTE1(base))

/*! @brief Set the BYTE1 field to a new value. */
#define NFC_WR_CMD2_BYTE1(base, value) (NFC_RMW_CMD2(base, NFC_CMD2_BYTE1_MASK, NFC_CMD2_BYTE1(value)))
#define NFC_BWR_CMD2_BYTE1(base, value) (NFC_WR_CMD2_BYTE1(base, value))
/*@}*/

