pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * NFC_CAR - Column address
 ******************************************************************************/

/*!
 * @brief NFC_CAR - Column address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_CAR register
 */
/*@{*/
#define NFC_RD_CAR(base)         (NFC_CAR_REG(base))
#define NFC_WR_CAR(base, value)  (NFC_CAR_REG(base) = (value))
#define NFC_RMW_CAR(base, mask, value) (NFC_WR_CAR(base, (NFC_RD_CAR(base) & ~(mask)) | (value)))
#define NFC_SET_CAR(base, value) (NFC_WR_CAR(base, NFC_RD_CAR(base) |  (value)))
#define NFC_CLR_CAR(base, value) (NFC_WR_CAR(base, NFC_RD_CAR(base) & ~(value)))
#define NFC_TOG_CAR(base, value) (NFC_WR_CAR(base, NFC_RD_CAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_CAR bitfields
 */

/*!
 * @name Register NFC_CAR, field BYTE1[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CAR_BYTE1 field. */
#define NFC_RD_CAR_BYTE1(base) ((NFC_CAR_REG(base) & NFC_CAR_BYTE1_MASK) >> NFC_CAR_BYTE1_SHIFT)
#define NFC_BRD_CAR_BYTE1(base) (NFC_RD_CAR_BYTE1(base))

/*! @brief Set the BYTE1 field to a new value. */
#define NFC_WR_CAR_BYTE1(base, value) (NFC_RMW_CAR(base, NFC_CAR_BYTE1_MASK, NFC_CAR_BYTE1(value)))
#define NFC_BWR_CAR_BYTE1(base, value) (NFC_WR_CAR_BYTE1(base, value))
/*@}*/

/*!
 * @name Register NFC_CAR, field BYTE2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CAR_BYTE2 field. */
#define NFC_RD_CAR_BYTE2(base) ((NFC_CAR_REG(base) & NFC_CAR_BYTE2_MASK) >> NFC_CAR_BYTE2_SHIFT)
#define NFC_BRD_CAR_BYTE2(base) (NFC_RD_CAR_BYTE2(base))

/*! @brief Set the BYTE2 field to a new value. */
#define NFC_WR_CAR_BYTE2(base, value) (NFC_RMW_CAR(base, NFC_CAR_BYTE2_MASK, NFC_CAR_BYTE2(value)))
#define NFC_BWR_CAR_BYTE2(base, value) (NFC_WR_CAR_BYTE2(base, value))
/*@}*/

/*******************************************************************************
 * NFC_RAR - Row address
 ******************************************************************************/

/*!
 * @brief NFC_RAR - Row address (RW)
 *
 * Reset value: 0x11000000U
 */
/*!
 * @name Constants and macros for entire NFC_RAR register
 */
/*@{*/
#define NFC_RD_RAR(base)         (NFC_RAR_REG(base))
#define NFC_WR_RAR(base, value)  (NFC_RAR_REG(base) = (value))
#define NFC_RMW_RAR(base, mask, value) (NFC_WR_RAR(base, (NFC_RD_RAR(base) & ~(mask)) | (value)))
#define NFC_SET_RAR(base, value) (NFC_WR_RAR(base, NFC_RD_RAR(base) |  (value)))
#define NFC_CLR_RAR(base, value) (NFC_WR_RAR(base, NFC_RD_RAR(base) & ~(value)))
#define NFC_TOG_RAR(base, value) (NFC_WR_RAR(base, NFC_RD_RAR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_RAR bitfields
 */

/*!
 * @name Register NFC_RAR, field BYTE1[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_BYTE1 field. */
#define NFC_RD_RAR_BYTE1(base) ((NFC_RAR_REG(base) & NFC_RAR_BYTE1_MASK) >> NFC_RAR_BYTE1_SHIFT)
#define NFC_BRD_RAR_BYTE1(base) (NFC_RD_RAR_BYTE1(base))

/*! @brief Set the BYTE1 field to a new value. */
#define NFC_WR_RAR_BYTE1(base, value) (NFC_RMW_RAR(base, NFC_RAR_BYTE1_MASK, NFC_RAR_BYTE1(value)))
#define NFC_BWR_RAR_BYTE1(base, value) (NFC_WR_RAR_BYTE1(base, value))
/*@}*/

/*!
 * @name Register NFC_RAR, field BYTE2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_BYTE2 field. */
#define NFC_RD_RAR_BYTE2(base) ((NFC_RAR_REG(base) & NFC_RAR_BYTE2_MASK) >> NFC_RAR_BYTE2_SHIFT)
#define NFC_BRD_RAR_BYTE2(base) (NFC_RD_RAR_BYTE2(base))

/*! @brief Set the BYTE2 field to a new value. */
#define NFC_WR_RAR_BYTE2(base, value) (NFC_RMW_RAR(base, NFC_RAR_BYTE2_MASK, NFC_RAR_BYTE2(value)))
#define NFC_BWR_RAR_BYTE2(base, value) (NFC_WR_RAR_BYTE2(base, value))
/*@}*/

/*!
 * @name Register NFC_RAR, field BYTE3[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_BYTE3 field. */
#define NFC_RD_RAR_BYTE3(base) ((NFC_RAR_REG(base) & NFC_RAR_BYTE3_MASK) >> NFC_RAR_BYTE3_SHIFT)
#define NFC_BRD_RAR_BYTE3(base) (NFC_RD_RAR_BYTE3(base))

/*! @brief Set the BYTE3 field to a new value. */
#define NFC_WR_RAR_BYTE3(base, value) (NFC_RMW_RAR(base, NFC_RAR_BYTE3_MASK, NFC_RAR_BYTE3(value)))
#define NFC_BWR_RAR_BYTE3(base, value) (NFC_WR_RAR_BYTE3(base, value))
/*@}*/

/*!
 * @name Register NFC_RAR, field RB0[24] (RW)
 *
 * Determines if NFC_R/ B 0 is waited on a wait for R/ B command. If an equal
 * number of NFC_CE and NFC_R/ B lines are used, the CS n and RB n fields must
 * contain identical values. If only one NFC_R/ B is used, then CS n determines the
 * true chip select, and this field is always 1.
 *
 * Values:
 * - 0 - NFC_R/ B 0 is disabled
 * - 1 - NFC_R/ B 0 is enabled
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_RB0 field. */
#define NFC_RD_RAR_RB0(base) ((NFC_RAR_REG(base) & NFC_RAR_RB0_MASK) >> NFC_RAR_RB0_SHIFT)
#define NFC_BRD_RAR_RB0(base) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_RB0_SHIFT))

/*! @brief Set the RB0 field to a new value. */
#define NFC_WR_RAR_RB0(base, value) (NFC_RMW_RAR(base, NFC_RAR_RB0_MASK, NFC_RAR_RB0(value)))
#define NFC_BWR_RAR_RB0(base, value) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_RB0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_RAR, field RB1[25] (RW)
 *
 * Determines if NFC_R/ B 1 is waited on a wait for R/ B command. If an equal
 * number of NFC_CE and NFC_R/ B lines are used, the CS n and RB n fields must
 * contain identical values. If only one NFC_R/ B is used, then CS n determines the
 * true chip select, and this field is always 0.
 *
 * Values:
 * - 0 - NFC_R/ B 1 is disabled
 * - 1 - NFC_R/ B 1 is enabled
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_RB1 field. */
#define NFC_RD_RAR_RB1(base) ((NFC_RAR_REG(base) & NFC_RAR_RB1_MASK) >> NFC_RAR_RB1_SHIFT)
#define NFC_BRD_RAR_RB1(base) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_RB1_SHIFT))

/*! @brief Set the RB1 field to a new value. */
#define NFC_WR_RAR_RB1(base, value) (NFC_RMW_RAR(base, NFC_RAR_RB1_MASK, NFC_RAR_RB1(value)))
#define NFC_BWR_RAR_RB1(base, value) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_RB1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_RAR, field CS0[28] (RW)
 *
 * Values:
 * - 0 - NFC_CE0 is disabled
 * - 1 - NFC_CE0 is enabled
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_CS0 field. */
#define NFC_RD_RAR_CS0(base) ((NFC_RAR_REG(base) & NFC_RAR_CS0_MASK) >> NFC_RAR_CS0_SHIFT)
#define NFC_BRD_RAR_CS0(base) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_CS0_SHIFT))

/*! @brief Set the CS0 field to a new value. */
#define NFC_WR_RAR_CS0(base, value) (NFC_RMW_RAR(base, NFC_RAR_CS0_MASK, NFC_RAR_CS0(value)))
#define NFC_BWR_RAR_CS0(base, value) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_CS0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_RAR, field CS1[29] (RW)
 *
 * Values:
 * - 0 - NFC_CE1 is disabled
 * - 1 - NFC_CE1 is enabled
 */
/*@{*/
/*! @brief Read current value of the NFC_RAR_CS1 field. */
#define NFC_RD_RAR_CS1(base) ((NFC_RAR_REG(base) & NFC_RAR_CS1_MASK) >> NFC_RAR_CS1_SHIFT)
#define NFC_BRD_RAR_CS1(base) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_CS1_SHIFT))

/*! @brief Set the CS1 field to a new value. */
#define NFC_WR_RAR_CS1(base, value) (NFC_RMW_RAR(base, NFC_RAR_CS1_MASK, NFC_RAR_CS1(value)))
#define NFC_BWR_RAR_CS1(base, value) (BITBAND_ACCESS32(&NFC_RAR_REG(base), NFC_RAR_CS1_SHIFT) = (value))
/*@}*/

