pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * NFC_RPT - Flash command repeat
 ******************************************************************************/

/*!
 * @brief NFC_RPT - Flash command repeat (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_RPT register
 */
/*@{*/
#define NFC_RD_RPT(base)         (NFC_RPT_REG(base))
#define NFC_WR_RPT(base, value)  (NFC_RPT_REG(base) = (value))
#define NFC_RMW_RPT(base, mask, value) (NFC_WR_RPT(base, (NFC_RD_RPT(base) & ~(mask)) | (value)))
#define NFC_SET_RPT(base, value) (NFC_WR_RPT(base, NFC_RD_RPT(base) |  (value)))
#define NFC_CLR_RPT(base, value) (NFC_WR_RPT(base, NFC_RD_RPT(base) & ~(value)))
#define NFC_TOG_RPT(base, value) (NFC_WR_RPT(base, NFC_RD_RPT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_RPT bitfields
 */

/*!
 * @name Register NFC_RPT, field COUNT[15:0] (RW)
 *
 * Determines how many times NFC_CMD2[CODE] is executed. If 0 or 1, the flash
 * command is executed once.
 */
/*@{*/
/*! @brief Read current value of the NFC_RPT_COUNT field. */
#define NFC_RD_RPT_COUNT(base) ((NFC_RPT_REG(base) & NFC_RPT_COUNT_MASK) >> NFC_RPT_COUNT_SHIFT)
#define NFC_BRD_RPT_COUNT(base) (NFC_RD_RPT_COUNT(base))

/*! @brief Set the COUNT field to a new value. */
#define NFC_WR_RPT_COUNT(base, value) (NFC_RMW_RPT(base, NFC_RPT_COUNT_MASK, NFC_RPT_COUNT(value)))
#define NFC_BWR_RPT_COUNT(base, value) (NFC_WR_RPT_COUNT(base, value))
/*@}*/

/*******************************************************************************
 * NFC_RAI - Row address increment
 ******************************************************************************/

/*!
 * @brief NFC_RAI - Row address increment (RW)
 *
 * Reset value: 0x00000001U
 *
 * When auto-increment of row address is enabled (NFC_CFG[AIAD] = 1), the row
 * address is incremented as follows: new{NFC_RAR[BYTE3, BYTE2, BYTE1]} =
 * {NFC_RAR[BYTE3], NFC_RAR[BYTE2], NFC_RAR[BYTE1]} + {NFC_RAI[INC3, INC2, INC1]}
 */
/*!
 * @name Constants and macros for entire NFC_RAI register
 */
/*@{*/
#define NFC_RD_RAI(base)         (NFC_RAI_REG(base))
#define NFC_WR_RAI(base, value)  (NFC_RAI_REG(base) = (value))
#define NFC_RMW_RAI(base, mask, value) (NFC_WR_RAI(base, (NFC_RD_RAI(base) & ~(mask)) | (value)))
#define NFC_SET_RAI(base, value) (NFC_WR_RAI(base, NFC_RD_RAI(base) |  (value)))
#define NFC_CLR_RAI(base, value) (NFC_WR_RAI(base, NFC_RD_RAI(base) & ~(value)))
#define NFC_TOG_RAI(base, value) (NFC_WR_RAI(base, NFC_RD_RAI(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_RAI bitfields
 */

/*!
 * @name Register NFC_RAI, field INC1[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAI_INC1 field. */
#define NFC_RD_RAI_INC1(base) ((NFC_RAI_REG(base) & NFC_RAI_INC1_MASK) >> NFC_RAI_INC1_SHIFT)
#define NFC_BRD_RAI_INC1(base) (NFC_RD_RAI_INC1(base))

/*! @brief Set the INC1 field to a new value. */
#define NFC_WR_RAI_INC1(base, value) (NFC_RMW_RAI(base, NFC_RAI_INC1_MASK, NFC_RAI_INC1(value)))
#define NFC_BWR_RAI_INC1(base, value) (NFC_WR_RAI_INC1(base, value))
/*@}*/

/*!
 * @name Register NFC_RAI, field INC2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAI_INC2 field. */
#define NFC_RD_RAI_INC2(base) ((NFC_RAI_REG(base) & NFC_RAI_INC2_MASK) >> NFC_RAI_INC2_SHIFT)
#define NFC_BRD_RAI_INC2(base) (NFC_RD_RAI_INC2(base))

/*! @brief Set the INC2 field to a new value. */
#define NFC_WR_RAI_INC2(base, value) (NFC_RMW_RAI(base, NFC_RAI_INC2_MASK, NFC_RAI_INC2(value)))
#define NFC_BWR_RAI_INC2(base, value) (NFC_WR_RAI_INC2(base, value))
/*@}*/

/*!
 * @name Register NFC_RAI, field INC3[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_RAI_INC3 field. */
#define NFC_RD_RAI_INC3(base) ((NFC_RAI_REG(base) & NFC_RAI_INC3_MASK) >> NFC_RAI_INC3_SHIFT)
#define NFC_BRD_RAI_INC3(base) (NFC_RD_RAI_INC3(base))

/*! @brief Set the INC3 field to a new value. */
#define NFC_WR_RAI_INC3(base, value) (NFC_RMW_RAI(base, NFC_RAI_INC3_MASK, NFC_RAI_INC3(value)))
#define NFC_BWR_RAI_INC3(base, value) (NFC_WR_RAI_INC3(base, value))
/*@}*/

/*******************************************************************************
 * NFC_SR1 - Flash status 1
 ******************************************************************************/

/*!
 * @brief NFC_SR1 - Flash status 1 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_SR1 register
 */
/*@{*/
#define NFC_RD_SR1(base)         (NFC_SR1_REG(base))
/*@}*/

/*
 * Constants & macros for individual NFC_SR1 bitfields
 */

/*!
 * @name Register NFC_SR1, field ID4[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR1_ID4 field. */
#define NFC_RD_SR1_ID4(base) ((NFC_SR1_REG(base) & NFC_SR1_ID4_MASK) >> NFC_SR1_ID4_SHIFT)
#define NFC_BRD_SR1_ID4(base) (NFC_RD_SR1_ID4(base))
/*@}*/

/*!
 * @name Register NFC_SR1, field ID3[15:8] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR1_ID3 field. */
#define NFC_RD_SR1_ID3(base) ((NFC_SR1_REG(base) & NFC_SR1_ID3_MASK) >> NFC_SR1_ID3_SHIFT)
#define NFC_BRD_SR1_ID3(base) (NFC_RD_SR1_ID3(base))
/*@}*/

/*!
 * @name Register NFC_SR1, field ID2[23:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR1_ID2 field. */
#define NFC_RD_SR1_ID2(base) ((NFC_SR1_REG(base) & NFC_SR1_ID2_MASK) >> NFC_SR1_ID2_SHIFT)
#define NFC_BRD_SR1_ID2(base) (NFC_RD_SR1_ID2(base))
/*@}*/

/*!
 * @name Register NFC_SR1, field ID1[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR1_ID1 field. */
#define NFC_RD_SR1_ID1(base) ((NFC_SR1_REG(base) & NFC_SR1_ID1_MASK) >> NFC_SR1_ID1_SHIFT)
#define NFC_BRD_SR1_ID1(base) (NFC_RD_SR1_ID1(base))
/*@}*/

/*******************************************************************************
 * NFC_SR2 - Flash status 2
 ******************************************************************************/

/*!
 * @brief NFC_SR2 - Flash status 2 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_SR2 register
 */
/*@{*/
#define NFC_RD_SR2(base)         (NFC_SR2_REG(base))
/*@}*/

