pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual NFC_SR2 bitfields
 */

/*!
 * @name Register NFC_SR2, field STATUS1[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR2_STATUS1 field. */
#define NFC_RD_SR2_STATUS1(base) ((NFC_SR2_REG(base) & NFC_SR2_STATUS1_MASK) >> NFC_SR2_STATUS1_SHIFT)
#define NFC_BRD_SR2_STATUS1(base) (NFC_RD_SR2_STATUS1(base))
/*@}*/

/*!
 * @name Register NFC_SR2, field ID5[31:24] (RO)
 */
/*@{*/
/*! @brief Read current value of the NFC_SR2_ID5 field. */
#define NFC_RD_SR2_ID5(base) ((NFC_SR2_REG(base) & NFC_SR2_ID5_MASK) >> NFC_SR2_ID5_SHIFT)
#define NFC_BRD_SR2_ID5(base) (NFC_RD_SR2_ID5(base))
/*@}*/

/*******************************************************************************
 * NFC_DMA1 - DMA channel 1 address
 ******************************************************************************/

/*!
 * @brief NFC_DMA1 - DMA channel 1 address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_DMA1 register
 */
/*@{*/
#define NFC_RD_DMA1(base)        (NFC_DMA1_REG(base))
#define NFC_WR_DMA1(base, value) (NFC_DMA1_REG(base) = (value))
#define NFC_RMW_DMA1(base, mask, value) (NFC_WR_DMA1(base, (NFC_RD_DMA1(base) & ~(mask)) | (value)))
#define NFC_SET_DMA1(base, value) (NFC_WR_DMA1(base, NFC_RD_DMA1(base) |  (value)))
#define NFC_CLR_DMA1(base, value) (NFC_WR_DMA1(base, NFC_RD_DMA1(base) & ~(value)))
#define NFC_TOG_DMA1(base, value) (NFC_WR_DMA1(base, NFC_RD_DMA1(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * NFC_DMACFG - DMA configuration
 ******************************************************************************/

/*!
 * @brief NFC_DMACFG - DMA configuration (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_DMACFG register
 */
/*@{*/
#define NFC_RD_DMACFG(base)      (NFC_DMACFG_REG(base))
#define NFC_WR_DMACFG(base, value) (NFC_DMACFG_REG(base) = (value))
#define NFC_RMW_DMACFG(base, mask, value) (NFC_WR_DMACFG(base, (NFC_RD_DMACFG(base) & ~(mask)) | (value)))
#define NFC_SET_DMACFG(base, value) (NFC_WR_DMACFG(base, NFC_RD_DMACFG(base) |  (value)))
#define NFC_CLR_DMACFG(base, value) (NFC_WR_DMACFG(base, NFC_RD_DMACFG(base) & ~(value)))
#define NFC_TOG_DMACFG(base, value) (NFC_WR_DMACFG(base, NFC_RD_DMACFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_DMACFG bitfields
 */

/*!
 * @name Register NFC_DMACFG, field ACT2[0] (RW)
 *
 * Values:
 * - 0 - Inactive
 * - 1 - Active, and transfers to memory when triggered
 */
/*@{*/
/*! @brief Read current value of the NFC_DMACFG_ACT2 field. */
#define NFC_RD_DMACFG_ACT2(base) ((NFC_DMACFG_REG(base) & NFC_DMACFG_ACT2_MASK) >> NFC_DMACFG_ACT2_SHIFT)
#define NFC_BRD_DMACFG_ACT2(base) (BITBAND_ACCESS32(&NFC_DMACFG_REG(base), NFC_DMACFG_ACT2_SHIFT))

/*! @brief Set the ACT2 field to a new value. */
#define NFC_WR_DMACFG_ACT2(base, value) (NFC_RMW_DMACFG(base, NFC_DMACFG_ACT2_MASK, NFC_DMACFG_ACT2(value)))
#define NFC_BWR_DMACFG_ACT2(base, value) (BITBAND_ACCESS32(&NFC_DMACFG_REG(base), NFC_DMACFG_ACT2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_DMACFG, field ACT1[1] (RW)
 *
 * Values:
 * - 0 - Inactive
 * - 1 - Active, and transfers to memory when triggered
 */
/*@{*/
/*! @brief Read current value of the NFC_DMACFG_ACT1 field. */
#define NFC_RD_DMACFG_ACT1(base) ((NFC_DMACFG_REG(base) & NFC_DMACFG_ACT1_MASK) >> NFC_DMACFG_ACT1_SHIFT)
#define NFC_BRD_DMACFG_ACT1(base) (BITBAND_ACCESS32(&NFC_DMACFG_REG(base), NFC_DMACFG_ACT1_SHIFT))

/*! @brief Set the ACT1 field to a new value. */
#define NFC_WR_DMACFG_ACT1(base, value) (NFC_RMW_DMACFG(base, NFC_DMACFG_ACT1_MASK, NFC_DMACFG_ACT1(value)))
#define NFC_BWR_DMACFG_ACT1(base, value) (BITBAND_ACCESS32(&NFC_DMACFG_REG(base), NFC_DMACFG_ACT1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_DMACFG, field OFFSET2[12:9] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_DMACFG_OFFSET2 field. */
#define NFC_RD_DMACFG_OFFSET2(base) ((NFC_DMACFG_REG(base) & NFC_DMACFG_OFFSET2_MASK) >> NFC_DMACFG_OFFSET2_SHIFT)
#define NFC_BRD_DMACFG_OFFSET2(base) (NFC_RD_DMACFG_OFFSET2(base))

/*! @brief Set the OFFSET2 field to a new value. */
#define NFC_WR_DMACFG_OFFSET2(base, value) (NFC_RMW_DMACFG(base, NFC_DMACFG_OFFSET2_MASK, NFC_DMACFG_OFFSET2(value)))
#define NFC_BWR_DMACFG_OFFSET2(base, value) (NFC_WR_DMACFG_OFFSET2(base, value))
/*@}*/

/*!
 * @name Register NFC_DMACFG, field COUNT2[19:13] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_DMACFG_COUNT2 field. */
#define NFC_RD_DMACFG_COUNT2(base) ((NFC_DMACFG_REG(base) & NFC_DMACFG_COUNT2_MASK) >> NFC_DMACFG_COUNT2_SHIFT)
#define NFC_BRD_DMACFG_COUNT2(base) (NFC_RD_DMACFG_COUNT2(base))

/*! @brief Set the COUNT2 field to a new value. */
#define NFC_WR_DMACFG_COUNT2(base, value) (NFC_RMW_DMACFG(base, NFC_DMACFG_COUNT2_MASK, NFC_DMACFG_COUNT2(value)))
#define NFC_BWR_DMACFG_COUNT2(base, value) (NFC_WR_DMACFG_COUNT2(base, value))
/*@}*/

/*!
 * @name Register NFC_DMACFG, field COUNT1[31:20] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_DMACFG_COUNT1 field. */
#define NFC_RD_DMACFG_COUNT1(base) ((NFC_DMACFG_REG(base) & NFC_DMACFG_COUNT1_MASK) >> NFC_DMACFG_COUNT1_SHIFT)
#define NFC_BRD_DMACFG_COUNT1(base) (NFC_RD_DMACFG_COUNT1(base))

/*! @brief Set the COUNT1 field to a new value. */
#define NFC_WR_DMACFG_COUNT1(base, value) (NFC_RMW_DMACFG(base, NFC_DMACFG_COUNT1_MASK, NFC_DMACFG_COUNT1(value)))
#define NFC_BWR_DMACFG_COUNT1(base, value) (NFC_WR_DMACFG_COUNT1(base, value))
/*@}*/

/*******************************************************************************
 * NFC_SWAP - Cach swap
 ******************************************************************************/

/*!
 * @brief NFC_SWAP - Cach swap (RW)
 *
 * Reset value: 0x0FFE0FFEU
 *
 * When DMA transfers data to/from the NFC cache (NFC SRAM buffer), or when the
 * CPU reads or writes data to/from the NFC cache via the internal bus, all
 * accesses that go to NFC_SWAP[ADDR1] are directed to NFC_SWAP[ADDR2]. Likewise, all
 * accesses that go to NFC_SWAP[ADDR2] are directed to NFC_SWAP[ADDR1]. The
 * feature allows the bad block marker in the first position of the spare area of a
 * page. Because of the way the flash controller interleaves data and ECC bytes on
 * flash devices with page sizes larger than 2 KB, the position of the bad block
 * marker is shifted, and does not appear in the first position of the spare area
 * of the page. The cache swap feature allows consistent swapping of the actual
 * bad block line with the expected bad block line, and causes the operating
 * system to get the bad block marker in the position where it is expected.
 */
/*!
 * @name Constants and macros for entire NFC_SWAP register
 */
/*@{*/
#define NFC_RD_SWAP(base)        (NFC_SWAP_REG(base))
#define NFC_WR_SWAP(base, value) (NFC_SWAP_REG(base) = (value))
#define NFC_RMW_SWAP(base, mask, value) (NFC_WR_SWAP(base, (NFC_RD_SWAP(base) & ~(mask)) | (value)))
#define NFC_SET_SWAP(base, value) (NFC_WR_SWAP(base, NFC_RD_SWAP(base) |  (value)))
#define NFC_CLR_SWAP(base, value) (NFC_WR_SWAP(base, NFC_RD_SWAP(base) & ~(value)))
#define NFC_TOG_SWAP(base, value) (NFC_WR_SWAP(base, NFC_RD_SWAP(base) ^  (value)))
/*@}*/

