pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual NFC_SWAP bitfields
 */

/*!
 * @name Register NFC_SWAP, field ADDR2[11:1] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_SWAP_ADDR2 field. */
#define NFC_RD_SWAP_ADDR2(base) ((NFC_SWAP_REG(base) & NFC_SWAP_ADDR2_MASK) >> NFC_SWAP_ADDR2_SHIFT)
#define NFC_BRD_SWAP_ADDR2(base) (NFC_RD_SWAP_ADDR2(base))

/*! @brief Set the ADDR2 field to a new value. */
#define NFC_WR_SWAP_ADDR2(base, value) (NFC_RMW_SWAP(base, NFC_SWAP_ADDR2_MASK, NFC_SWAP_ADDR2(value)))
#define NFC_BWR_SWAP_ADDR2(base, value) (NFC_WR_SWAP_ADDR2(base, value))
/*@}*/

/*!
 * @name Register NFC_SWAP, field ADDR1[27:17] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_SWAP_ADDR1 field. */
#define NFC_RD_SWAP_ADDR1(base) ((NFC_SWAP_REG(base) & NFC_SWAP_ADDR1_MASK) >> NFC_SWAP_ADDR1_SHIFT)
#define NFC_BRD_SWAP_ADDR1(base) (NFC_RD_SWAP_ADDR1(base))

/*! @brief Set the ADDR1 field to a new value. */
#define NFC_WR_SWAP_ADDR1(base, value) (NFC_RMW_SWAP(base, NFC_SWAP_ADDR1_MASK, NFC_SWAP_ADDR1(value)))
#define NFC_BWR_SWAP_ADDR1(base, value) (NFC_WR_SWAP_ADDR1(base, value))
/*@}*/

/*******************************************************************************
 * NFC_SECSZ - Sector size
 ******************************************************************************/

/*!
 * @brief NFC_SECSZ - Sector size (RW)
 *
 * Reset value: 0x00000420U
 */
/*!
 * @name Constants and macros for entire NFC_SECSZ register
 */
/*@{*/
#define NFC_RD_SECSZ(base)       (NFC_SECSZ_REG(base))
#define NFC_WR_SECSZ(base, value) (NFC_SECSZ_REG(base) = (value))
#define NFC_RMW_SECSZ(base, mask, value) (NFC_WR_SECSZ(base, (NFC_RD_SECSZ(base) & ~(mask)) | (value)))
#define NFC_SET_SECSZ(base, value) (NFC_WR_SECSZ(base, NFC_RD_SECSZ(base) |  (value)))
#define NFC_CLR_SECSZ(base, value) (NFC_WR_SECSZ(base, NFC_RD_SECSZ(base) & ~(value)))
#define NFC_TOG_SECSZ(base, value) (NFC_WR_SECSZ(base, NFC_RD_SECSZ(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_SECSZ bitfields
 */

/*!
 * @name Register NFC_SECSZ, field SIZE[12:0] (RW)
 *
 * For devices with pages of 2KB and smaller, this is the physical size of the
 * page in bytes (data bytes + ECC bytes) transferred in one page. When pages are
 * larger than 2KB, they must be split in multiple virtual pages. In this case,
 * the sector size is the size of the virtual page. The virtual page size is the
 * physical size divided by the splitting factor, NFC_CFG[PAGECNT]. If only a part
 * of a page to be programmed or read, SIZE can be set to the number of affected
 * bytes, not the page size. Then, ECC and DMA (data bytes) are all performed on
 * the number of bytes, indicated by SIZE. For 16-bit data width flash devices,
 * only odd SIZE is supported. If SIZE is even number, the real implemented size
 * is SIZE - 1. So, write size + 1 to this field. For example, if SIZE = 1, no
 * data is written or read. When programming NAND memory using the ECC feature,
 * ensure that SIZE is equal to the default value (data + ECC bytes).
 */
/*@{*/
/*! @brief Read current value of the NFC_SECSZ_SIZE field. */
#define NFC_RD_SECSZ_SIZE(base) ((NFC_SECSZ_REG(base) & NFC_SECSZ_SIZE_MASK) >> NFC_SECSZ_SIZE_SHIFT)
#define NFC_BRD_SECSZ_SIZE(base) (NFC_RD_SECSZ_SIZE(base))

/*! @brief Set the SIZE field to a new value. */
#define NFC_WR_SECSZ_SIZE(base, value) (NFC_RMW_SECSZ(base, NFC_SECSZ_SIZE_MASK, NFC_SECSZ_SIZE(value)))
#define NFC_BWR_SECSZ_SIZE(base, value) (NFC_WR_SECSZ_SIZE(base, value))
/*@}*/

/*******************************************************************************
 * NFC_CFG - Flash configuration
 ******************************************************************************/

/*!
 * @brief NFC_CFG - Flash configuration (RW)
 *
 * Reset value: 0x000EA631U
 */
/*!
 * @name Constants and macros for entire NFC_CFG register
 */
/*@{*/
#define NFC_RD_CFG(base)         (NFC_CFG_REG(base))
#define NFC_WR_CFG(base, value)  (NFC_CFG_REG(base) = (value))
#define NFC_RMW_CFG(base, mask, value) (NFC_WR_CFG(base, (NFC_RD_CFG(base) & ~(mask)) | (value)))
#define NFC_SET_CFG(base, value) (NFC_WR_CFG(base, NFC_RD_CFG(base) |  (value)))
#define NFC_CLR_CFG(base, value) (NFC_WR_CFG(base, NFC_RD_CFG(base) & ~(value)))
#define NFC_TOG_CFG(base, value) (NFC_WR_CFG(base, NFC_RD_CFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual NFC_CFG bitfields
 */

/*!
 * @name Register NFC_CFG, field PAGECNT[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_PAGECNT field. */
#define NFC_RD_CFG_PAGECNT(base) ((NFC_CFG_REG(base) & NFC_CFG_PAGECNT_MASK) >> NFC_CFG_PAGECNT_SHIFT)
#define NFC_BRD_CFG_PAGECNT(base) (NFC_RD_CFG_PAGECNT(base))

/*! @brief Set the PAGECNT field to a new value. */
#define NFC_WR_CFG_PAGECNT(base, value) (NFC_RMW_CFG(base, NFC_CFG_PAGECNT_MASK, NFC_CFG_PAGECNT(value)))
#define NFC_BWR_CFG_PAGECNT(base, value) (NFC_WR_CFG_PAGECNT(base, value))
/*@}*/

/*!
 * @name Register NFC_CFG, field AIBN[4] (RW)
 *
 * Values:
 * - 0 - Do not auto-increment buffer number
 * - 1 - Auto-increment buffer number
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_AIBN field. */
#define NFC_RD_CFG_AIBN(base) ((NFC_CFG_REG(base) & NFC_CFG_AIBN_MASK) >> NFC_CFG_AIBN_SHIFT)
#define NFC_BRD_CFG_AIBN(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_AIBN_SHIFT))

/*! @brief Set the AIBN field to a new value. */
#define NFC_WR_CFG_AIBN(base, value) (NFC_RMW_CFG(base, NFC_CFG_AIBN_MASK, NFC_CFG_AIBN(value)))
#define NFC_BWR_CFG_AIBN(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_AIBN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field AIAD[5] (RW)
 *
 * Values:
 * - 0 - Do not auto-increment flash row address
 * - 1 - Auto-increment flash row address
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_AIAD field. */
#define NFC_RD_CFG_AIAD(base) ((NFC_CFG_REG(base) & NFC_CFG_AIAD_MASK) >> NFC_CFG_AIAD_SHIFT)
#define NFC_BRD_CFG_AIAD(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_AIAD_SHIFT))

/*! @brief Set the AIAD field to a new value. */
#define NFC_WR_CFG_AIAD(base, value) (NFC_RMW_CFG(base, NFC_CFG_AIAD_MASK, NFC_CFG_AIAD(value)))
#define NFC_BWR_CFG_AIAD(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_AIAD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field BITWIDTH[7] (RW)
 *
 * Values:
 * - 0 - 8-bit wide flash mode
 * - 1 - 16-bit wide flash mode
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_BITWIDTH field. */
#define NFC_RD_CFG_BITWIDTH(base) ((NFC_CFG_REG(base) & NFC_CFG_BITWIDTH_MASK) >> NFC_CFG_BITWIDTH_SHIFT)
#define NFC_BRD_CFG_BITWIDTH(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_BITWIDTH_SHIFT))

/*! @brief Set the BITWIDTH field to a new value. */
#define NFC_WR_CFG_BITWIDTH(base, value) (NFC_RMW_CFG(base, NFC_CFG_BITWIDTH_MASK, NFC_CFG_BITWIDTH(value)))
#define NFC_BWR_CFG_BITWIDTH(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_BITWIDTH_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field TIMEOUT[12:8] (RW)
 *
 * The number of flash_clk cycles from NFC_WE high to either: NAND flash busy (t
 * WB ), or NFC_RE low (t WHR ) After the last command is issued to flash,
 * before sampling NFC_R/ B , the NFC must wait t WB clocks. After t WB clocks: if
 * NFC_R/ B is sampled as high, the NFC considers the command to be a timeout, and
 * the flash memory is idle. The NFC can issue new commands to the flash memory.
 * if NFC_R/ B is sampled as low, the NAND flash memory is busy. When reading the
 * status or ID from the NAND flash memory, after the last command is issued to
 * flash, the NFC must wait for t WHR cycles. The NFC then negates NFC_RE to low
 * to read the valid status or ID. t WB exists in page program/read, block erase,
 * etc. Refer to the NAND flash datasheet for details of t WB and t WHR .
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_TIMEOUT field. */
#define NFC_RD_CFG_TIMEOUT(base) ((NFC_CFG_REG(base) & NFC_CFG_TIMEOUT_MASK) >> NFC_CFG_TIMEOUT_SHIFT)
#define NFC_BRD_CFG_TIMEOUT(base) (NFC_RD_CFG_TIMEOUT(base))

