pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TIMEOUT field to a new value. */
#define NFC_WR_CFG_TIMEOUT(base, value) (NFC_RMW_CFG(base, NFC_CFG_TIMEOUT_MASK, NFC_CFG_TIMEOUT(value)))
#define NFC_BWR_CFG_TIMEOUT(base, value) (NFC_WR_CFG_TIMEOUT(base, value))
/*@}*/

/*!
 * @name Register NFC_CFG, field IDCNT[15:13] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_IDCNT field. */
#define NFC_RD_CFG_IDCNT(base) ((NFC_CFG_REG(base) & NFC_CFG_IDCNT_MASK) >> NFC_CFG_IDCNT_SHIFT)
#define NFC_BRD_CFG_IDCNT(base) (NFC_RD_CFG_IDCNT(base))

/*! @brief Set the IDCNT field to a new value. */
#define NFC_WR_CFG_IDCNT(base, value) (NFC_RMW_CFG(base, NFC_CFG_IDCNT_MASK, NFC_CFG_IDCNT(value)))
#define NFC_BWR_CFG_IDCNT(base, value) (NFC_WR_CFG_IDCNT(base, value))
/*@}*/

/*!
 * @name Register NFC_CFG, field FAST[16] (RW)
 *
 * Values:
 * - 0 - Slow flash timing. Clock in read data on rising edge of read strobe
 * - 1 - Fast flash timing. Clock in read data a half clock later than rising
 *     edge of read strobe
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_FAST field. */
#define NFC_RD_CFG_FAST(base) ((NFC_CFG_REG(base) & NFC_CFG_FAST_MASK) >> NFC_CFG_FAST_SHIFT)
#define NFC_BRD_CFG_FAST(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_FAST_SHIFT))

/*! @brief Set the FAST field to a new value. */
#define NFC_WR_CFG_FAST(base, value) (NFC_RMW_CFG(base, NFC_CFG_FAST_MASK, NFC_CFG_FAST(value)))
#define NFC_BWR_CFG_FAST(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_FAST_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field ECCMODE[19:17] (RW)
 *
 * Values:
 * - 000 - No correction, ECC bypass
 * - 001 - 4-error correction (8 ECC bytes)
 * - 010 - 6-error correction (12 ECC bytes)
 * - 011 - 8-error correction (15 ECC bytes)
 * - 100 - 12-error correction (23 ECC bytes)
 * - 101 - 16-error correction (30 ECC bytes)
 * - 110 - 24-error correction (45 ECC bytes)
 * - 111 - 32-error correction (60 ECC bytes)
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_ECCMODE field. */
#define NFC_RD_CFG_ECCMODE(base) ((NFC_CFG_REG(base) & NFC_CFG_ECCMODE_MASK) >> NFC_CFG_ECCMODE_SHIFT)
#define NFC_BRD_CFG_ECCMODE(base) (NFC_RD_CFG_ECCMODE(base))

/*! @brief Set the ECCMODE field to a new value. */
#define NFC_WR_CFG_ECCMODE(base, value) (NFC_RMW_CFG(base, NFC_CFG_ECCMODE_MASK, NFC_CFG_ECCMODE(value)))
#define NFC_BWR_CFG_ECCMODE(base, value) (NFC_WR_CFG_ECCMODE(base, value))
/*@}*/

/*!
 * @name Register NFC_CFG, field DMAREQ[20] (RW)
 *
 * Values:
 * - 0 - Do not transfer sector after ECC done
 * - 1 - After ECC done, transfer sector using DMA
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_DMAREQ field. */
#define NFC_RD_CFG_DMAREQ(base) ((NFC_CFG_REG(base) & NFC_CFG_DMAREQ_MASK) >> NFC_CFG_DMAREQ_SHIFT)
#define NFC_BRD_CFG_DMAREQ(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_DMAREQ_SHIFT))

/*! @brief Set the DMAREQ field to a new value. */
#define NFC_WR_CFG_DMAREQ(base, value) (NFC_RMW_CFG(base, NFC_CFG_DMAREQ_MASK, NFC_CFG_DMAREQ(value)))
#define NFC_BWR_CFG_DMAREQ(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_DMAREQ_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field ECCSRAM[21] (RW)
 *
 * Values:
 * - 0 - Do not write ECC status to SRAM
 * - 1 - Write ECC status to SRAM
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_ECCSRAM field. */
#define NFC_RD_CFG_ECCSRAM(base) ((NFC_CFG_REG(base) & NFC_CFG_ECCSRAM_MASK) >> NFC_CFG_ECCSRAM_SHIFT)
#define NFC_BRD_CFG_ECCSRAM(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_ECCSRAM_SHIFT))

/*! @brief Set the ECCSRAM field to a new value. */
#define NFC_WR_CFG_ECCSRAM(base, value) (NFC_RMW_CFG(base, NFC_CFG_ECCSRAM_MASK, NFC_CFG_ECCSRAM(value)))
#define NFC_BWR_CFG_ECCSRAM(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_ECCSRAM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_CFG, field ECCAD[30:22] (RW)
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_ECCAD field. */
#define NFC_RD_CFG_ECCAD(base) ((NFC_CFG_REG(base) & NFC_CFG_ECCAD_MASK) >> NFC_CFG_ECCAD_SHIFT)
#define NFC_BRD_CFG_ECCAD(base) (NFC_RD_CFG_ECCAD(base))

/*! @brief Set the ECCAD field to a new value. */
#define NFC_WR_CFG_ECCAD(base, value) (NFC_RMW_CFG(base, NFC_CFG_ECCAD_MASK, NFC_CFG_ECCAD(value)))
#define NFC_BWR_CFG_ECCAD(base, value) (NFC_WR_CFG_ECCAD(base, value))
/*@}*/

/*!
 * @name Register NFC_CFG, field STOPWERR[31] (RW)
 *
 * Values:
 * - 0 - No stop on write error
 * - 1 - Auto-sequencer stops on a write error
 */
/*@{*/
/*! @brief Read current value of the NFC_CFG_STOPWERR field. */
#define NFC_RD_CFG_STOPWERR(base) ((NFC_CFG_REG(base) & NFC_CFG_STOPWERR_MASK) >> NFC_CFG_STOPWERR_SHIFT)
#define NFC_BRD_CFG_STOPWERR(base) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_STOPWERR_SHIFT))

/*! @brief Set the STOPWERR field to a new value. */
#define NFC_WR_CFG_STOPWERR(base, value) (NFC_RMW_CFG(base, NFC_CFG_STOPWERR_MASK, NFC_CFG_STOPWERR(value)))
#define NFC_BWR_CFG_STOPWERR(base, value) (BITBAND_ACCESS32(&NFC_CFG_REG(base), NFC_CFG_STOPWERR_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * NFC_DMA2 - DMA channel 2 address
 ******************************************************************************/

/*!
 * @brief NFC_DMA2 - DMA channel 2 address (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire NFC_DMA2 register
 */
/*@{*/
#define NFC_RD_DMA2(base)        (NFC_DMA2_REG(base))
#define NFC_WR_DMA2(base, value) (NFC_DMA2_REG(base) = (value))
#define NFC_RMW_DMA2(base, mask, value) (NFC_WR_DMA2(base, (NFC_RD_DMA2(base) & ~(mask)) | (value)))
#define NFC_SET_DMA2(base, value) (NFC_WR_DMA2(base, NFC_RD_DMA2(base) |  (value)))
#define NFC_CLR_DMA2(base, value) (NFC_WR_DMA2(base, NFC_RD_DMA2(base) & ~(value)))
#define NFC_TOG_DMA2(base, value) (NFC_WR_DMA2(base, NFC_RD_DMA2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * NFC_ISR - Interrupt status
 ******************************************************************************/

/*!
 * @brief NFC_ISR - Interrupt status (RW)
 *
 * Reset value: 0x60000000U
 */
/*!
 * @name Constants and macros for entire NFC_ISR register
 */
/*@{*/
#define NFC_RD_ISR(base)         (NFC_ISR_REG(base))
#define NFC_WR_ISR(base, value)  (NFC_ISR_REG(base) = (value))
#define NFC_RMW_ISR(base, mask, value) (NFC_WR_ISR(base, (NFC_RD_ISR(base) & ~(mask)) | (value)))
#define NFC_SET_ISR(base, value) (NFC_WR_ISR(base, NFC_RD_ISR(base) |  (value)))
#define NFC_CLR_ISR(base, value) (NFC_WR_ISR(base, NFC_RD_ISR(base) & ~(value)))
#define NFC_TOG_ISR(base, value) (NFC_WR_ISR(base, NFC_RD_ISR(base) ^  (value)))
/*@}*/

