pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual NFC_ISR bitfields
 */

/*!
 * @name Register NFC_ISR, field DMABN[1:0] (RO)
 *
 * Buffer number corresponding with the current DMA task.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_DMABN field. */
#define NFC_RD_ISR_DMABN(base) ((NFC_ISR_REG(base) & NFC_ISR_DMABN_MASK) >> NFC_ISR_DMABN_SHIFT)
#define NFC_BRD_ISR_DMABN(base) (NFC_RD_ISR_DMABN(base))
/*@}*/

/*!
 * @name Register NFC_ISR, field ECCBN[3:2] (RO)
 *
 * Buffer number corresponding with the current ECC task.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_ECCBN field. */
#define NFC_RD_ISR_ECCBN(base) ((NFC_ISR_REG(base) & NFC_ISR_ECCBN_MASK) >> NFC_ISR_ECCBN_SHIFT)
#define NFC_BRD_ISR_ECCBN(base) (NFC_RD_ISR_ECCBN(base))
/*@}*/

/*!
 * @name Register NFC_ISR, field RESBN[5:4] (RO)
 *
 * Buffer number corresponding with the current residue block task.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_RESBN field. */
#define NFC_RD_ISR_RESBN(base) ((NFC_ISR_REG(base) & NFC_ISR_RESBN_MASK) >> NFC_ISR_RESBN_SHIFT)
#define NFC_BRD_ISR_RESBN(base) (NFC_RD_ISR_RESBN(base))
/*@}*/

/*!
 * @name Register NFC_ISR, field IDLECLR[17] (W1C)
 *
 * Clear bit for NFC_ISR[IDLE]. Writing 1 to this bit clears NFC_ISR[IDLE].
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_IDLECLR field. */
#define NFC_RD_ISR_IDLECLR(base) ((NFC_ISR_REG(base) & NFC_ISR_IDLECLR_MASK) >> NFC_ISR_IDLECLR_SHIFT)
#define NFC_BRD_ISR_IDLECLR(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_IDLECLR_SHIFT))

/*! @brief Set the IDLECLR field to a new value. */
#define NFC_WR_ISR_IDLECLR(base, value) (NFC_RMW_ISR(base, (NFC_ISR_IDLECLR_MASK | NFC_ISR_DONECLR_MASK | NFC_ISR_WERRCLR_MASK), NFC_ISR_IDLECLR(value)))
#define NFC_BWR_ISR_IDLECLR(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_IDLECLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field DONECLR[18] (W1C)
 *
 * Clear bit for NFC_ISR[DONE]. Writing 1 to this bit clears NFC_ISR[DONE].
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_DONECLR field. */
#define NFC_RD_ISR_DONECLR(base) ((NFC_ISR_REG(base) & NFC_ISR_DONECLR_MASK) >> NFC_ISR_DONECLR_SHIFT)
#define NFC_BRD_ISR_DONECLR(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DONECLR_SHIFT))

/*! @brief Set the DONECLR field to a new value. */
#define NFC_WR_ISR_DONECLR(base, value) (NFC_RMW_ISR(base, (NFC_ISR_DONECLR_MASK | NFC_ISR_IDLECLR_MASK | NFC_ISR_WERRCLR_MASK), NFC_ISR_DONECLR(value)))
#define NFC_BWR_ISR_DONECLR(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DONECLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field WERRCLR[19] (W1C)
 *
 * Clear bit for NFC_ISR[WERR]. Writing 1 to this bit clears NFC_ISR[WERR].
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_WERRCLR field. */
#define NFC_RD_ISR_WERRCLR(base) ((NFC_ISR_REG(base) & NFC_ISR_WERRCLR_MASK) >> NFC_ISR_WERRCLR_SHIFT)
#define NFC_BRD_ISR_WERRCLR(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERRCLR_SHIFT))

/*! @brief Set the WERRCLR field to a new value. */
#define NFC_WR_ISR_WERRCLR(base, value) (NFC_RMW_ISR(base, (NFC_ISR_WERRCLR_MASK | NFC_ISR_IDLECLR_MASK | NFC_ISR_DONECLR_MASK), NFC_ISR_WERRCLR(value)))
#define NFC_BWR_ISR_WERRCLR(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERRCLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field IDLEEN[20] (RW)
 *
 * Enable bit for NFC_ISR[IDLE]
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_IDLEEN field. */
#define NFC_RD_ISR_IDLEEN(base) ((NFC_ISR_REG(base) & NFC_ISR_IDLEEN_MASK) >> NFC_ISR_IDLEEN_SHIFT)
#define NFC_BRD_ISR_IDLEEN(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_IDLEEN_SHIFT))

/*! @brief Set the IDLEEN field to a new value. */
#define NFC_WR_ISR_IDLEEN(base, value) (NFC_RMW_ISR(base, (NFC_ISR_IDLEEN_MASK | NFC_ISR_IDLECLR_MASK | NFC_ISR_DONECLR_MASK | NFC_ISR_WERRCLR_MASK), NFC_ISR_IDLEEN(value)))
#define NFC_BWR_ISR_IDLEEN(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_IDLEEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field DONEEN[21] (RW)
 *
 * Enable bit for NFC_ISR[DONE]
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_DONEEN field. */
#define NFC_RD_ISR_DONEEN(base) ((NFC_ISR_REG(base) & NFC_ISR_DONEEN_MASK) >> NFC_ISR_DONEEN_SHIFT)
#define NFC_BRD_ISR_DONEEN(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DONEEN_SHIFT))

/*! @brief Set the DONEEN field to a new value. */
#define NFC_WR_ISR_DONEEN(base, value) (NFC_RMW_ISR(base, (NFC_ISR_DONEEN_MASK | NFC_ISR_IDLECLR_MASK | NFC_ISR_DONECLR_MASK | NFC_ISR_WERRCLR_MASK), NFC_ISR_DONEEN(value)))
#define NFC_BWR_ISR_DONEEN(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DONEEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field WERREN[22] (RW)
 *
 * Enable bit for NFC_ISR[WERR]
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_WERREN field. */
#define NFC_RD_ISR_WERREN(base) ((NFC_ISR_REG(base) & NFC_ISR_WERREN_MASK) >> NFC_ISR_WERREN_SHIFT)
#define NFC_BRD_ISR_WERREN(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERREN_SHIFT))

/*! @brief Set the WERREN field to a new value. */
#define NFC_WR_ISR_WERREN(base, value) (NFC_RMW_ISR(base, (NFC_ISR_WERREN_MASK | NFC_ISR_IDLECLR_MASK | NFC_ISR_DONECLR_MASK | NFC_ISR_WERRCLR_MASK), NFC_ISR_WERREN(value)))
#define NFC_BWR_ISR_WERREN(base, value) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register NFC_ISR, field DMABUSY[23] (RO)
 *
 * Set if DMA engine busy, cleared otherwise.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_DMABUSY field. */
#define NFC_RD_ISR_DMABUSY(base) ((NFC_ISR_REG(base) & NFC_ISR_DMABUSY_MASK) >> NFC_ISR_DMABUSY_SHIFT)
#define NFC_BRD_ISR_DMABUSY(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DMABUSY_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field ECCBUSY[24] (RO)
 *
 * Set if ECC engine busy, cleared otherwise.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_ECCBUSY field. */
#define NFC_RD_ISR_ECCBUSY(base) ((NFC_ISR_REG(base) & NFC_ISR_ECCBUSY_MASK) >> NFC_ISR_ECCBUSY_SHIFT)
#define NFC_BRD_ISR_ECCBUSY(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_ECCBUSY_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field RESBUSY[25] (RO)
 *
 * Set if residue engine busy, cleared otherwise.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_RESBUSY field. */
#define NFC_RD_ISR_RESBUSY(base) ((NFC_ISR_REG(base) & NFC_ISR_RESBUSY_MASK) >> NFC_ISR_RESBUSY_SHIFT)
#define NFC_BRD_ISR_RESBUSY(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_RESBUSY_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field CMDBUSY[26] (RO)
 *
 * Set it command execution busy, cleared otherwise.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_CMDBUSY field. */
#define NFC_RD_ISR_CMDBUSY(base) ((NFC_ISR_REG(base) & NFC_ISR_CMDBUSY_MASK) >> NFC_ISR_CMDBUSY_SHIFT)
#define NFC_BRD_ISR_CMDBUSY(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_CMDBUSY_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field WERRNS[27] (RO)
 *
 * Set if an error condition was detected during the last flash read status
 * command. Non-sticky bit.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_WERRNS field. */
#define NFC_RD_ISR_WERRNS(base) ((NFC_ISR_REG(base) & NFC_ISR_WERRNS_MASK) >> NFC_ISR_WERRNS_SHIFT)
#define NFC_BRD_ISR_WERRNS(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERRNS_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field IDLE[29] (RO)
 *
 * Set if command done, and residue engine, ECC engine and DMA engine are idle.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_IDLE field. */
#define NFC_RD_ISR_IDLE(base) ((NFC_ISR_REG(base) & NFC_ISR_IDLE_MASK) >> NFC_ISR_IDLE_SHIFT)
#define NFC_BRD_ISR_IDLE(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_IDLE_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field DONE[30] (RO)
 *
 * Set if command processing is done.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_DONE field. */
#define NFC_RD_ISR_DONE(base) ((NFC_ISR_REG(base) & NFC_ISR_DONE_MASK) >> NFC_ISR_DONE_SHIFT)
#define NFC_BRD_ISR_DONE(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_DONE_SHIFT))
/*@}*/

/*!
 * @name Register NFC_ISR, field WERR[31] (RO)
 *
 * Set if an error condition is detected during a flash read status command.
 * Sticky bit.
 */
/*@{*/
/*! @brief Read current value of the NFC_ISR_WERR field. */
#define NFC_RD_ISR_WERR(base) ((NFC_ISR_REG(base) & NFC_ISR_WERR_MASK) >> NFC_ISR_WERR_SHIFT)
#define NFC_BRD_ISR_WERR(base) (BITBAND_ACCESS32(&NFC_ISR_REG(base), NFC_ISR_WERR_SHIFT))
/*@}*/

