pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TCRR field to a new value. */
#define RTC_WR_RAR_TCRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TCRR_MASK, RTC_RAR_TCRR(value)))
#define RTC_BWR_RAR_TCRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TCRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field CRR[4] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the control register are ignored.
 * - 1 - Reads to the control register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_CRR field. */
#define RTC_RD_RAR_CRR(base) ((RTC_RAR_REG(base) & RTC_RAR_CRR_MASK) >> RTC_RAR_CRR_SHIFT)
#define RTC_BRD_RAR_CRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_CRR_SHIFT))

/*! @brief Set the CRR field to a new value. */
#define RTC_WR_RAR_CRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_CRR_MASK, RTC_RAR_CRR(value)))
#define RTC_BWR_RAR_CRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_CRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field SRR[5] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the status register are ignored.
 * - 1 - Reads to the status register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_SRR field. */
#define RTC_RD_RAR_SRR(base) ((RTC_RAR_REG(base) & RTC_RAR_SRR_MASK) >> RTC_RAR_SRR_SHIFT)
#define RTC_BRD_RAR_SRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_SRR_SHIFT))

/*! @brief Set the SRR field to a new value. */
#define RTC_WR_RAR_SRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_SRR_MASK, RTC_RAR_SRR(value)))
#define RTC_BWR_RAR_SRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_SRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field LRR[6] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the lock register are ignored.
 * - 1 - Reads to the lock register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_LRR field. */
#define RTC_RD_RAR_LRR(base) ((RTC_RAR_REG(base) & RTC_RAR_LRR_MASK) >> RTC_RAR_LRR_SHIFT)
#define RTC_BRD_RAR_LRR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_LRR_SHIFT))

/*! @brief Set the LRR field to a new value. */
#define RTC_WR_RAR_LRR(base, value) (RTC_RMW_RAR(base, RTC_RAR_LRR_MASK, RTC_RAR_LRR(value)))
#define RTC_BWR_RAR_LRR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_LRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field IERR[7] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the interrupt enable register are ignored.
 * - 1 - Reads to the interrupt enable register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_IERR field. */
#define RTC_RD_RAR_IERR(base) ((RTC_RAR_REG(base) & RTC_RAR_IERR_MASK) >> RTC_RAR_IERR_SHIFT)
#define RTC_BRD_RAR_IERR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_IERR_SHIFT))

/*! @brief Set the IERR field to a new value. */
#define RTC_WR_RAR_IERR(base, value) (RTC_RMW_RAR(base, RTC_RAR_IERR_MASK, RTC_RAR_IERR(value)))
#define RTC_BWR_RAR_IERR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_IERR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field TTSR[8] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the tamper time seconds register are ignored.
 * - 1 - Reads to the tamper time seconds register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_TTSR field. */
#define RTC_RD_RAR_TTSR(base) ((RTC_RAR_REG(base) & RTC_RAR_TTSR_MASK) >> RTC_RAR_TTSR_SHIFT)
#define RTC_BRD_RAR_TTSR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TTSR_SHIFT))

/*! @brief Set the TTSR field to a new value. */
#define RTC_WR_RAR_TTSR(base, value) (RTC_RMW_RAR(base, RTC_RAR_TTSR_MASK, RTC_RAR_TTSR(value)))
#define RTC_BWR_RAR_TTSR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_TTSR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field MERR[9] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the monotonic enable register are ignored.
 * - 1 - Reads to the monotonic enable register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_MERR field. */
#define RTC_RD_RAR_MERR(base) ((RTC_RAR_REG(base) & RTC_RAR_MERR_MASK) >> RTC_RAR_MERR_SHIFT)
#define RTC_BRD_RAR_MERR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MERR_SHIFT))

/*! @brief Set the MERR field to a new value. */
#define RTC_WR_RAR_MERR(base, value) (RTC_RMW_RAR(base, RTC_RAR_MERR_MASK, RTC_RAR_MERR(value)))
#define RTC_BWR_RAR_MERR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MERR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field MCLR[10] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the monotonic counter low register are ignored.
 * - 1 - Reads to the monotonic counter low register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_MCLR field. */
#define RTC_RD_RAR_MCLR(base) ((RTC_RAR_REG(base) & RTC_RAR_MCLR_MASK) >> RTC_RAR_MCLR_SHIFT)
#define RTC_BRD_RAR_MCLR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MCLR_SHIFT))

/*! @brief Set the MCLR field to a new value. */
#define RTC_WR_RAR_MCLR(base, value) (RTC_RMW_RAR(base, RTC_RAR_MCLR_MASK, RTC_RAR_MCLR(value)))
#define RTC_BWR_RAR_MCLR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MCLR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register RTC_RAR, field MCHR[11] (RW)
 *
 * Once cleared, this bit is only set by system reset. It is not affected by
 * VBAT POR or software reset.
 *
 * Values:
 * - 0 - Reads to the monotonic counter high register are ignored.
 * - 1 - Reads to the monotonic counter high register complete as normal.
 */
/*@{*/
/*! @brief Read current value of the RTC_RAR_MCHR field. */
#define RTC_RD_RAR_MCHR(base) ((RTC_RAR_REG(base) & RTC_RAR_MCHR_MASK) >> RTC_RAR_MCHR_SHIFT)
#define RTC_BRD_RAR_MCHR(base) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MCHR_SHIFT))

/*! @brief Set the MCHR field to a new value. */
#define RTC_WR_RAR_MCHR(base, value) (RTC_RMW_RAR(base, RTC_RAR_MCHR_MASK, RTC_RAR_MCHR(value)))
#define RTC_BWR_RAR_MCHR(base, value) (BITBAND_ACCESS32(&RTC_RAR_REG(base), RTC_RAR_MCHR_SHIFT) = (value))
/*@}*/

