pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * MK70F12 SDHC
 *
 * Secured Digital Host Controller
 *
 * Registers defined in this header file:
 * - SDHC_DSADDR - DMA System Address Register
 * - SDHC_BLKATTR - Block Attributes Register
 * - SDHC_CMDARG - Command Argument Register
 * - SDHC_XFERTYP - Transfer Type Register
 * - SDHC_CMDRSP - Command Response 0
 * - SDHC_DATPORT - Buffer Data Port Register
 * - SDHC_PRSSTAT - Present State Register
 * - SDHC_PROCTL - Protocol Control Register
 * - SDHC_SYSCTL - System Control Register
 * - SDHC_IRQSTAT - Interrupt Status Register
 * - SDHC_IRQSTATEN - Interrupt Status Enable Register
 * - SDHC_IRQSIGEN - Interrupt Signal Enable Register
 * - SDHC_AC12ERR - Auto CMD12 Error Status Register
 * - SDHC_HTCAPBLT - Host Controller Capabilities
 * - SDHC_WML - Watermark Level Register
 * - SDHC_FEVT - Force Event Register
 * - SDHC_ADMAES - ADMA Error Status Register
 * - SDHC_ADSADDR - ADMA System Address Register
 * - SDHC_VENDOR - Vendor Specific Register
 * - SDHC_MMCBOOT - MMC Boot Register
 * - SDHC_HOSTVER - Host Controller Version
 */

#define SDHC_INSTANCE_COUNT (1U) /*!< Number of instances of the SDHC module. */
#define SDHC_IDX (0U) /*!< Instance number for SDHC. */

/*******************************************************************************
 * SDHC_DSADDR - DMA System Address Register
 ******************************************************************************/

/*!
 * @brief SDHC_DSADDR - DMA System Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the physical system memory address used for DMA
 * transfers.
 */
/*!
 * @name Constants and macros for entire SDHC_DSADDR register
 */
/*@{*/
#define SDHC_RD_DSADDR(base)     (SDHC_DSADDR_REG(base))
#define SDHC_WR_DSADDR(base, value) (SDHC_DSADDR_REG(base) = (value))
#define SDHC_RMW_DSADDR(base, mask, value) (SDHC_WR_DSADDR(base, (SDHC_RD_DSADDR(base) & ~(mask)) | (value)))
#define SDHC_SET_DSADDR(base, value) (SDHC_WR_DSADDR(base, SDHC_RD_DSADDR(base) |  (value)))
#define SDHC_CLR_DSADDR(base, value) (SDHC_WR_DSADDR(base, SDHC_RD_DSADDR(base) & ~(value)))
#define SDHC_TOG_DSADDR(base, value) (SDHC_WR_DSADDR(base, SDHC_RD_DSADDR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_DSADDR bitfields
 */

/*!
 * @name Register SDHC_DSADDR, field DSADDR[31:2] (RW)
 *
 * This register contains the 32-bit system memory address for a DMA transfer.
 * Since the address must be word (4 bytes) align, the least 2 bits are reserved,
 * always 0. When the SDHC stops a DMA transfer, this register points to the
 * system address of the next contiguous data position. It can be accessed only when
 * no transaction is executing (i.e. after a transaction has stopped). Read
 * operation during transfers may return an invalid value. The host driver shall
 * initialize this register before starting a DMA transaction. After DMA has stopped,
 * the system address of the next contiguous data position can be read from this
 * register. This register is protected during a data transfer. When data lines
 * are active, write to this register is ignored. The host driver shall wait,
 * until the PRSSTAT[DLA] is cleared, before writing to this register. The SDHC
 * internal DMA does not support a virtual memory system. It only supports continuous
 * physical memory access. And due to AHB burst limitations, if the burst must
 * cross the 1 KB boundary, SDHC will automatically change SEQ burst type to NSEQ.
 * Since this register supports dynamic address reflecting, when IRQSTAT[TC] bit
 * is set, it automatically alters the value of internal address counter, so SW
 * cannot change this register when IRQSTAT[TC] bit is set.
 */
/*@{*/
/*! @brief Read current value of the SDHC_DSADDR_DSADDR field. */
#define SDHC_RD_DSADDR_DSADDR(base) ((SDHC_DSADDR_REG(base) & SDHC_DSADDR_DSADDR_MASK) >> SDHC_DSADDR_DSADDR_SHIFT)
#define SDHC_BRD_DSADDR_DSADDR(base) (SDHC_RD_DSADDR_DSADDR(base))

/*! @brief Set the DSADDR field to a new value. */
#define SDHC_WR_DSADDR_DSADDR(base, value) (SDHC_RMW_DSADDR(base, SDHC_DSADDR_DSADDR_MASK, SDHC_DSADDR_DSADDR(value)))
#define SDHC_BWR_DSADDR_DSADDR(base, value) (SDHC_WR_DSADDR_DSADDR(base, value))
/*@}*/

/*******************************************************************************
 * SDHC_BLKATTR - Block Attributes Register
 ******************************************************************************/

/*!
 * @brief SDHC_BLKATTR - Block Attributes Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is used to configure the number of data blocks and the number
 * of bytes in each block.
 */
/*!
 * @name Constants and macros for entire SDHC_BLKATTR register
 */
/*@{*/
#define SDHC_RD_BLKATTR(base)    (SDHC_BLKATTR_REG(base))
#define SDHC_WR_BLKATTR(base, value) (SDHC_BLKATTR_REG(base) = (value))
#define SDHC_RMW_BLKATTR(base, mask, value) (SDHC_WR_BLKATTR(base, (SDHC_RD_BLKATTR(base) & ~(mask)) | (value)))
#define SDHC_SET_BLKATTR(base, value) (SDHC_WR_BLKATTR(base, SDHC_RD_BLKATTR(base) |  (value)))
#define SDHC_CLR_BLKATTR(base, value) (SDHC_WR_BLKATTR(base, SDHC_RD_BLKATTR(base) & ~(value)))
#define SDHC_TOG_BLKATTR(base, value) (SDHC_WR_BLKATTR(base, SDHC_RD_BLKATTR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_BLKATTR bitfields
 */

/*!
 * @name Register SDHC_BLKATTR, field BLKSIZE[12:0] (RW)
 *
 * This register specifies the block size for block data transfers. Values
 * ranging from 1 byte up to the maximum buffer size can be set. It can be accessed
 * only when no transaction is executing (that is after a transaction has stopped).
 * Read operations during transfers may return an invalid value, and write
 * operations will be ignored.
 *
 * Values:
 * - 0 - No data transfer
 * - 1 - 1 Byte
 * - 10 - 2 Bytes
 * - 11 - 3 Bytes
 * - 100 - 4 Bytes
 * - 111111111 - 511 Bytes
 * - 1000000000 - 512 Bytes
 * - 100000000000 - 2048 Bytes
 * - 1000000000000 - 4096 Bytes
 */
/*@{*/
/*! @brief Read current value of the SDHC_BLKATTR_BLKSIZE field. */
#define SDHC_RD_BLKATTR_BLKSIZE(base) ((SDHC_BLKATTR_REG(base) & SDHC_BLKATTR_BLKSIZE_MASK) >> SDHC_BLKATTR_BLKSIZE_SHIFT)
#define SDHC_BRD_BLKATTR_BLKSIZE(base) (SDHC_RD_BLKATTR_BLKSIZE(base))

/*! @brief Set the BLKSIZE field to a new value. */
#define SDHC_WR_BLKATTR_BLKSIZE(base, value) (SDHC_RMW_BLKATTR(base, SDHC_BLKATTR_BLKSIZE_MASK, SDHC_BLKATTR_BLKSIZE(value)))
#define SDHC_BWR_BLKATTR_BLKSIZE(base, value) (SDHC_WR_BLKATTR_BLKSIZE(base, value))
/*@}*/

/*!
 * @name Register SDHC_BLKATTR, field BLKCNT[31:16] (RW)
 *
 * This register is enabled when the XFERTYP[BCEN] is set to 1 and is valid only
 * for multiple block transfers. For single block transfer, this register will
 * always read as 1. The host driver shall set this register to a value between 1
 * and the maximum block count. The SDHC decrements the block count after each
 * block transfer and stops when the count reaches zero. Setting the block count to
 * 0 results in no data blocks being transferred. This register should be
 * accessed only when no transaction is executing (that is after transactions are
 * stopped). During data transfer, read operations on this register may return an
 * invalid value and write operations are ignored. When saving transfer content as a
 * result of a suspend command, the number of blocks yet to be transferred can be
 * determined by reading this register. The reading of this register should be
 * applied after transfer is paused by stop at block gap operation and before
 * sending the command marked as suspend. This is because when suspend command is
 * sent out, SDHC will regard the current transfer is aborted and change BLKCNT back
 * to its original value instead of keeping the dynamical indicator of remained
 * block count. When restoring transfer content prior to issuing a resume
 * command, the host driver shall restore the previously saved block count. Although the
 * BLKCNT field is 0 after reset, the read of reset value is 0x1. This is
 * because when XFERTYP[MSBSEL] bit is 0, indicating a single block transfer, the read
 * value of BLKCNT is always 1.
 *
 * Values:
 * - 0 - Stop count
 * - 1 - 1 block
 * - 10 - 2 blocks
 * - 1111111111111111 - 65535 blocks
 */
/*@{*/
/*! @brief Read current value of the SDHC_BLKATTR_BLKCNT field. */
#define SDHC_RD_BLKATTR_BLKCNT(base) ((SDHC_BLKATTR_REG(base) & SDHC_BLKATTR_BLKCNT_MASK) >> SDHC_BLKATTR_BLKCNT_SHIFT)
#define SDHC_BRD_BLKATTR_BLKCNT(base) (SDHC_RD_BLKATTR_BLKCNT(base))

/*! @brief Set the BLKCNT field to a new value. */
#define SDHC_WR_BLKATTR_BLKCNT(base, value) (SDHC_RMW_BLKATTR(base, SDHC_BLKATTR_BLKCNT_MASK, SDHC_BLKATTR_BLKCNT(value)))
#define SDHC_BWR_BLKATTR_BLKCNT(base, value) (SDHC_WR_BLKATTR_BLKCNT(base, value))
/*@}*/

