pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * SDHC_CMDRSP - Command Response 0
 ******************************************************************************/

/*!
 * @brief SDHC_CMDRSP - Command Response 0 (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register is used to store part 0 of the response bits from the card.
 */
/*!
 * @name Constants and macros for entire SDHC_CMDRSP register
 */
/*@{*/
#define SDHC_RD_CMDRSP(base, index) (SDHC_CMDRSP_REG(base, index))
/*@}*/

/*******************************************************************************
 * SDHC_DATPORT - Buffer Data Port Register
 ******************************************************************************/

/*!
 * @brief SDHC_DATPORT - Buffer Data Port Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This is a 32-bit data port register used to access the internal buffer and it
 * can not be updated in idle mode.
 */
/*!
 * @name Constants and macros for entire SDHC_DATPORT register
 */
/*@{*/
#define SDHC_RD_DATPORT(base)    (SDHC_DATPORT_REG(base))
#define SDHC_WR_DATPORT(base, value) (SDHC_DATPORT_REG(base) = (value))
#define SDHC_RMW_DATPORT(base, mask, value) (SDHC_WR_DATPORT(base, (SDHC_RD_DATPORT(base) & ~(mask)) | (value)))
#define SDHC_SET_DATPORT(base, value) (SDHC_WR_DATPORT(base, SDHC_RD_DATPORT(base) |  (value)))
#define SDHC_CLR_DATPORT(base, value) (SDHC_WR_DATPORT(base, SDHC_RD_DATPORT(base) & ~(value)))
#define SDHC_TOG_DATPORT(base, value) (SDHC_WR_DATPORT(base, SDHC_RD_DATPORT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * SDHC_PRSSTAT - Present State Register
 ******************************************************************************/

/*!
 * @brief SDHC_PRSSTAT - Present State Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The host driver can get status of the SDHC from this 32-bit read only
 * register. The host driver can issue CMD0, CMD12, CMD13 (for memory) and CMD52 (for
 * SDIO) when the DAT lines are busy during a data transfer. These commands can be
 * issued when Command Inhibit (CIHB) is set to zero. Other commands shall be
 * issued when Command Inhibit (CDIHB) is set to zero. Possible changes to the SD
 * Physical Specification may add other commands to this list in the future.
 */
/*!
 * @name Constants and macros for entire SDHC_PRSSTAT register
 */
/*@{*/
#define SDHC_RD_PRSSTAT(base)    (SDHC_PRSSTAT_REG(base))
/*@}*/

/*
 * Constants & macros for individual SDHC_PRSSTAT bitfields
 */

/*!
 * @name Register SDHC_PRSSTAT, field CIHB[0] (RO)
 *
 * If this status bit is 0, it indicates that the CMD line is not in use and the
 * SDHC can issue a SD/MMC Command using the CMD line. This bit is set also
 * immediately after the transfer type register is written. This bit is cleared when
 * the command response is received. Even if the CDIHB bit is set to 1, Commands
 * using only the CMD line can be issued if this bit is 0. Changing from 1 to 0
 * generates a command complete interrupt in the interrupt status register. If the
 * SDHC cannot issue the command because of a command conflict error (Refer to
 * command CRC error) or because of a command not issued by auto CMD12 error, this
 * bit will remain 1 and the command complete is not set. The status of issuing
 * an auto CMD12 does not show on this bit.
 *
 * Values:
 * - 0 - Can issue command using only CMD line
 * - 1 - Cannot issue command
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_CIHB field. */
#define SDHC_RD_PRSSTAT_CIHB(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_CIHB_MASK) >> SDHC_PRSSTAT_CIHB_SHIFT)
#define SDHC_BRD_PRSSTAT_CIHB(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_CIHB_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field CDIHB[1] (RO)
 *
 * This status bit is generated if either the DLA or the RTA is set to 1. If
 * this bit is 0, it indicates that the SDHC can issue the next SD/MMC Command.
 * Commands with a busy signal belong to CDIHB (e.g. R1b, R5b type). Except in the
 * case when the command busy is finished, changing from 1 to 0 generates a
 * transfer complete interrupt in the interrupt status register. The SD host driver can
 * save registers for a suspend transaction after this bit has changed from 1 to
 * 0.
 *
 * Values:
 * - 0 - Can issue command which uses the DAT line
 * - 1 - Cannot issue command which uses the DAT line
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_CDIHB field. */
#define SDHC_RD_PRSSTAT_CDIHB(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_CDIHB_MASK) >> SDHC_PRSSTAT_CDIHB_SHIFT)
#define SDHC_BRD_PRSSTAT_CDIHB(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_CDIHB_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field DLA[2] (RO)
 *
 * This status bit indicates whether one of the DAT lines on the SD bus is in
 * use. In the case of read transactions: This status indicates if a read transfer
 * is executing on the SD bus. Changes in this value from 1 to 0, between data
 * blocks, generates a block gap event interrupt in the interrupt status register.
 * This bit will be set in either of the following cases: After the end bit of
 * the read command. When writing a 1 to the PROCTL[CREQ] to restart a read
 * transfer. This bit will be cleared in either of the following cases: When the end bit
 * of the last data block is sent from the SD bus to the SDHC. When the read
 * wait state is stopped by a suspend command and the DAT2 line is released. The
 * SDHC will wait at the next block gap by driving read wait at the start of the
 * interrupt cycle. If the read wait signal is already driven (data buffer cannot
 * receive data), the SDHC can wait for a current block gap by continuing to drive
 * the read wait signal. It is necessary to support read wait in order to use the
 * suspend / resume function. This bit will remain 1 during read wait. In the
 * case of write transactions: This status indicates that a write transfer is
 * executing on the SD bus. Changes in this value from 1 to 0 generate a transfer
 * complete interrupt in the interrupt status register. This bit will be set in
 * either of the following cases: After the end bit of the write command. When writing
 * to 1 to the PROCTL[CREQ] to continue a write transfer. This bit will be
 * cleared in either of the following cases: When the SD card releases write busy of
 * the last data block, the SDHC will also detect if the output is not busy. If
 * the SD card does not drive the busy signal after the CRC status is received, the
 * SDHC shall assume the card drive "Not busy". When the SD card releases write
 * busy, prior to waiting for write transfer, and as a result of a stop at block
 * gap request. In the case of command with busy pending: This status indicates
 * that a busy state follows the command and the data line is in use. This bit
 * will be cleared when the DAT0 line is released.
 *
 * Values:
 * - 0 - DAT line inactive
 * - 1 - DAT line active
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_DLA field. */
#define SDHC_RD_PRSSTAT_DLA(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_DLA_MASK) >> SDHC_PRSSTAT_DLA_SHIFT)
#define SDHC_BRD_PRSSTAT_DLA(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_DLA_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field SDSTB[3] (RO)
 *
 * This status bit indicates that the internal card clock is stable. This bit is
 * for the host driver to poll clock status when changing the clock frequency.
 * It is recommended to clear SYSCTL[SDCLKEN] bit to remove glitch on the card
 * clock when the frequency is changing.
 *
 * Values:
 * - 0 - Clock is changing frequency and not stable
 * - 1 - Clock is stable
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_SDSTB field. */
#define SDHC_RD_PRSSTAT_SDSTB(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_SDSTB_MASK) >> SDHC_PRSSTAT_SDSTB_SHIFT)
#define SDHC_BRD_PRSSTAT_SDSTB(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_SDSTB_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field IPGOFF[4] (RO)
 *
 * This status bit indicates that the bus clock is internally gated off. This
 * bit is for the host driver to debug.
 *
 * Values:
 * - 0 - Bus clock is active
 * - 1 - Bus clock is gated off
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_IPGOFF field. */
#define SDHC_RD_PRSSTAT_IPGOFF(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_IPGOFF_MASK) >> SDHC_PRSSTAT_IPGOFF_SHIFT)
#define SDHC_BRD_PRSSTAT_IPGOFF(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_IPGOFF_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field HCKOFF[5] (RO)
 *
 * This status bit indicates that the system clock is internally gated off. This
 * bit is for the host driver to debug during a data transfer.
 *
 * Values:
 * - 0 - System clock is active
 * - 1 - System clock is gated off
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_HCKOFF field. */
#define SDHC_RD_PRSSTAT_HCKOFF(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_HCKOFF_MASK) >> SDHC_PRSSTAT_HCKOFF_SHIFT)
#define SDHC_BRD_PRSSTAT_HCKOFF(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_HCKOFF_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field PEROFF[6] (RO)
 *
 * This status bit indicates that the SDHC clock is internally gated off. This
 * bit is for the host driver to debug transaction on the SD bus. When INITA bit
 * is set, SDHC sending 80 clock cycles to the card, the SDCLKEN bit must be '1'
 * to enable the output card clock, otherwise the SDHC clock will never be gate
 * off, so SDHC clock and bus clock will be always active.
 *
 * Values:
 * - 0 - SDHC clock is active
 * - 1 - SDHC clock is gated off
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_PEROFF field. */
#define SDHC_RD_PRSSTAT_PEROFF(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_PEROFF_MASK) >> SDHC_PRSSTAT_PEROFF_SHIFT)
#define SDHC_BRD_PRSSTAT_PEROFF(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_PEROFF_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field SDOFF[7] (RO)
 *
 * This status bit indicates that the SD clock is internally gated off, because
 * of buffer over/under-run or read pause without read wait assertion, or the
 * driver has cleared SYSCTL[SDCLKEN] bit to stop the SD clock. This bit is for the
 * host driver to debug data transaction on the SD bus.
 *
 * Values:
 * - 0 - SD clock is active
 * - 1 - SD clock is gated off
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_SDOFF field. */
#define SDHC_RD_PRSSTAT_SDOFF(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_SDOFF_MASK) >> SDHC_PRSSTAT_SDOFF_SHIFT)
#define SDHC_BRD_PRSSTAT_SDOFF(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_SDOFF_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field WTA[8] (RO)
 *
 * This status bit indicates a write transfer is active. If this bit is 0, it
 * means no valid write data exists in the SDHC. This bit is set in either of the
 * following cases: After the end bit of the write command. When writing 1 to the
 * PROCTL[CREQ] to restart a write transfer. This bit is cleared in either of the
 * following cases: After getting the CRC status of the last data block as
 * specified by the transfer count (single and multiple). After getting the CRC status
 * of any block where data transmission is about to be stopped by a stop at
 * block gap request. During a write transaction, a block gap event interrupt is
 * generated when this bit is changed to 0, as result of the stop at block gap
 * request being set. This status is useful for the host driver in determining when to
 * issue commands during write busy state.
 *
 * Values:
 * - 0 - No valid data
 * - 1 - Transferring data
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_WTA field. */
#define SDHC_RD_PRSSTAT_WTA(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_WTA_MASK) >> SDHC_PRSSTAT_WTA_SHIFT)
#define SDHC_BRD_PRSSTAT_WTA(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_WTA_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field RTA[9] (RO)
 *
 * This status bit is used for detecting completion of a read transfer. This bit
 * is set for either of the following conditions: After the end bit of the read
 * command. When writing a 1 to the PROCTL[CREQ] to restart a read transfer. A
 * transfer complete interrupt is generated when this bit changes to 0. This bit is
 * cleared for either of the following conditions: When the last data block as
 * specified by block length is transferred to the system, that is all data are
 * read away from SDHC internal buffer. When all valid data blocks have been
 * transferred from SDHC internal buffer to the system and no current block transfers
 * are being sent as a result of the stop at block gap request being set to 1.
 *
 * Values:
 * - 0 - No valid data
 * - 1 - Transferring data
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_RTA field. */
#define SDHC_RD_PRSSTAT_RTA(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_RTA_MASK) >> SDHC_PRSSTAT_RTA_SHIFT)
#define SDHC_BRD_PRSSTAT_RTA(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_RTA_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field BWEN[10] (RO)
 *
 * This status bit is used for non-DMA write transfers. The SDHC can implement
 * multiple buffers to transfer data efficiently. This read only flag indicates if
 * space is available for write data. If this bit is 1, valid data greater than
 * the watermark level can be written to the buffer.This read only flag indicates
 * if space is available for write data.
 *
 * Values:
 * - 0 - Write disable, the buffer can hold valid data less than the write
 *     watermark level.
 * - 1 - Write enable, the buffer can hold valid data greater than the write
 *     watermark level.
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_BWEN field. */
#define SDHC_RD_PRSSTAT_BWEN(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_BWEN_MASK) >> SDHC_PRSSTAT_BWEN_SHIFT)
#define SDHC_BRD_PRSSTAT_BWEN(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_BWEN_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field BREN[11] (RO)
 *
 * This status bit is used for non-DMA read transfers. The SDHC may implement
 * multiple buffers to transfer data efficiently. This read only flag indicates
 * that valid data exists in the host side buffer. If this bit is high, valid data
 * greater than the watermark level exist in the buffer. This read only flag
 * indicates that valid data exists in the host side buffer.
 *
 * Values:
 * - 0 - Read disable, valid data less than the watermark level exist in the
 *     buffer.
 * - 1 - Read enable, valid data greater than the watermark level exist in the
 *     buffer.
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_BREN field. */
#define SDHC_RD_PRSSTAT_BREN(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_BREN_MASK) >> SDHC_PRSSTAT_BREN_SHIFT)
#define SDHC_BRD_PRSSTAT_BREN(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_BREN_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field CINS[16] (RO)
 *
 * This bit indicates whether a card has been inserted. The SDHC debounces this
 * signal so that the host driver will not need to wait for it to stabilize.
 * Changing from a 0 to 1 generates a card insertion interrupt in the interrupt
 * status register. Changing from a 1 to 0 generates a card removal interrupt in the
 * interrupt status register. A write to the force event register does not effect
 * this bit. The SYSCTL[RSTA] does not effect this bit.A software reset does not
 * effect this bit.
 *
 * Values:
 * - 0 - Power on reset or no card
 * - 1 - Card inserted
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_CINS field. */
#define SDHC_RD_PRSSTAT_CINS(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_CINS_MASK) >> SDHC_PRSSTAT_CINS_SHIFT)
#define SDHC_BRD_PRSSTAT_CINS(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_CINS_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field CLSL[23] (RO)
 *
 * This status is used to check the CMD line level to recover from errors, and
 * for debugging. The reset value is effected by the external pullup/pulldown
 * resistor, by default, the read value of this bit after reset is 1b, when the
 * command line is pulled up.
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_CLSL field. */
#define SDHC_RD_PRSSTAT_CLSL(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_CLSL_MASK) >> SDHC_PRSSTAT_CLSL_SHIFT)
#define SDHC_BRD_PRSSTAT_CLSL(base) (BITBAND_ACCESS32(&SDHC_PRSSTAT_REG(base), SDHC_PRSSTAT_CLSL_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_PRSSTAT, field DLSL[31:24] (RO)
 *
 * This status is used to check the DAT line level to recover from errors, and
 * for debugging.This is especially useful in detecting the busy signal level from
 * DAT[0]. The reset value is effected by the external pullup/pulldown
 * resistors. By default, the read value of this bit field after reset is 8'b11110111,
 * when DAT[3] is pulled down and the other lines are pulled up.
 */
/*@{*/
/*! @brief Read current value of the SDHC_PRSSTAT_DLSL field. */
#define SDHC_RD_PRSSTAT_DLSL(base) ((SDHC_PRSSTAT_REG(base) & SDHC_PRSSTAT_DLSL_MASK) >> SDHC_PRSSTAT_DLSL_SHIFT)
#define SDHC_BRD_PRSSTAT_DLSL(base) (SDHC_RD_PRSSTAT_DLSL(base))
/*@}*/

