pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the HCKEN field to a new value. */
#define SDHC_WR_SYSCTL_HCKEN(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_HCKEN_MASK, SDHC_SYSCTL_HCKEN(value)))
#define SDHC_BWR_SYSCTL_HCKEN(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_HCKEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field PEREN[2] (RW)
 *
 * If this bit is set, SDHC clock will always be active and no automatic gating
 * is applied. Thus the SDCLK is active except for when auto gating-off during
 * buffer danger (buffer about to over-run or under-run). When this bit is cleared,
 * the SDHC clock will be automatically off whenever there is no transaction on
 * the SD bus. Since this bit is only a feature enabling bit, clearing this bit
 * does not stop SDCLK immediately. The SDHC clock will be internally gated off,
 * if none of the following factors are met: The cmd part is reset, or Data part
 * is reset, or A soft reset, or The cmd is about to send, or Clock divisor is
 * just updated, or Continue request is just set, or This bit is set, or Card
 * insertion is detected, or Card removal is detected, or Card external interrupt is
 * detected, or 80 clocks for initialization phase is ongoing
 *
 * Values:
 * - 0 - SDHC clock will be internally gated off
 * - 1 - SDHC clock will not be automatically gated off
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_PEREN field. */
#define SDHC_RD_SYSCTL_PEREN(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_PEREN_MASK) >> SDHC_SYSCTL_PEREN_SHIFT)
#define SDHC_BRD_SYSCTL_PEREN(base) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_PEREN_SHIFT))

/*! @brief Set the PEREN field to a new value. */
#define SDHC_WR_SYSCTL_PEREN(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_PEREN_MASK, SDHC_SYSCTL_PEREN(value)))
#define SDHC_BWR_SYSCTL_PEREN(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_PEREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field SDCLKEN[3] (RW)
 *
 * The host controller shall stop SDCLK when writing this bit to 0. SDCLK
 * frequency can be changed when this bit is 0. Then, the host controller shall
 * maintain the same clock frequency until SDCLK is stopped (stop at SDCLK = 0). If the
 * IRQSTAT[CINS] is cleared, this bit should be cleared by the host driver to
 * save power.
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_SDCLKEN field. */
#define SDHC_RD_SYSCTL_SDCLKEN(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_SDCLKEN_MASK) >> SDHC_SYSCTL_SDCLKEN_SHIFT)
#define SDHC_BRD_SYSCTL_SDCLKEN(base) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_SDCLKEN_SHIFT))

/*! @brief Set the SDCLKEN field to a new value. */
#define SDHC_WR_SYSCTL_SDCLKEN(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_SDCLKEN_MASK, SDHC_SYSCTL_SDCLKEN(value)))
#define SDHC_BWR_SYSCTL_SDCLKEN(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_SDCLKEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field DVS[7:4] (RW)
 *
 * This register is used to provide a more exact divisor to generate the desired
 * SD clock frequency. Note the divider can even support odd divisor without
 * deterioration of duty cycle. The setting are as following:
 *
 * Values:
 * - 0 - Divisor by 1
 * - 1 - Divisor by 2
 * - 1110 - Divisor by 15
 * - 1111 - Divisor by 16
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_DVS field. */
#define SDHC_RD_SYSCTL_DVS(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_DVS_MASK) >> SDHC_SYSCTL_DVS_SHIFT)
#define SDHC_BRD_SYSCTL_DVS(base) (SDHC_RD_SYSCTL_DVS(base))

/*! @brief Set the DVS field to a new value. */
#define SDHC_WR_SYSCTL_DVS(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_DVS_MASK, SDHC_SYSCTL_DVS(value)))
#define SDHC_BWR_SYSCTL_DVS(base, value) (SDHC_WR_SYSCTL_DVS(base, value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field SDCLKFS[15:8] (RW)
 *
 * This register is used to select the frequency of the SDCLK pin. The frequency
 * is not programmed directly, rather this register holds the prescaler (this
 * register) and divisor (next register) of the base clock frequency register.
 * Setting 00h bypasses the frequency prescaler of the SD Clock. Multiple bits must
 * not be set, or the behavior of this prescaler is undefined. The two default
 * divider values can be calculated by the frequency of SDHC clock and the following
 * divisor bits. The frequency of SDCLK is set by the following formula: Clock
 * frequency = (Base clock) / (prescaler x divisor) For example, if the base clock
 * frequency is 96 MHz, and the target frequency is 25 MHz, then choosing the
 * prescaler value of 01h and divisor value of 1h will yield 24 MHz, which is the
 * nearest frequency less than or equal to the target. Similarly, to approach a
 * clock value of 400 kHz, the prescaler value of 08h and divisor value of eh
 * yields the exact clock value of 400 kHz. The reset value of this bit field is 80h,
 * so if the input base clock (SDHC clock) is about 96 MHz, the default SD clock
 * after reset is 375 kHz. According to the SD Physical Specification Version 1.1
 * and the SDIO Card Specification Version 1.2, the maximum SD clock frequency
 * is 50 MHz and shall never exceed this limit. Only the following settings are
 * allowed:
 *
 * Values:
 * - 1 - Base clock divided by 2
 * - 10 - Base clock divided by 4
 * - 100 - Base clock divided by 8
 * - 1000 - Base clock divided by 16
 * - 10000 - Base clock divided by 32
 * - 100000 - Base clock divided by 64
 * - 1000000 - Base clock divided by 128
 * - 10000000 - Base clock divided by 256
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_SDCLKFS field. */
#define SDHC_RD_SYSCTL_SDCLKFS(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_SDCLKFS_MASK) >> SDHC_SYSCTL_SDCLKFS_SHIFT)
#define SDHC_BRD_SYSCTL_SDCLKFS(base) (SDHC_RD_SYSCTL_SDCLKFS(base))

/*! @brief Set the SDCLKFS field to a new value. */
#define SDHC_WR_SYSCTL_SDCLKFS(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_SDCLKFS_MASK, SDHC_SYSCTL_SDCLKFS(value)))
#define SDHC_BWR_SYSCTL_SDCLKFS(base, value) (SDHC_WR_SYSCTL_SDCLKFS(base, value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field DTOCV[19:16] (RW)
 *
 * This value determines the interval by which DAT line timeouts are detected.
 * Refer to the IRQSTAT[DTOE] for information on factors that dictate time-out
 * generation. Time-out clock frequency will be generated by dividing the base clock
 * SDCLK value by this value. The host driver can clear the IRQSTATEN[DTOESEN]
 * to prevent inadvertent time-out events.
 *
 * Values:
 * - 0000 - SDCLK x 213
 * - 0001 - SDCLK x 214
 * - 1110 - SDCLK x 227
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_DTOCV field. */
#define SDHC_RD_SYSCTL_DTOCV(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_DTOCV_MASK) >> SDHC_SYSCTL_DTOCV_SHIFT)
#define SDHC_BRD_SYSCTL_DTOCV(base) (SDHC_RD_SYSCTL_DTOCV(base))

/*! @brief Set the DTOCV field to a new value. */
#define SDHC_WR_SYSCTL_DTOCV(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_DTOCV_MASK, SDHC_SYSCTL_DTOCV(value)))
#define SDHC_BWR_SYSCTL_DTOCV(base, value) (SDHC_WR_SYSCTL_DTOCV(base, value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field RSTA[24] (WORZ)
 *
 * This reset effects the entire host controller except for the card detection
 * circuit. Register bits of type ROC, RW, RW1C, RWAC are cleared. During its
 * initialization, the host driver shall set this bit to 1 to reset the SDHC. The
 * SDHC shall reset this bit to 0 when the capabilities registers are valid and the
 * host driver can read them. Additional use of software reset for all does not
 * affect the value of the capabilities registers. After this bit is set, it is
 * recommended that the host driver reset the external card and re-initialize it.
 *
 * Values:
 * - 0 - No reset
 * - 1 - Reset
 */
/*@{*/
/*! @brief Set the RSTA field to a new value. */
#define SDHC_WR_SYSCTL_RSTA(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_RSTA_MASK, SDHC_SYSCTL_RSTA(value)))
#define SDHC_BWR_SYSCTL_RSTA(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_RSTA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field RSTC[25] (WORZ)
 *
 * Only part of the command circuit is reset. The following registers and bits
 * are cleared by this bit: PRSSTAT[CIHB] IRQSTAT[CC]
 *
 * Values:
 * - 0 - No reset
 * - 1 - Reset
 */
/*@{*/
/*! @brief Set the RSTC field to a new value. */
#define SDHC_WR_SYSCTL_RSTC(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_RSTC_MASK, SDHC_SYSCTL_RSTC(value)))
#define SDHC_BWR_SYSCTL_RSTC(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_RSTC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field RSTD[26] (WORZ)
 *
 * Only part of the data circuit is reset. DMA circuit is also reset. The
 * following registers and bits are cleared by this bit: Data port register Buffer is
 * cleared and initialized.Present State register Buffer Read Enable Buffer Write
 * Enable Read Transfer Active Write Transfer Active DAT Line Active Command
 * Inhibit (DAT) Protocol Control register Continue Request Stop At Block Gap Request
 * Interrupt Status register Buffer Read Ready Buffer Write Ready DMA Interrupt
 * Block Gap Event Transfer Complete
 *
 * Values:
 * - 0 - No reset
 * - 1 - Reset
 */
/*@{*/
/*! @brief Set the RSTD field to a new value. */
#define SDHC_WR_SYSCTL_RSTD(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_RSTD_MASK, SDHC_SYSCTL_RSTD(value)))
#define SDHC_BWR_SYSCTL_RSTD(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_RSTD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SDHC_SYSCTL, field INITA[27] (RW)
 *
 * When this bit is set, 80 SD-clocks are sent to the card. After the 80 clocks
 * are sent, this bit is self cleared. This bit is very useful during the card
 * power-up period when 74 SD-clocks are needed and the clock auto gating feature
 * is enabled. Writing 1 to this bit when this bit is already 1 has no effect.
 * Writing 0 to this bit at any time has no effect. When either of the PRSSTAT[CIHB]
 * and PRSSTAT[CDIHB] bits are set, writing 1 to this bit is ignored (i.e. when
 * command line or data lines are active, write to this bit is not allowed). On
 * the otherhand, when this bit is set, i.e., during intialization active period,
 * it is allowed to issue command, and the command bit stream will appear on the
 * CMD pad after all 80 clock cycles are done. So when this command ends, the
 * driver can make sure the 80 clock cycles are sent out. This is very useful when
 * the driver needs send 80 cycles to the card and does not want to wait till this
 * bit is self cleared.
 */
/*@{*/
/*! @brief Read current value of the SDHC_SYSCTL_INITA field. */
#define SDHC_RD_SYSCTL_INITA(base) ((SDHC_SYSCTL_REG(base) & SDHC_SYSCTL_INITA_MASK) >> SDHC_SYSCTL_INITA_SHIFT)
#define SDHC_BRD_SYSCTL_INITA(base) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_INITA_SHIFT))

/*! @brief Set the INITA field to a new value. */
#define SDHC_WR_SYSCTL_INITA(base, value) (SDHC_RMW_SYSCTL(base, SDHC_SYSCTL_INITA_MASK, SDHC_SYSCTL_INITA(value)))
#define SDHC_BWR_SYSCTL_INITA(base, value) (BITBAND_ACCESS32(&SDHC_SYSCTL_REG(base), SDHC_SYSCTL_INITA_SHIFT) = (value))
/*@}*/

