pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * SDHC_ADMAES - ADMA Error Status Register
 ******************************************************************************/

/*!
 * @brief SDHC_ADMAES - ADMA Error Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * When an ADMA error interrupt has occurred, the ADMA error states field in
 * this register holds the ADMA state and the ADMA system address register holds the
 * address around the error descriptor. For recovering from this error, the host
 * driver requires the ADMA state to identify the error descriptor address as
 * follows: ST_STOP: Previous location set in the ADMA System Address register is
 * the error descriptor address. ST_FDS: Current location set in the ADMA System
 * Address register is the error descriptor address. ST_CADR: This state is never
 * set because it only increments the descriptor pointer and doesn't generate an
 * ADMA error. ST_TFR: Previous location set in the ADMA System Address register
 * is the error descriptor address. In case of a write operation, the host driver
 * should use the ACMD22 to get the number of the written block, rather than
 * using this information, since unwritten data may exist in the host controller.
 * The host controller generates the ADMA error interrupt when it detects invalid
 * descriptor data (valid = 0) in the ST_FDS state. The host driver can
 * distinguish this error by reading the valid bit of the error descriptor. ADMA Error
 * State Coding D01-D00 ADMA error state (when error has occurred) Contents of ADMA
 * system address register 00 ST_STOP (Stop DMA) Holds the address of the next
 * executable descriptor command 01 ST_FDS (fetch descriptor) Holds the valid
 * descriptor address 10 ST_CADR (change address) No ADMA error is generated 11 ST_TFR
 * (Transfer Data) Holds the address of the next executable descriptor command
 */
/*!
 * @name Constants and macros for entire SDHC_ADMAES register
 */
/*@{*/
#define SDHC_RD_ADMAES(base)     (SDHC_ADMAES_REG(base))
/*@}*/

/*
 * Constants & macros for individual SDHC_ADMAES bitfields
 */

/*!
 * @name Register SDHC_ADMAES, field ADMAES[1:0] (RO)
 *
 * This field indicates the state of the ADMA when an error has occurred during
 * an ADMA data transfer.
 */
/*@{*/
/*! @brief Read current value of the SDHC_ADMAES_ADMAES field. */
#define SDHC_RD_ADMAES_ADMAES(base) ((SDHC_ADMAES_REG(base) & SDHC_ADMAES_ADMAES_MASK) >> SDHC_ADMAES_ADMAES_SHIFT)
#define SDHC_BRD_ADMAES_ADMAES(base) (SDHC_RD_ADMAES_ADMAES(base))
/*@}*/

/*!
 * @name Register SDHC_ADMAES, field ADMALME[2] (RO)
 *
 * This error occurs in the following 2 cases: While the block count enable is
 * being set, the total data length specified by the descriptor table is different
 * from that specified by the block count and block length. Total data length
 * can not be divided by the block length.
 *
 * Values:
 * - 0 - No error
 * - 1 - Error
 */
/*@{*/
/*! @brief Read current value of the SDHC_ADMAES_ADMALME field. */
#define SDHC_RD_ADMAES_ADMALME(base) ((SDHC_ADMAES_REG(base) & SDHC_ADMAES_ADMALME_MASK) >> SDHC_ADMAES_ADMALME_SHIFT)
#define SDHC_BRD_ADMAES_ADMALME(base) (BITBAND_ACCESS32(&SDHC_ADMAES_REG(base), SDHC_ADMAES_ADMALME_SHIFT))
/*@}*/

/*!
 * @name Register SDHC_ADMAES, field ADMADCE[3] (RO)
 *
 * This error occurs when invalid descriptor is fetched by ADMA.
 *
 * Values:
 * - 0 - No error
 * - 1 - Error
 */
/*@{*/
/*! @brief Read current value of the SDHC_ADMAES_ADMADCE field. */
#define SDHC_RD_ADMAES_ADMADCE(base) ((SDHC_ADMAES_REG(base) & SDHC_ADMAES_ADMADCE_MASK) >> SDHC_ADMAES_ADMADCE_SHIFT)
#define SDHC_BRD_ADMAES_ADMADCE(base) (BITBAND_ACCESS32(&SDHC_ADMAES_REG(base), SDHC_ADMAES_ADMADCE_SHIFT))
/*@}*/

/*******************************************************************************
 * SDHC_ADSADDR - ADMA System Address Register
 ******************************************************************************/

/*!
 * @brief SDHC_ADSADDR - ADMA System Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the physical system memory address used for ADMA
 * transfers.
 */
/*!
 * @name Constants and macros for entire SDHC_ADSADDR register
 */
/*@{*/
#define SDHC_RD_ADSADDR(base)    (SDHC_ADSADDR_REG(base))
#define SDHC_WR_ADSADDR(base, value) (SDHC_ADSADDR_REG(base) = (value))
#define SDHC_RMW_ADSADDR(base, mask, value) (SDHC_WR_ADSADDR(base, (SDHC_RD_ADSADDR(base) & ~(mask)) | (value)))
#define SDHC_SET_ADSADDR(base, value) (SDHC_WR_ADSADDR(base, SDHC_RD_ADSADDR(base) |  (value)))
#define SDHC_CLR_ADSADDR(base, value) (SDHC_WR_ADSADDR(base, SDHC_RD_ADSADDR(base) & ~(value)))
#define SDHC_TOG_ADSADDR(base, value) (SDHC_WR_ADSADDR(base, SDHC_RD_ADSADDR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SDHC_ADSADDR bitfields
 */

/*!
 * @name Register SDHC_ADSADDR, field ADSADDR[31:2] (RW)
 *
 * This register holds the word address of the executing command in the
 * descriptor table. At the start of ADMA, the host driver shall set the start address of
 * the Descriptor table. The ADMA engine increments this register address
 * whenever fetching a descriptor command. When the ADMA is stopped at the block gap,
 * this register indicates the address of the next executable descriptor command.
 * When the ADMA error interrupt is generated, this register shall hold the valid
 * descriptor address depending on the ADMA state. The lower 2 bits of this
 * register is tied to '0' so the ADMA address is always word aligned. Since this
 * register supports dynamic address reflecting, when TC bit is set, it
 * automatically alters the value of internal address counter, so SW cannot change this
 * register when TC bit is set.
 */
/*@{*/
/*! @brief Read current value of the SDHC_ADSADDR_ADSADDR field. */
#define SDHC_RD_ADSADDR_ADSADDR(base) ((SDHC_ADSADDR_REG(base) & SDHC_ADSADDR_ADSADDR_MASK) >> SDHC_ADSADDR_ADSADDR_SHIFT)
#define SDHC_BRD_ADSADDR_ADSADDR(base) (SDHC_RD_ADSADDR_ADSADDR(base))

