pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the CLKOUTSEL field to a new value. */
#define SIM_WR_SOPT2_CLKOUTSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_CLKOUTSEL_MASK, SIM_SOPT2_CLKOUTSEL(value)))
#define SIM_BWR_SOPT2_CLKOUTSEL(base, value) (SIM_WR_SOPT2_CLKOUTSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field FBSL[9:8] (RW)
 *
 * If security is enabled, then this field affects what CPU operations can
 * access off-chip via the FlexBus and DDR controller interfaces. This field has no
 * effect if security is not enabled.
 *
 * Values:
 * - 00 - All off-chip accesses (op code and data) via the FlexBus and DDR
 *     controller are disallowed.
 * - 10 - Off-chip op code accesses are disallowed. Data accesses are allowed.
 * - 11 - Off-chip op code accesses and data accesses are allowed.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_FBSL field. */
#define SIM_RD_SOPT2_FBSL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_FBSL_MASK) >> SIM_SOPT2_FBSL_SHIFT)
#define SIM_BRD_SOPT2_FBSL(base) (SIM_RD_SOPT2_FBSL(base))

/*! @brief Set the FBSL field to a new value. */
#define SIM_WR_SOPT2_FBSL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_FBSL_MASK, SIM_SOPT2_FBSL(value)))
#define SIM_BWR_SOPT2_FBSL(base, value) (SIM_WR_SOPT2_FBSL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field CMTUARTPAD[11] (RW)
 *
 * Controls the output drive strength of the CMT IRO signal or UART0_TXD signal
 * on PTD7 pin by selecting either one or two pads to drive it.
 *
 * Values:
 * - 0 - Single-pad drive strength for CMT IRO or UART0_TXD.
 * - 1 - Dual-pad drive strength for CMT IRO or UART0_TXD.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_CMTUARTPAD field. */
#define SIM_RD_SOPT2_CMTUARTPAD(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_CMTUARTPAD_MASK) >> SIM_SOPT2_CMTUARTPAD_SHIFT)
#define SIM_BRD_SOPT2_CMTUARTPAD(base) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_CMTUARTPAD_SHIFT))

/*! @brief Set the CMTUARTPAD field to a new value. */
#define SIM_WR_SOPT2_CMTUARTPAD(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_CMTUARTPAD_MASK, SIM_SOPT2_CMTUARTPAD(value)))
#define SIM_BWR_SOPT2_CMTUARTPAD(base, value) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_CMTUARTPAD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field TRACECLKSEL[12] (RW)
 *
 * Selects either the core/system clock or PLL clock as the trace clock source.
 *
 * Values:
 * - 0 - MCGCLKOUT
 * - 1 - Core/system clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_TRACECLKSEL field. */
#define SIM_RD_SOPT2_TRACECLKSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_TRACECLKSEL_MASK) >> SIM_SOPT2_TRACECLKSEL_SHIFT)
#define SIM_BRD_SOPT2_TRACECLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_TRACECLKSEL_SHIFT))

/*! @brief Set the TRACECLKSEL field to a new value. */
#define SIM_WR_SOPT2_TRACECLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_TRACECLKSEL_MASK, SIM_SOPT2_TRACECLKSEL(value)))
#define SIM_BWR_SOPT2_TRACECLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_TRACECLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field LCDC_CLKSEL[14] (RW)
 *
 * Values:
 * - 0 - Clock divider LCDC pixel clock
 * - 1 - EXTAL1 clock.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_LCDC_CLKSEL field. */
#define SIM_RD_SOPT2_LCDC_CLKSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_LCDC_CLKSEL_MASK) >> SIM_SOPT2_LCDC_CLKSEL_SHIFT)
#define SIM_BRD_SOPT2_LCDC_CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_LCDC_CLKSEL_SHIFT))

/*! @brief Set the LCDC_CLKSEL field to a new value. */
#define SIM_WR_SOPT2_LCDC_CLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_LCDC_CLKSEL_MASK, SIM_SOPT2_LCDC_CLKSEL(value)))
#define SIM_BWR_SOPT2_LCDC_CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_LCDC_CLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field NFC_CLKSEL[15] (RW)
 *
 * Values:
 * - 0 - Clock divider NFC clock
 * - 1 - EXTAL1 clock.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_NFC_CLKSEL field. */
#define SIM_RD_SOPT2_NFC_CLKSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_NFC_CLKSEL_MASK) >> SIM_SOPT2_NFC_CLKSEL_SHIFT)
#define SIM_BRD_SOPT2_NFC_CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_NFC_CLKSEL_SHIFT))

/*! @brief Set the NFC_CLKSEL field to a new value. */
#define SIM_WR_SOPT2_NFC_CLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_NFC_CLKSEL_MASK, SIM_SOPT2_NFC_CLKSEL(value)))
#define SIM_BWR_SOPT2_NFC_CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_NFC_CLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field PLLFLLSEL[17:16] (RW)
 *
 * Selects the MCGPLLCLK or MCGFLLCLK clock for various peripheral clocking
 * options.
 *
 * Values:
 * - 00 - MCGFLLCLK
 * - 01 - MCGPLL0CLK
 * - 10 - MCGPLL1CLK
 * - 11 - System Platform clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_PLLFLLSEL field. */
#define SIM_RD_SOPT2_PLLFLLSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_PLLFLLSEL_MASK) >> SIM_SOPT2_PLLFLLSEL_SHIFT)
#define SIM_BRD_SOPT2_PLLFLLSEL(base) (SIM_RD_SOPT2_PLLFLLSEL(base))

/*! @brief Set the PLLFLLSEL field to a new value. */
#define SIM_WR_SOPT2_PLLFLLSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_PLLFLLSEL_MASK, SIM_SOPT2_PLLFLLSEL(value)))
#define SIM_BWR_SOPT2_PLLFLLSEL(base, value) (SIM_WR_SOPT2_PLLFLLSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field USBF_CLKSEL[18] (RW)
 *
 * Selects clock diver output or bypass clock.
 *
 * Values:
 * - 0 - External bypass clock (PTE26)
 * - 1 - Clock divider USB FS clock
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_USBF_CLKSEL field. */
#define SIM_RD_SOPT2_USBF_CLKSEL(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_USBF_CLKSEL_MASK) >> SIM_SOPT2_USBF_CLKSEL_SHIFT)
#define SIM_BRD_SOPT2_USBF_CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_USBF_CLKSEL_SHIFT))

/*! @brief Set the USBF_CLKSEL field to a new value. */
#define SIM_WR_SOPT2_USBF_CLKSEL(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_USBF_CLKSEL_MASK, SIM_SOPT2_USBF_CLKSEL(value)))
#define SIM_BWR_SOPT2_USBF_CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT2_REG(base), SIM_SOPT2_USBF_CLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field TIMESRC[21:20] (RW)
 *
 * Selects the clock source for the Ethernet timestamp clock.
 *
 * Values:
 * - 00 - System platform clock
 * - 01 - MCGPLLCLK/MCGFLLCLK selected by PLLFLLSEL[1:0]
 * - 10 - OSC0ERCLK
 * - 11 - External bypass clock (PTE26)
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_TIMESRC field. */
#define SIM_RD_SOPT2_TIMESRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_TIMESRC_MASK) >> SIM_SOPT2_TIMESRC_SHIFT)
#define SIM_BRD_SOPT2_TIMESRC(base) (SIM_RD_SOPT2_TIMESRC(base))

