pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TIMESRC field to a new value. */
#define SIM_WR_SOPT2_TIMESRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_TIMESRC_MASK, SIM_SOPT2_TIMESRC(value)))
#define SIM_BWR_SOPT2_TIMESRC(base, value) (SIM_WR_SOPT2_TIMESRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field USBFSRC[23:22] (RW)
 *
 * Selects the clock source for the USB 48 MHz clock.
 *
 * Values:
 * - 00 - MCGPLLCLK/MCGFLLCLK selected by PLLFLLSEL[1:0]
 * - 01 - MCGPLL0CLK
 * - 10 - MCGPLL1CLK
 * - 11 - OSC0ERCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_USBFSRC field. */
#define SIM_RD_SOPT2_USBFSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_USBFSRC_MASK) >> SIM_SOPT2_USBFSRC_SHIFT)
#define SIM_BRD_SOPT2_USBFSRC(base) (SIM_RD_SOPT2_USBFSRC(base))

/*! @brief Set the USBFSRC field to a new value. */
#define SIM_WR_SOPT2_USBFSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_USBFSRC_MASK, SIM_SOPT2_USBFSRC(value)))
#define SIM_BWR_SOPT2_USBFSRC(base, value) (SIM_WR_SOPT2_USBFSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field LCDCSRC[27:26] (RW)
 *
 * Selects the clock source for LCDC pixel clock.
 *
 * Values:
 * - 00 - Bus clock
 * - 01 - MCGPLL0CLK
 * - 10 - MCGPLL1CLK
 * - 11 - OSC0ERCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_LCDCSRC field. */
#define SIM_RD_SOPT2_LCDCSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_LCDCSRC_MASK) >> SIM_SOPT2_LCDCSRC_SHIFT)
#define SIM_BRD_SOPT2_LCDCSRC(base) (SIM_RD_SOPT2_LCDCSRC(base))

/*! @brief Set the LCDCSRC field to a new value. */
#define SIM_WR_SOPT2_LCDCSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_LCDCSRC_MASK, SIM_SOPT2_LCDCSRC(value)))
#define SIM_BWR_SOPT2_LCDCSRC(base, value) (SIM_WR_SOPT2_LCDCSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field ESDHCSRC[29:28] (RW)
 *
 * Selects the clock source for the ESDHC clock .
 *
 * Values:
 * - 00 - Core/system clock
 * - 01 - MCGPLLCLK/MCGFLLCLK selected by PLLFLLSEL[1:0]
 * - 10 - OSC0ERCLK
 * - 11 - External bypass clock (PTD11)
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_ESDHCSRC field. */
#define SIM_RD_SOPT2_ESDHCSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_ESDHCSRC_MASK) >> SIM_SOPT2_ESDHCSRC_SHIFT)
#define SIM_BRD_SOPT2_ESDHCSRC(base) (SIM_RD_SOPT2_ESDHCSRC(base))

/*! @brief Set the ESDHCSRC field to a new value. */
#define SIM_WR_SOPT2_ESDHCSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_ESDHCSRC_MASK, SIM_SOPT2_ESDHCSRC(value)))
#define SIM_BWR_SOPT2_ESDHCSRC(base, value) (SIM_WR_SOPT2_ESDHCSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT2, field NFCSRC[31:30] (RW)
 *
 * Selects the the clock divider source for NFC flash clock .
 *
 * Values:
 * - 00 - Bus clock
 * - 01 - MCGPLL0CLK
 * - 10 - MCGPLL1CLK
 * - 11 - OSC0ERCLK
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT2_NFCSRC field. */
#define SIM_RD_SOPT2_NFCSRC(base) ((SIM_SOPT2_REG(base) & SIM_SOPT2_NFCSRC_MASK) >> SIM_SOPT2_NFCSRC_SHIFT)
#define SIM_BRD_SOPT2_NFCSRC(base) (SIM_RD_SOPT2_NFCSRC(base))

/*! @brief Set the NFCSRC field to a new value. */
#define SIM_WR_SOPT2_NFCSRC(base, value) (SIM_RMW_SOPT2(base, SIM_SOPT2_NFCSRC_MASK, SIM_SOPT2_NFCSRC(value)))
#define SIM_BWR_SOPT2_NFCSRC(base, value) (SIM_WR_SOPT2_NFCSRC(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SOPT4 - System Options Register 4
 ******************************************************************************/

/*!
 * @brief SIM_SOPT4 - System Options Register 4 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT4 register
 */
/*@{*/
#define SIM_RD_SOPT4(base)       (SIM_SOPT4_REG(base))
#define SIM_WR_SOPT4(base, value) (SIM_SOPT4_REG(base) = (value))
#define SIM_RMW_SOPT4(base, mask, value) (SIM_WR_SOPT4(base, (SIM_RD_SOPT4(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT4(base, value) (SIM_WR_SOPT4(base, SIM_RD_SOPT4(base) |  (value)))
#define SIM_CLR_SOPT4(base, value) (SIM_WR_SOPT4(base, SIM_RD_SOPT4(base) & ~(value)))
#define SIM_TOG_SOPT4(base, value) (SIM_WR_SOPT4(base, SIM_RD_SOPT4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT4 bitfields
 */

/*!
 * @name Register SIM_SOPT4, field FTM0FLT0[0] (RW)
 *
 * Selects the source of FTM 0 fault 0. Note that the pin source for fault 0
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM0_FLT0 drives FTM 0 fault 0.
 * - 1 - CMP0 OUT drives FTM 0 fault 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT0 field. */
#define SIM_RD_SOPT4_FTM0FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT0_MASK) >> SIM_SOPT4_FTM0FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT0(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT0_SHIFT))

/*! @brief Set the FTM0FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT0_MASK, SIM_SOPT4_FTM0FLT0(value)))
#define SIM_BWR_SOPT4_FTM0FLT0(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0FLT1[1] (RW)
 *
 * Selects the source of FTM 0 fault 1. Note that the pin source for fault 1
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM0_FLT1 drives FTM 0 fault 1.
 * - 1 - CMP1 OUT drives FTM 0 fault 1.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT1 field. */
#define SIM_RD_SOPT4_FTM0FLT1(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT1_MASK) >> SIM_SOPT4_FTM0FLT1_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT1(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT1_SHIFT))

/*! @brief Set the FTM0FLT1 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT1(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT1_MASK, SIM_SOPT4_FTM0FLT1(value)))
#define SIM_BWR_SOPT4_FTM0FLT1(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0FLT2[2] (RW)
 *
 * Selects the source of FTM 0 fault 2. Note that the pin source for fault 2
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM0_FLT2 drives FTM 0 fault 2.
 * - 1 - CMP2 OUT drives FTM 0 fault 2.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT2 field. */
#define SIM_RD_SOPT4_FTM0FLT2(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT2_MASK) >> SIM_SOPT4_FTM0FLT2_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT2(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT2_SHIFT))

/*! @brief Set the FTM0FLT2 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT2(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT2_MASK, SIM_SOPT4_FTM0FLT2(value)))
#define SIM_BWR_SOPT4_FTM0FLT2(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0FLT3[3] (RW)
 *
 * Selects the source of FTM 0 fault 3. Note that the pin source for fault 3
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM0_FLT3 drives FTM 0 fault 3.
 * - 1 - CMP0 OUT drives FTM 0 fault 3.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0FLT3 field. */
#define SIM_RD_SOPT4_FTM0FLT3(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0FLT3_MASK) >> SIM_SOPT4_FTM0FLT3_SHIFT)
#define SIM_BRD_SOPT4_FTM0FLT3(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT3_SHIFT))

/*! @brief Set the FTM0FLT3 field to a new value. */
#define SIM_WR_SOPT4_FTM0FLT3(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0FLT3_MASK, SIM_SOPT4_FTM0FLT3(value)))
#define SIM_BWR_SOPT4_FTM0FLT3(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0FLT3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1FLT0[4] (RW)
 *
 * Selects the source of FTM 1 fault 0. Note that the pin source for fault 0
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM1_FLT0 drives FTM 1 fault 0.
 * - 1 - CMP0 OUT drives FTM 1 fault 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1FLT0 field. */
#define SIM_RD_SOPT4_FTM1FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1FLT0_MASK) >> SIM_SOPT4_FTM1FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM1FLT0(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1FLT0_SHIFT))

/*! @brief Set the FTM1FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM1FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1FLT0_MASK, SIM_SOPT4_FTM1FLT0(value)))
#define SIM_BWR_SOPT4_FTM1FLT0(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1FLT0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2FLT0[8] (RW)
 *
 * Selects the source of FTM 2 fault 0. Note that the pin source for fault 0
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM2_FLT0 drives FTM 2 fault 0.
 * - 1 - CMP0 OUT drives FTM 2 fault 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2FLT0 field. */
#define SIM_RD_SOPT4_FTM2FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2FLT0_MASK) >> SIM_SOPT4_FTM2FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM2FLT0(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2FLT0_SHIFT))

/*! @brief Set the FTM2FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM2FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2FLT0_MASK, SIM_SOPT4_FTM2FLT0(value)))
#define SIM_BWR_SOPT4_FTM2FLT0(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM2FLT0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM3FLT0[12] (RW)
 *
 * Selects the source of FTM 3 fault 0. Note that the pin source for fault 0
 * must be configured for the FTM fault function through the appropriate PCTL pin
 * control register.
 *
 * Values:
 * - 0 - FTM3_FLT0 drives FTM 2 fault 0.
 * - 1 - CMP0 OUT drives FTM 2 fault 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM3FLT0 field. */
#define SIM_RD_SOPT4_FTM3FLT0(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM3FLT0_MASK) >> SIM_SOPT4_FTM3FLT0_SHIFT)
#define SIM_BRD_SOPT4_FTM3FLT0(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM3FLT0_SHIFT))

/*! @brief Set the FTM3FLT0 field to a new value. */
#define SIM_WR_SOPT4_FTM3FLT0(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM3FLT0_MASK, SIM_SOPT4_FTM3FLT0(value)))
#define SIM_BWR_SOPT4_FTM3FLT0(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM3FLT0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1CH0SRC[19:18] (RW)
 *
 * Selects the source for FTM 1 channel 0 input capture.
 *
 * Values:
 * - 00 - FTM1_CH0 pin
 * - 01 - CMP0 output
 * - 10 - CMP1 output
 * - 11 - USB SOF trigger
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1CH0SRC field. */
#define SIM_RD_SOPT4_FTM1CH0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1CH0SRC_MASK) >> SIM_SOPT4_FTM1CH0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM1CH0SRC(base) (SIM_RD_SOPT4_FTM1CH0SRC(base))

/*! @brief Set the FTM1CH0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM1CH0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM1CH0SRC_MASK, SIM_SOPT4_FTM1CH0SRC(value)))
#define SIM_BWR_SOPT4_FTM1CH0SRC(base, value) (SIM_WR_SOPT4_FTM1CH0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM2CH0SRC[21:20] (RW)
 *
 * Selects the source for FTM 2 channel 0 input capture.
 *
 * Values:
 * - 00 - FTM2_CH0 pin
 * - 01 - CMP0 output
 * - 10 - CMP1 output
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM2CH0SRC field. */
#define SIM_RD_SOPT4_FTM2CH0SRC(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM2CH0SRC_MASK) >> SIM_SOPT4_FTM2CH0SRC_SHIFT)
#define SIM_BRD_SOPT4_FTM2CH0SRC(base) (SIM_RD_SOPT4_FTM2CH0SRC(base))

/*! @brief Set the FTM2CH0SRC field to a new value. */
#define SIM_WR_SOPT4_FTM2CH0SRC(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM2CH0SRC_MASK, SIM_SOPT4_FTM2CH0SRC(value)))
#define SIM_BWR_SOPT4_FTM2CH0SRC(base, value) (SIM_WR_SOPT4_FTM2CH0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM0CLKSEL[24] (RW)
 *
 * Selects the external pin used to drive the external clock to the FTM0 module.
 * Note that the selected pin must also be configured for the FTM external clock
 * function through the appropriate PCTL pin control register.
 *
 * Values:
 * - 0 - FTM0 external clock driven by FTM CLKIN0 pin
 * - 1 - FTM0 external clock driven by FTM CLKIN1 pin.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM0CLKSEL field. */
#define SIM_RD_SOPT4_FTM0CLKSEL(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM0CLKSEL_MASK) >> SIM_SOPT4_FTM0CLKSEL_SHIFT)
#define SIM_BRD_SOPT4_FTM0CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0CLKSEL_SHIFT))

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define SIM_WR_SOPT4_FTM0CLKSEL(base, value) (SIM_RMW_SOPT4(base, SIM_SOPT4_FTM0CLKSEL_MASK, SIM_SOPT4_FTM0CLKSEL(value)))
#define SIM_BWR_SOPT4_FTM0CLKSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM0CLKSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT4, field FTM1CLKSEL[25] (RW)
 *
 * Selects the external pin used to drive the external clock to the FTM1 module.
 * Note that the selected pin must also be configured for the FTM external clock
 * function through the appropriate PCTL pin control register.
 *
 * Values:
 * - 0 - FTM1 external clock driven by FTM CLKIN0 pin.
 * - 1 - FTM1 external clock driven by FTM CLKIN1 pin.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT4_FTM1CLKSEL field. */
#define SIM_RD_SOPT4_FTM1CLKSEL(base) ((SIM_SOPT4_REG(base) & SIM_SOPT4_FTM1CLKSEL_MASK) >> SIM_SOPT4_FTM1CLKSEL_SHIFT)
#define SIM_BRD_SOPT4_FTM1CLKSEL(base) (BITBAND_ACCESS32(&SIM_SOPT4_REG(base), SIM_SOPT4_FTM1CLKSEL_SHIFT))

