pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual SIM_SOPT5 bitfields
 */

/*!
 * @name Register SIM_SOPT5, field UART0TXSRC[1:0] (RW)
 *
 * Selects the source for the UART0 transmit data.
 *
 * Values:
 * - 00 - UART0_TX pin
 * - 01 - UART0_TX pin modulated with FTM1 channel 0 output
 * - 10 - UART0_TX pin modulated with FTM2 channel 0 output
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART0TXSRC field. */
#define SIM_RD_SOPT5_UART0TXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART0TXSRC_MASK) >> SIM_SOPT5_UART0TXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART0TXSRC(base) (SIM_RD_SOPT5_UART0TXSRC(base))

/*! @brief Set the UART0TXSRC field to a new value. */
#define SIM_WR_SOPT5_UART0TXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART0TXSRC_MASK, SIM_SOPT5_UART0TXSRC(value)))
#define SIM_BWR_SOPT5_UART0TXSRC(base, value) (SIM_WR_SOPT5_UART0TXSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART0RXSRC[3:2] (RW)
 *
 * Selects the source for the UART0 receive data.
 *
 * Values:
 * - 00 - UART0_RX pin
 * - 01 - CMP0
 * - 10 - CMP1
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART0RXSRC field. */
#define SIM_RD_SOPT5_UART0RXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART0RXSRC_MASK) >> SIM_SOPT5_UART0RXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART0RXSRC(base) (SIM_RD_SOPT5_UART0RXSRC(base))

/*! @brief Set the UART0RXSRC field to a new value. */
#define SIM_WR_SOPT5_UART0RXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART0RXSRC_MASK, SIM_SOPT5_UART0RXSRC(value)))
#define SIM_BWR_SOPT5_UART0RXSRC(base, value) (SIM_WR_SOPT5_UART0RXSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART1TXSRC[5:4] (RW)
 *
 * Selects the source for the UART1 transmit data.
 *
 * Values:
 * - 00 - UART1_TX pin
 * - 01 - UART1_TX pin modulated with FTM1 channel 0 Output
 * - 10 - UART1_TX pin modulated with FTM2 channel 0 Output
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART1TXSRC field. */
#define SIM_RD_SOPT5_UART1TXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART1TXSRC_MASK) >> SIM_SOPT5_UART1TXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART1TXSRC(base) (SIM_RD_SOPT5_UART1TXSRC(base))

/*! @brief Set the UART1TXSRC field to a new value. */
#define SIM_WR_SOPT5_UART1TXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART1TXSRC_MASK, SIM_SOPT5_UART1TXSRC(value)))
#define SIM_BWR_SOPT5_UART1TXSRC(base, value) (SIM_WR_SOPT5_UART1TXSRC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART1RXSRC[7:6] (RW)
 *
 * Selects the source for the UART1 receive data.
 *
 * Values:
 * - 00 - UART1_RX pin
 * - 01 - CMP0
 * - 10 - CMP1
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART1RXSRC field. */
#define SIM_RD_SOPT5_UART1RXSRC(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART1RXSRC_MASK) >> SIM_SOPT5_UART1RXSRC_SHIFT)
#define SIM_BRD_SOPT5_UART1RXSRC(base) (SIM_RD_SOPT5_UART1RXSRC(base))

/*! @brief Set the UART1RXSRC field to a new value. */
#define SIM_WR_SOPT5_UART1RXSRC(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART1RXSRC_MASK, SIM_SOPT5_UART1RXSRC(value)))
#define SIM_BWR_SOPT5_UART1RXSRC(base, value) (SIM_WR_SOPT5_UART1RXSRC(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SOPT6 - System Options Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SOPT6 - System Options Register 6 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT6 register
 */
/*@{*/
#define SIM_RD_SOPT6(base)       (SIM_SOPT6_REG(base))
#define SIM_WR_SOPT6(base, value) (SIM_SOPT6_REG(base) = (value))
#define SIM_RMW_SOPT6(base, mask, value) (SIM_WR_SOPT6(base, (SIM_RD_SOPT6(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT6(base, value) (SIM_WR_SOPT6(base, SIM_RD_SOPT6(base) |  (value)))
#define SIM_CLR_SOPT6(base, value) (SIM_WR_SOPT6(base, SIM_RD_SOPT6(base) & ~(value)))
#define SIM_TOG_SOPT6(base, value) (SIM_WR_SOPT6(base, SIM_RD_SOPT6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT6 bitfields
 */

/*!
 * @name Register SIM_SOPT6, field MCC[15:0] (RW)
 *
 * NFC hold cycle in case FlexBus request while NFC is granted.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_MCC field. */
#define SIM_RD_SOPT6_MCC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_MCC_MASK) >> SIM_SOPT6_MCC_SHIFT)
#define SIM_BRD_SOPT6_MCC(base) (SIM_RD_SOPT6_MCC(base))

/*! @brief Set the MCC field to a new value. */
#define SIM_WR_SOPT6_MCC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_MCC_MASK, SIM_SOPT6_MCC(value)))
#define SIM_BWR_SOPT6_MCC(base, value) (SIM_WR_SOPT6_MCC(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field PCR[19:16] (RW)
 *
 * FlexBus hold cycles before FlexBus can release bus to NFC or to IDLE.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_PCR field. */
#define SIM_RD_SOPT6_PCR(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_PCR_MASK) >> SIM_SOPT6_PCR_SHIFT)
#define SIM_BRD_SOPT6_PCR(base) (SIM_RD_SOPT6_PCR(base))

/*! @brief Set the PCR field to a new value. */
#define SIM_WR_SOPT6_PCR(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_PCR_MASK, SIM_SOPT6_PCR(value)))
#define SIM_BWR_SOPT6_PCR(base, value) (SIM_WR_SOPT6_PCR(base, value))
/*@}*/

/*******************************************************************************
 * SIM_SOPT7 - System Options Register 7
 ******************************************************************************/

/*!
 * @brief SIM_SOPT7 - System Options Register 7 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT7 register
 */
/*@{*/
#define SIM_RD_SOPT7(base)       (SIM_SOPT7_REG(base))
#define SIM_WR_SOPT7(base, value) (SIM_SOPT7_REG(base) = (value))
#define SIM_RMW_SOPT7(base, mask, value) (SIM_WR_SOPT7(base, (SIM_RD_SOPT7(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) |  (value)))
#define SIM_CLR_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) & ~(value)))
#define SIM_TOG_SOPT7(base, value) (SIM_WR_SOPT7(base, SIM_RD_SOPT7(base) ^  (value)))
/*@}*/

