pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the ADC2PRETRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC2PRETRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC2PRETRGSEL_MASK, SIM_SOPT7_ADC2PRETRGSEL(value)))
#define SIM_BWR_SOPT7_ADC2PRETRGSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC2PRETRGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC2ALTTRGEN[23] (RW)
 *
 * Enable alternative conversion triggers for ADC2.
 *
 * Values:
 * - 0 - PDB trigger selected for ADC2.
 * - 1 - Alternate trigger selected for ADC2.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC2ALTTRGEN field. */
#define SIM_RD_SOPT7_ADC2ALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC2ALTTRGEN_MASK) >> SIM_SOPT7_ADC2ALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADC2ALTTRGEN(base) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC2ALTTRGEN_SHIFT))

/*! @brief Set the ADC2ALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADC2ALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC2ALTTRGEN_MASK, SIM_SOPT7_ADC2ALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADC2ALTTRGEN(base, value) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC2ALTTRGEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC3TRGSEL[27:24] (RW)
 *
 * Selects the ADC3 trigger source when alternative triggers are enabled through
 * ADC3ALTTRGEN.
 *
 * Values:
 * - 0000 - External trigger
 * - 0001 - High speed comparator 0 asynchronous interrupt
 * - 0010 - High speed comparator 1 asynchronous interrupt
 * - 0011 - High speed comparator 2 asynchronous interrupt
 * - 0100 - PIT trigger 0
 * - 0101 - PIT trigger 1
 * - 0110 - PIT trigger 2
 * - 0111 - PIT trigger 3
 * - 1000 - FTM0 trigger
 * - 1001 - FTM1 trigger
 * - 1010 - FTM2 trigger
 * - 1011 - FTM3 trigger
 * - 1100 - RTC alarm
 * - 1101 - RTC seconds
 * - 1110 - Low-power timer trigger
 * - 1111 - High speed comparator 3 asynchronous interrupt
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC3TRGSEL field. */
#define SIM_RD_SOPT7_ADC3TRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC3TRGSEL_MASK) >> SIM_SOPT7_ADC3TRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC3TRGSEL(base) (SIM_RD_SOPT7_ADC3TRGSEL(base))

/*! @brief Set the ADC3TRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC3TRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC3TRGSEL_MASK, SIM_SOPT7_ADC3TRGSEL(value)))
#define SIM_BWR_SOPT7_ADC3TRGSEL(base, value) (SIM_WR_SOPT7_ADC3TRGSEL(base, value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC3PRETRGSEL[28] (RW)
 *
 * Selects the ADC3 pre-trigger source when alternative triggers are enabled
 * through ADC3ALTTRGEN.
 *
 * Values:
 * - 0 - Pre-trigger A selected for ADC3.
 * - 1 - Pre-trigger B selected for ADC3.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC3PRETRGSEL field. */
#define SIM_RD_SOPT7_ADC3PRETRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC3PRETRGSEL_MASK) >> SIM_SOPT7_ADC3PRETRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC3PRETRGSEL(base) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC3PRETRGSEL_SHIFT))

/*! @brief Set the ADC3PRETRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC3PRETRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC3PRETRGSEL_MASK, SIM_SOPT7_ADC3PRETRGSEL(value)))
#define SIM_BWR_SOPT7_ADC3PRETRGSEL(base, value) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC3PRETRGSEL_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC3ALTTRGEN[31] (RW)
 *
 * Enable alternative conversion triggers for ADC3.
 *
 * Values:
 * - 0 - PDB trigger selected for ADC3.
 * - 1 - Alternate trigger selected for ADC3.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC3ALTTRGEN field. */
#define SIM_RD_SOPT7_ADC3ALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC3ALTTRGEN_MASK) >> SIM_SOPT7_ADC3ALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADC3ALTTRGEN(base) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC3ALTTRGEN_SHIFT))

/*! @brief Set the ADC3ALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADC3ALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC3ALTTRGEN_MASK, SIM_SOPT7_ADC3ALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADC3ALTTRGEN(base, value) (BITBAND_ACCESS32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC3ALTTRGEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SDID - System Device Identification Register
 ******************************************************************************/

/*!
 * @brief SIM_SDID - System Device Identification Register (RO)
 *
 * Reset value: 0x00000180U
 */
/*!
 * @name Constants and macros for entire SIM_SDID register
 */
/*@{*/
#define SIM_RD_SDID(base)        (SIM_SDID_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_SDID bitfields
 */

/*!
 * @name Register SIM_SDID, field PINID[3:0] (RO)
 *
 * Specifies the pincount of the device.
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - Reserved
 * - 0010 - Reserved
 * - 0011 - Reserved
 * - 0100 - Reserved
 * - 0101 - Reserved
 * - 0110 - Reserved
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - 144-pin
 * - 1011 - Reserved
 * - 1100 - 196-pin
 * - 1101 - Reserved
 * - 1110 - 256-pin
 * - 1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_PINID field. */
#define SIM_RD_SDID_PINID(base) ((SIM_SDID_REG(base) & SIM_SDID_PINID_MASK) >> SIM_SDID_PINID_SHIFT)
#define SIM_BRD_SDID_PINID(base) (SIM_RD_SDID_PINID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field FAMID[6:4] (RO)
 *
 * Specifies the Kinetis family of the device.
 *
 * Values:
 * - 000 - K10
 * - 001 - K20
 * - 010 - K61
 * - 011 - Reserved
 * - 100 - K60
 * - 101 - K70
 * - 110 - Reserved
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_FAMID field. */
#define SIM_RD_SDID_FAMID(base) ((SIM_SDID_REG(base) & SIM_SDID_FAMID_MASK) >> SIM_SDID_FAMID_SHIFT)
#define SIM_BRD_SDID_FAMID(base) (SIM_RD_SDID_FAMID(base))
/*@}*/

/*!
 * @name Register SIM_SDID, field REVID[15:12] (RO)
 *
 * Specifies the silicon implementation number for the device.
 */
/*@{*/
/*! @brief Read current value of the SIM_SDID_REVID field. */
#define SIM_RD_SDID_REVID(base) ((SIM_SDID_REG(base) & SIM_SDID_REVID_MASK) >> SIM_SDID_REVID_SHIFT)
#define SIM_BRD_SDID_REVID(base) (SIM_RD_SDID_REVID(base))
/*@}*/

