pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * SIM_SCGC3 - System Clock Gating Control Register 3
 ******************************************************************************/

/*!
 * @brief SIM_SCGC3 - System Clock Gating Control Register 3 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC3 register
 */
/*@{*/
#define SIM_RD_SCGC3(base)       (SIM_SCGC3_REG(base))
#define SIM_WR_SCGC3(base, value) (SIM_SCGC3_REG(base) = (value))
#define SIM_RMW_SCGC3(base, mask, value) (SIM_WR_SCGC3(base, (SIM_RD_SCGC3(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) |  (value)))
#define SIM_CLR_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) & ~(value)))
#define SIM_TOG_SCGC3(base, value) (SIM_WR_SCGC3(base, SIM_RD_SCGC3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC3 bitfields
 */

/*!
 * @name Register SIM_SCGC3, field RNGA[0] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_RNGA field. */
#define SIM_RD_SCGC3_RNGA(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_RNGA_MASK) >> SIM_SCGC3_RNGA_SHIFT)
#define SIM_BRD_SCGC3_RNGA(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_RNGA_SHIFT))

/*! @brief Set the RNGA field to a new value. */
#define SIM_WR_SCGC3_RNGA(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_RNGA_MASK, SIM_SCGC3_RNGA(value)))
#define SIM_BWR_SCGC3_RNGA(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_RNGA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field FLEXCAN1[4] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_FLEXCAN1 field. */
#define SIM_RD_SCGC3_FLEXCAN1(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_FLEXCAN1_MASK) >> SIM_SCGC3_FLEXCAN1_SHIFT)
#define SIM_BRD_SCGC3_FLEXCAN1(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FLEXCAN1_SHIFT))

/*! @brief Set the FLEXCAN1 field to a new value. */
#define SIM_WR_SCGC3_FLEXCAN1(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_FLEXCAN1_MASK, SIM_SCGC3_FLEXCAN1(value)))
#define SIM_BWR_SCGC3_FLEXCAN1(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FLEXCAN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field NFC[8] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_NFC field. */
#define SIM_RD_SCGC3_NFC(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_NFC_MASK) >> SIM_SCGC3_NFC_SHIFT)
#define SIM_BRD_SCGC3_NFC(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_NFC_SHIFT))

/*! @brief Set the NFC field to a new value. */
#define SIM_WR_SCGC3_NFC(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_NFC_MASK, SIM_SCGC3_NFC(value)))
#define SIM_BWR_SCGC3_NFC(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_NFC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field DSPI2[12] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_DSPI2 field. */
#define SIM_RD_SCGC3_DSPI2(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_DSPI2_MASK) >> SIM_SCGC3_DSPI2_SHIFT)
#define SIM_BRD_SCGC3_DSPI2(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_DSPI2_SHIFT))

/*! @brief Set the DSPI2 field to a new value. */
#define SIM_WR_SCGC3_DSPI2(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_DSPI2_MASK, SIM_SCGC3_DSPI2(value)))
#define SIM_BWR_SCGC3_DSPI2(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_DSPI2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field DDR[14] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_DDR field. */
#define SIM_RD_SCGC3_DDR(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_DDR_MASK) >> SIM_SCGC3_DDR_SHIFT)
#define SIM_BRD_SCGC3_DDR(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_DDR_SHIFT))

/*! @brief Set the DDR field to a new value. */
#define SIM_WR_SCGC3_DDR(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_DDR_MASK, SIM_SCGC3_DDR(value)))
#define SIM_BWR_SCGC3_DDR(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_DDR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field SAI1[15] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_SAI1 field. */
#define SIM_RD_SCGC3_SAI1(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_SAI1_MASK) >> SIM_SCGC3_SAI1_SHIFT)
#define SIM_BRD_SCGC3_SAI1(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_SAI1_SHIFT))

/*! @brief Set the SAI1 field to a new value. */
#define SIM_WR_SCGC3_SAI1(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_SAI1_MASK, SIM_SCGC3_SAI1(value)))
#define SIM_BWR_SCGC3_SAI1(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_SAI1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field ESDHC[17] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_ESDHC field. */
#define SIM_RD_SCGC3_ESDHC(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_ESDHC_MASK) >> SIM_SCGC3_ESDHC_SHIFT)
#define SIM_BRD_SCGC3_ESDHC(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ESDHC_SHIFT))

/*! @brief Set the ESDHC field to a new value. */
#define SIM_WR_SCGC3_ESDHC(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_ESDHC_MASK, SIM_SCGC3_ESDHC(value)))
#define SIM_BWR_SCGC3_ESDHC(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ESDHC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field LCDC[22] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_LCDC field. */
#define SIM_RD_SCGC3_LCDC(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_LCDC_MASK) >> SIM_SCGC3_LCDC_SHIFT)
#define SIM_BRD_SCGC3_LCDC(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_LCDC_SHIFT))

/*! @brief Set the LCDC field to a new value. */
#define SIM_WR_SCGC3_LCDC(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_LCDC_MASK, SIM_SCGC3_LCDC(value)))
#define SIM_BWR_SCGC3_LCDC(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_LCDC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field FTM2[24] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_FTM2 field. */
#define SIM_RD_SCGC3_FTM2(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_FTM2_MASK) >> SIM_SCGC3_FTM2_SHIFT)
#define SIM_BRD_SCGC3_FTM2(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FTM2_SHIFT))

/*! @brief Set the FTM2 field to a new value. */
#define SIM_WR_SCGC3_FTM2(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_FTM2_MASK, SIM_SCGC3_FTM2(value)))
#define SIM_BWR_SCGC3_FTM2(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FTM2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field FTM3[25] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_FTM3 field. */
#define SIM_RD_SCGC3_FTM3(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_FTM3_MASK) >> SIM_SCGC3_FTM3_SHIFT)
#define SIM_BRD_SCGC3_FTM3(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FTM3_SHIFT))

/*! @brief Set the FTM3 field to a new value. */
#define SIM_WR_SCGC3_FTM3(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_FTM3_MASK, SIM_SCGC3_FTM3(value)))
#define SIM_BWR_SCGC3_FTM3(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_FTM3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field ADC1[27] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_ADC1 field. */
#define SIM_RD_SCGC3_ADC1(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_ADC1_MASK) >> SIM_SCGC3_ADC1_SHIFT)
#define SIM_BRD_SCGC3_ADC1(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ADC1_SHIFT))

/*! @brief Set the ADC1 field to a new value. */
#define SIM_WR_SCGC3_ADC1(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_ADC1_MASK, SIM_SCGC3_ADC1(value)))
#define SIM_BWR_SCGC3_ADC1(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ADC1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field ADC3[28] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_ADC3 field. */
#define SIM_RD_SCGC3_ADC3(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_ADC3_MASK) >> SIM_SCGC3_ADC3_SHIFT)
#define SIM_BRD_SCGC3_ADC3(base) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ADC3_SHIFT))

/*! @brief Set the ADC3 field to a new value. */
#define SIM_WR_SCGC3_ADC3(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_ADC3_MASK, SIM_SCGC3_ADC3(value)))
#define SIM_BWR_SCGC3_ADC3(base, value) (BITBAND_ACCESS32(&SIM_SCGC3_REG(base), SIM_SCGC3_ADC3_SHIFT) = (value))
/*@}*/

