pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the PORTC field to a new value. */
#define SIM_WR_SCGC5_PORTC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTC_MASK, SIM_SCGC5_PORTC(value)))
#define SIM_BWR_SCGC5_PORTC(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTD[12] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTD field. */
#define SIM_RD_SCGC5_PORTD(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTD_MASK) >> SIM_SCGC5_PORTD_SHIFT)
#define SIM_BRD_SCGC5_PORTD(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTD_SHIFT))

/*! @brief Set the PORTD field to a new value. */
#define SIM_WR_SCGC5_PORTD(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTD_MASK, SIM_SCGC5_PORTD(value)))
#define SIM_BWR_SCGC5_PORTD(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTE[13] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTE field. */
#define SIM_RD_SCGC5_PORTE(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTE_MASK) >> SIM_SCGC5_PORTE_SHIFT)
#define SIM_BRD_SCGC5_PORTE(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTE_SHIFT))

/*! @brief Set the PORTE field to a new value. */
#define SIM_WR_SCGC5_PORTE(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTE_MASK, SIM_SCGC5_PORTE(value)))
#define SIM_BWR_SCGC5_PORTE(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTF[14] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTF field. */
#define SIM_RD_SCGC5_PORTF(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTF_MASK) >> SIM_SCGC5_PORTF_SHIFT)
#define SIM_BRD_SCGC5_PORTF(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTF_SHIFT))

/*! @brief Set the PORTF field to a new value. */
#define SIM_WR_SCGC5_PORTF(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTF_MASK, SIM_SCGC5_PORTF(value)))
#define SIM_BWR_SCGC5_PORTF(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SCGC6 - System Clock Gating Control Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SCGC6 - System Clock Gating Control Register 6 (RW)
 *
 * Reset value: 0x40000001U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC6 register
 */
/*@{*/
#define SIM_RD_SCGC6(base)       (SIM_SCGC6_REG(base))
#define SIM_WR_SCGC6(base, value) (SIM_SCGC6_REG(base) = (value))
#define SIM_RMW_SCGC6(base, mask, value) (SIM_WR_SCGC6(base, (SIM_RD_SCGC6(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) |  (value)))
#define SIM_CLR_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) & ~(value)))
#define SIM_TOG_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC6 bitfields
 */

/*!
 * @name Register SIM_SCGC6, field DMAMUX0[1] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX0 field. */
#define SIM_RD_SCGC6_DMAMUX0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX0_MASK) >> SIM_SCGC6_DMAMUX0_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX0(base) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX0_SHIFT))

/*! @brief Set the DMAMUX0 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX0_MASK, SIM_SCGC6_DMAMUX0(value)))
#define SIM_BWR_SCGC6_DMAMUX0(base, value) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DMAMUX1[2] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DMAMUX1 field. */
#define SIM_RD_SCGC6_DMAMUX1(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DMAMUX1_MASK) >> SIM_SCGC6_DMAMUX1_SHIFT)
#define SIM_BRD_SCGC6_DMAMUX1(base) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX1_SHIFT))

/*! @brief Set the DMAMUX1 field to a new value. */
#define SIM_WR_SCGC6_DMAMUX1(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DMAMUX1_MASK, SIM_SCGC6_DMAMUX1(value)))
#define SIM_BWR_SCGC6_DMAMUX1(base, value) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DMAMUX1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field FLEXCAN0[4] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_FLEXCAN0 field. */
#define SIM_RD_SCGC6_FLEXCAN0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_FLEXCAN0_MASK) >> SIM_SCGC6_FLEXCAN0_SHIFT)
#define SIM_BRD_SCGC6_FLEXCAN0(base) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_FLEXCAN0_SHIFT))

/*! @brief Set the FLEXCAN0 field to a new value. */
#define SIM_WR_SCGC6_FLEXCAN0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_FLEXCAN0_MASK, SIM_SCGC6_FLEXCAN0(value)))
#define SIM_BWR_SCGC6_FLEXCAN0(base, value) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_FLEXCAN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DSPI0[12] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DSPI0 field. */
#define SIM_RD_SCGC6_DSPI0(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DSPI0_MASK) >> SIM_SCGC6_DSPI0_SHIFT)
#define SIM_BRD_SCGC6_DSPI0(base) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DSPI0_SHIFT))

/*! @brief Set the DSPI0 field to a new value. */
#define SIM_WR_SCGC6_DSPI0(base, value) (SIM_RMW_SCGC6(base, SIM_SCGC6_DSPI0_MASK, SIM_SCGC6_DSPI0(value)))
#define SIM_BWR_SCGC6_DSPI0(base, value) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DSPI0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC6, field DSPI1[13] (RW)
 *
 * Values:
 * - 0 - Clock is disabled.
 * - 1 - Clock is enabled.
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC6_DSPI1 field. */
#define SIM_RD_SCGC6_DSPI1(base) ((SIM_SCGC6_REG(base) & SIM_SCGC6_DSPI1_MASK) >> SIM_SCGC6_DSPI1_SHIFT)
#define SIM_BRD_SCGC6_DSPI1(base) (BITBAND_ACCESS32(&SIM_SCGC6_REG(base), SIM_SCGC6_DSPI1_SHIFT))

