pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the OUTDIV3 field to a new value. */
#define SIM_WR_CLKDIV1_OUTDIV3(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_OUTDIV3_MASK, SIM_CLKDIV1_OUTDIV3(value)))
#define SIM_BWR_CLKDIV1_OUTDIV3(base, value) (SIM_WR_CLKDIV1_OUTDIV3(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field OUTDIV2[27:24] (RW)
 *
 * This field sets the divide value for the peripheral clock. At the end of
 * reset, it is loaded with either 0000 or 0111 depending on FTFE_FOPT[LPBOOT].
 *
 * Values:
 * - 0000 - Divide-by-1.
 * - 0001 - Divide-by-2.
 * - 0010 - Divide-by-3.
 * - 0011 - Divide-by-4.
 * - 0100 - Divide-by-5.
 * - 0101 - Divide-by-6.
 * - 0110 - Divide-by-7.
 * - 0111 - Divide-by-8.
 * - 1000 - Divide-by-9.
 * - 1001 - Divide-by-10.
 * - 1010 - Divide-by-11.
 * - 1011 - Divide-by-12.
 * - 1100 - Divide-by-13.
 * - 1101 - Divide-by-14.
 * - 1110 - Divide-by-15.
 * - 1111 - Divide-by-16.
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_OUTDIV2 field. */
#define SIM_RD_CLKDIV1_OUTDIV2(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_OUTDIV2_MASK) >> SIM_CLKDIV1_OUTDIV2_SHIFT)
#define SIM_BRD_CLKDIV1_OUTDIV2(base) (SIM_RD_CLKDIV1_OUTDIV2(base))

/*! @brief Set the OUTDIV2 field to a new value. */
#define SIM_WR_CLKDIV1_OUTDIV2(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_OUTDIV2_MASK, SIM_CLKDIV1_OUTDIV2(value)))
#define SIM_BWR_CLKDIV1_OUTDIV2(base, value) (SIM_WR_CLKDIV1_OUTDIV2(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV1, field OUTDIV1[31:28] (RW)
 *
 * This field sets the divide value for the core/system clock. At the end of
 * reset, it is loaded with either 0000 or 0111 depending on FTFE_FOPT[LPBOOT].
 *
 * Values:
 * - 0000 - Divide-by-1.
 * - 0001 - Divide-by-2.
 * - 0010 - Divide-by-3.
 * - 0011 - Divide-by-4.
 * - 0100 - Divide-by-5.
 * - 0101 - Divide-by-6.
 * - 0110 - Divide-by-7.
 * - 0111 - Divide-by-8.
 * - 1000 - Divide-by-9.
 * - 1001 - Divide-by-10.
 * - 1010 - Divide-by-11.
 * - 1011 - Divide-by-12.
 * - 1100 - Divide-by-13.
 * - 1101 - Divide-by-14.
 * - 1110 - Divide-by-15.
 * - 1111 - Divide-by-16.
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV1_OUTDIV1 field. */
#define SIM_RD_CLKDIV1_OUTDIV1(base) ((SIM_CLKDIV1_REG(base) & SIM_CLKDIV1_OUTDIV1_MASK) >> SIM_CLKDIV1_OUTDIV1_SHIFT)
#define SIM_BRD_CLKDIV1_OUTDIV1(base) (SIM_RD_CLKDIV1_OUTDIV1(base))

/*! @brief Set the OUTDIV1 field to a new value. */
#define SIM_WR_CLKDIV1_OUTDIV1(base, value) (SIM_RMW_CLKDIV1(base, SIM_CLKDIV1_OUTDIV1_MASK, SIM_CLKDIV1_OUTDIV1(value)))
#define SIM_BWR_CLKDIV1_OUTDIV1(base, value) (SIM_WR_CLKDIV1_OUTDIV1(base, value))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV2 - System Clock Divider Register 2
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV2 - System Clock Divider Register 2 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV2 register
 */
/*@{*/
#define SIM_RD_CLKDIV2(base)     (SIM_CLKDIV2_REG(base))
#define SIM_WR_CLKDIV2(base, value) (SIM_CLKDIV2_REG(base) = (value))
#define SIM_RMW_CLKDIV2(base, mask, value) (SIM_WR_CLKDIV2(base, (SIM_RD_CLKDIV2(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV2(base, value) (SIM_WR_CLKDIV2(base, SIM_RD_CLKDIV2(base) |  (value)))
#define SIM_CLR_CLKDIV2(base, value) (SIM_WR_CLKDIV2(base, SIM_RD_CLKDIV2(base) & ~(value)))
#define SIM_TOG_CLKDIV2(base, value) (SIM_WR_CLKDIV2(base, SIM_RD_CLKDIV2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV2 bitfields
 */

/*!
 * @name Register SIM_CLKDIV2, field USBFSFRAC[0] (RW)
 *
 * This field sets the fraction multiply value for the fractional clock divider
 * used as a USB clock source (SOPT2[USBFSRC] = 1). Divider output clock =
 * Divider input clock * [(USBFSFRAC+1) / (USBFSDIV+1)]
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV2_USBFSFRAC field. */
#define SIM_RD_CLKDIV2_USBFSFRAC(base) ((SIM_CLKDIV2_REG(base) & SIM_CLKDIV2_USBFSFRAC_MASK) >> SIM_CLKDIV2_USBFSFRAC_SHIFT)
#define SIM_BRD_CLKDIV2_USBFSFRAC(base) (BITBAND_ACCESS32(&SIM_CLKDIV2_REG(base), SIM_CLKDIV2_USBFSFRAC_SHIFT))

/*! @brief Set the USBFSFRAC field to a new value. */
#define SIM_WR_CLKDIV2_USBFSFRAC(base, value) (SIM_RMW_CLKDIV2(base, SIM_CLKDIV2_USBFSFRAC_MASK, SIM_CLKDIV2_USBFSFRAC(value)))
#define SIM_BWR_CLKDIV2_USBFSFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV2_REG(base), SIM_CLKDIV2_USBFSFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV2, field USBFSDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * USB clock source (SOPT2[USBFSRC] = 1). Divider output clock = Divider input
 * clock * [(USBFSFRAC+1) / (USBFSDIV+1)]
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV2_USBFSDIV field. */
#define SIM_RD_CLKDIV2_USBFSDIV(base) ((SIM_CLKDIV2_REG(base) & SIM_CLKDIV2_USBFSDIV_MASK) >> SIM_CLKDIV2_USBFSDIV_SHIFT)
#define SIM_BRD_CLKDIV2_USBFSDIV(base) (SIM_RD_CLKDIV2_USBFSDIV(base))

/*! @brief Set the USBFSDIV field to a new value. */
#define SIM_WR_CLKDIV2_USBFSDIV(base, value) (SIM_RMW_CLKDIV2(base, SIM_CLKDIV2_USBFSDIV_MASK, SIM_CLKDIV2_USBFSDIV(value)))
#define SIM_BWR_CLKDIV2_USBFSDIV(base, value) (SIM_WR_CLKDIV2_USBFSDIV(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV2, field USBHSFRAC[8] (RW)
 *
 * This field sets the fraction multiply value for the fractional clock divider
 * used as a USB clock source (SOPT2[USBHSRC] = 1). Divider output clock =
 * Divider input clock * [(USBHSFRAC+1) / (USBHSDIV+1)]
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV2_USBHSFRAC field. */
#define SIM_RD_CLKDIV2_USBHSFRAC(base) ((SIM_CLKDIV2_REG(base) & SIM_CLKDIV2_USBHSFRAC_MASK) >> SIM_CLKDIV2_USBHSFRAC_SHIFT)
#define SIM_BRD_CLKDIV2_USBHSFRAC(base) (BITBAND_ACCESS32(&SIM_CLKDIV2_REG(base), SIM_CLKDIV2_USBHSFRAC_SHIFT))

/*! @brief Set the USBHSFRAC field to a new value. */
#define SIM_WR_CLKDIV2_USBHSFRAC(base, value) (SIM_RMW_CLKDIV2(base, SIM_CLKDIV2_USBHSFRAC_MASK, SIM_CLKDIV2_USBHSFRAC(value)))
#define SIM_BWR_CLKDIV2_USBHSFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV2_REG(base), SIM_CLKDIV2_USBHSFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV2, field USBHSDIV[11:9] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * USB clock source (SOPT2[USBHSRC] = 1). Divider output clock = Divider input
 * clock * [(USBHSFRAC+1) / (USBHSDIV+1)]
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV2_USBHSDIV field. */
#define SIM_RD_CLKDIV2_USBHSDIV(base) ((SIM_CLKDIV2_REG(base) & SIM_CLKDIV2_USBHSDIV_MASK) >> SIM_CLKDIV2_USBHSDIV_SHIFT)
#define SIM_BRD_CLKDIV2_USBHSDIV(base) (SIM_RD_CLKDIV2_USBHSDIV(base))

/*! @brief Set the USBHSDIV field to a new value. */
#define SIM_WR_CLKDIV2_USBHSDIV(base, value) (SIM_RMW_CLKDIV2(base, SIM_CLKDIV2_USBHSDIV_MASK, SIM_CLKDIV2_USBHSDIV(value)))
#define SIM_BWR_CLKDIV2_USBHSDIV(base, value) (SIM_WR_CLKDIV2_USBHSDIV(base, value))
/*@}*/

