pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * SIM_FCFG1 - Flash Configuration Register 1
 ******************************************************************************/

/*!
 * @brief SIM_FCFG1 - Flash Configuration Register 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_FCFG1 register
 */
/*@{*/
#define SIM_RD_FCFG1(base)       (SIM_FCFG1_REG(base))
#define SIM_WR_FCFG1(base, value) (SIM_FCFG1_REG(base) = (value))
#define SIM_RMW_FCFG1(base, mask, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~(mask)) | (value)))
#define SIM_SET_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) |  (value)))
#define SIM_CLR_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) & ~(value)))
#define SIM_TOG_FCFG1(base, value) (SIM_WR_FCFG1(base, SIM_RD_FCFG1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG1 bitfields
 */

/*!
 * @name Register SIM_FCFG1, field FTFDIS[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FTFDIS field. */
#define SIM_RD_FCFG1_FTFDIS(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FTFDIS_MASK) >> SIM_FCFG1_FTFDIS_SHIFT)
#define SIM_BRD_FCFG1_FTFDIS(base) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FTFDIS_SHIFT))

/*! @brief Set the FTFDIS field to a new value. */
#define SIM_WR_FCFG1_FTFDIS(base, value) (SIM_RMW_FCFG1(base, SIM_FCFG1_FTFDIS_MASK, SIM_FCFG1_FTFDIS(value)))
#define SIM_BWR_FCFG1_FTFDIS(base, value) (BITBAND_ACCESS32(&SIM_FCFG1_REG(base), SIM_FCFG1_FTFDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field DEPART[11:8] (RO)
 *
 * For devices with FlexNVM: Data flash / EEPROM backup split . See DEPART bit
 * description in FTFE chapter. For devices without FlexNVM: Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_DEPART field. */
#define SIM_RD_FCFG1_DEPART(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_DEPART_MASK) >> SIM_FCFG1_DEPART_SHIFT)
#define SIM_BRD_FCFG1_DEPART(base) (SIM_RD_FCFG1_DEPART(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field EESIZE[19:16] (RO)
 *
 * EEPROM data size .
 *
 * Values:
 * - 0000 - 16 KB
 * - 0001 - 8 KB
 * - 0010 - 4 KB
 * - 0011 - 2 KB
 * - 0100 - 1 KB
 * - 0101 - 512 Bytes
 * - 0110 - 256 Bytes
 * - 0111 - 128 Bytes
 * - 1000 - 64 Bytes
 * - 1001 - 32 Bytes
 * - 1111 - 0 Bytes
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_EESIZE field. */
#define SIM_RD_FCFG1_EESIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_EESIZE_MASK) >> SIM_FCFG1_EESIZE_SHIFT)
#define SIM_BRD_FCFG1_EESIZE(base) (SIM_RD_FCFG1_EESIZE(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field PFSIZE[27:24] (RO)
 *
 * This field specifies the amount of program flash memory available on the
 * device .
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - Reserved
 * - 0010 - Reserved
 * - 0011 - Reserved
 * - 0100 - Reserved
 * - 0101 - Reserved
 * - 0110 - Reserved
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - Reserved
 * - 1011 - 512 KB, 16 KB protection size
 * - 1100 - Reserved
 * - 1101 - 1024 KB, 32 KB protection size
 * - 1110 - Reserved
 * - 1111 - 1024 KB, 32 KB protection size
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_PFSIZE field. */
#define SIM_RD_FCFG1_PFSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_PFSIZE_MASK) >> SIM_FCFG1_PFSIZE_SHIFT)
#define SIM_BRD_FCFG1_PFSIZE(base) (SIM_RD_FCFG1_PFSIZE(base))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field NVMSIZE[31:28] (RO)
 *
 * This field specifies the amount of FlexNVM memory available on the device .
 *
 * Values:
 * - 0000 - 0 KB
 * - 0001 - Reserved
 * - 0010 - Reserved
 * - 0011 - Reserved
 * - 0100 - Reserved
 * - 0101 - Reserved
 * - 0110 - Reserved
 * - 0111 - Reserved
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1010 - Reserved
 * - 1011 - 512 KB, 16 KB protection region
 * - 1100 - Reserved
 * - 1101 - Reserved
 * - 1110 - Reserved
 * - 1111 - 512 KB, 16 KB protection region
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_NVMSIZE field. */
#define SIM_RD_FCFG1_NVMSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_NVMSIZE_MASK) >> SIM_FCFG1_NVMSIZE_SHIFT)
#define SIM_BRD_FCFG1_NVMSIZE(base) (SIM_RD_FCFG1_NVMSIZE(base))
/*@}*/

/*******************************************************************************
 * SIM_FCFG2 - Flash Configuration Register 2
 ******************************************************************************/

/*!
 * @brief SIM_FCFG2 - Flash Configuration Register 2 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_FCFG2 register
 */
/*@{*/
#define SIM_RD_FCFG2(base)       (SIM_FCFG2_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG2 bitfields
 */

/*!
 * @name Register SIM_FCFG2, field MAXADDR23[21:16] (RO)
 *
 * For devices with FlexNVM: This field concatenated with 13 zeros plus the
 * FlexNVM base address indicates the number of 8 KB regions in logically interleaved
 * FlexNVM blocks 2 or 3. For example, relative FlexNVM byte addresses below
 * {MAXADDR23,13'b0} are valid for block 2 while byte addresses at or above
 * {MAXADDR23,13'b0} and below {2*MAXADDR23,13'b0} are valid block 3. For devices with
 * program flash only: This field concatenated with 13 zeros plus the value of the
 * MAXADDR01 field indicates the number of 8 KB regions in logically interleaved
 * program flash blocks 2 or 3. For example, relative P-Flash byte addresses at
 * or above {2*MAXADDR01,13'b0} and below {2*MAXADDR01+MAXADDR23,13'b0} are valid
 * for block 2 while byte addresses at or above {2*MAXADDR01+MAXADDR23,13'b0} and
 * below {2*MAXADDR01+2*MAXADDR23,13'b0} are valid for block 3.
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG2_MAXADDR23 field. */
#define SIM_RD_FCFG2_MAXADDR23(base) ((SIM_FCFG2_REG(base) & SIM_FCFG2_MAXADDR23_MASK) >> SIM_FCFG2_MAXADDR23_SHIFT)
#define SIM_BRD_FCFG2_MAXADDR23(base) (SIM_RD_FCFG2_MAXADDR23(base))
/*@}*/

/*!
 * @name Register SIM_FCFG2, field MAXADDR01[29:24] (RO)
 *
 * This field concatenated with 13 zeros indicates the number of 8 KB regions in
 * logically interleaved program plash blocks 0 or 1.
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG2_MAXADDR01 field. */
#define SIM_RD_FCFG2_MAXADDR01(base) ((SIM_FCFG2_REG(base) & SIM_FCFG2_MAXADDR01_MASK) >> SIM_FCFG2_MAXADDR01_SHIFT)
#define SIM_BRD_FCFG2_MAXADDR01(base) (SIM_RD_FCFG2_MAXADDR01(base))
/*@}*/

