pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the TRACEFRAC field to a new value. */
#define SIM_WR_CLKDIV4_TRACEFRAC(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEFRAC_MASK, SIM_CLKDIV4_TRACEFRAC(value)))
#define SIM_BWR_CLKDIV4_TRACEFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the fractional clock divider is
 * set by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock * ((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIV field. */
#define SIM_RD_CLKDIV4_TRACEDIV(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIV_MASK) >> SIM_CLKDIV4_TRACEDIV_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIV(base) (SIM_RD_CLKDIV4_TRACEDIV(base))

/*! @brief Set the TRACEDIV field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIV(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIV_MASK, SIM_CLKDIV4_TRACEDIV(value)))
#define SIM_BWR_CLKDIV4_TRACEDIV(base, value) (SIM_WR_CLKDIV4_TRACEDIV(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field NFCFRAC[26:24] (RW)
 *
 * This field sets the fraction multiply value for the fractional clock divider
 * used as a source for NFC flash clock. The source clock for the fractional
 * clock divider is set by the SOPT2[NFCSRC] bitfield. Divider output clock = Divider
 * input clock x ((NFCFRAC+1)/(NFCDIV+1)) The reciprocal of
 * ((NFCFRAC+1)/(NFCDIV+1)) must be a multiple of 0.5. For example, NFCFRAC = 1 and NFCDIV = 2 is a
 * valid setting, since the reciprocal is 1.5. However, NFCFRAC = 2 and NFCDIV=7
 * is not a valid setting, since the reciprocal is 2.6667.
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_NFCFRAC field. */
#define SIM_RD_CLKDIV4_NFCFRAC(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_NFCFRAC_MASK) >> SIM_CLKDIV4_NFCFRAC_SHIFT)
#define SIM_BRD_CLKDIV4_NFCFRAC(base) (SIM_RD_CLKDIV4_NFCFRAC(base))

/*! @brief Set the NFCFRAC field to a new value. */
#define SIM_WR_CLKDIV4_NFCFRAC(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_NFCFRAC_MASK, SIM_CLKDIV4_NFCFRAC(value)))
#define SIM_BWR_CLKDIV4_NFCFRAC(base, value) (SIM_WR_CLKDIV4_NFCFRAC(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field NFCDIV[31:27] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for NFC flash clock. The source clock for the fractional clock divider
 * is set by the SOPT2[NFCSRC] bitfield. Divider output clock = Divider input
 * clock x ((NFCFRAC+1)/(NFCDIV+1)) The reciprocal of ((NFCFRAC+1)/(NFCDIV+1)) must
 * be a multiple of 0.5. For example, NFCFRAC = 1 and NFCDIV = 2 is a valid
 * setting, since the reciprocal is 1.5. However, NFCFRAC = 2 and NFCDIV=7 is not a
 * valid setting, since the reciprocal is 2.6667.
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_NFCDIV field. */
#define SIM_RD_CLKDIV4_NFCDIV(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_NFCDIV_MASK) >> SIM_CLKDIV4_NFCDIV_SHIFT)
#define SIM_BRD_CLKDIV4_NFCDIV(base) (SIM_RD_CLKDIV4_NFCDIV(base))

/*! @brief Set the NFCDIV field to a new value. */
#define SIM_WR_CLKDIV4_NFCDIV(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_NFCDIV_MASK, SIM_CLKDIV4_NFCDIV(value)))
#define SIM_BWR_CLKDIV4_NFCDIV(base, value) (SIM_WR_CLKDIV4_NFCDIV(base, value))
/*@}*/

/*******************************************************************************
 * SIM_MCR - Misc Control Register
 ******************************************************************************/

/*!
 * @brief SIM_MCR - Misc Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MCR register
 */
/*@{*/
#define SIM_RD_MCR(base)         (SIM_MCR_REG(base))
#define SIM_WR_MCR(base, value)  (SIM_MCR_REG(base) = (value))
#define SIM_RMW_MCR(base, mask, value) (SIM_WR_MCR(base, (SIM_RD_MCR(base) & ~(mask)) | (value)))
#define SIM_SET_MCR(base, value) (SIM_WR_MCR(base, SIM_RD_MCR(base) |  (value)))
#define SIM_CLR_MCR(base, value) (SIM_WR_MCR(base, SIM_RD_MCR(base) & ~(value)))
#define SIM_TOG_MCR(base, value) (SIM_WR_MCR(base, SIM_RD_MCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MCR bitfields
 */

/*!
 * @name Register SIM_MCR, field DDRSREN[0] (RW)
 *
 * Values:
 * - 0 - DDR is not set to self refresh mode.
 * - 1 - DDR is set in self refresh mode. Check DDRS to make sure DDR is in self
 *     refresh mode.
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_DDRSREN field. */
#define SIM_RD_MCR_DDRSREN(base) ((SIM_MCR_REG(base) & SIM_MCR_DDRSREN_MASK) >> SIM_MCR_DDRSREN_SHIFT)
#define SIM_BRD_MCR_DDRSREN(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRSREN_SHIFT))

/*! @brief Set the DDRSREN field to a new value. */
#define SIM_WR_MCR_DDRSREN(base, value) (SIM_RMW_MCR(base, SIM_MCR_DDRSREN_MASK, SIM_MCR_DDRSREN(value)))
#define SIM_BWR_MCR_DDRSREN(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRSREN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field DDRS[1] (RO)
 *
 * Values:
 * - 0 - DDR is not set to self refresh mode.
 * - 1 - Sets DDR in self refresh mode.
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_DDRS field. */
#define SIM_RD_MCR_DDRS(base) ((SIM_MCR_REG(base) & SIM_MCR_DDRS_MASK) >> SIM_MCR_DDRS_SHIFT)
#define SIM_BRD_MCR_DDRS(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRS_SHIFT))
/*@}*/

/*!
 * @name Register SIM_MCR, field DDRPEN[2] (RW)
 *
 * Enable all DDR pads
 *
 * Values:
 * - 0 - All DDR I/O pins are disabled
 * - 1 - All DDR I/O pins are enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_DDRPEN field. */
#define SIM_RD_MCR_DDRPEN(base) ((SIM_MCR_REG(base) & SIM_MCR_DDRPEN_MASK) >> SIM_MCR_DDRPEN_SHIFT)
#define SIM_BRD_MCR_DDRPEN(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRPEN_SHIFT))

/*! @brief Set the DDRPEN field to a new value. */
#define SIM_WR_MCR_DDRPEN(base, value) (SIM_RMW_MCR(base, SIM_MCR_DDRPEN_MASK, SIM_MCR_DDRPEN(value)))
#define SIM_BWR_MCR_DDRPEN(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field DDRDQSDIS[3] (RW)
 *
 * Configure the DDR_DQS pins in a low power state. Set this bit when DDR is
 * disabled to conserve power (such as during low power mode entry).
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_DDRDQSDIS field. */
#define SIM_RD_MCR_DDRDQSDIS(base) ((SIM_MCR_REG(base) & SIM_MCR_DDRDQSDIS_MASK) >> SIM_MCR_DDRDQSDIS_SHIFT)
#define SIM_BRD_MCR_DDRDQSDIS(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRDQSDIS_SHIFT))

