pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the DDRDQSDIS field to a new value. */
#define SIM_WR_MCR_DDRDQSDIS(base, value) (SIM_RMW_MCR(base, SIM_MCR_DDRDQSDIS_MASK, SIM_MCR_DDRDQSDIS(value)))
#define SIM_BWR_MCR_DDRDQSDIS(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_DDRDQSDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field DDRCFG[7:5] (RW)
 *
 * Configure the DDR pads for interfacing to supported DDR memory types and
 * drive strength options
 *
 * Values:
 * - 000 - LPDDR Half Strength
 * - 001 - LPDDR Full Strength
 * - 010 - DDR2 Half Strength
 * - 011 - DDR1
 * - 100 - Reserved
 * - 101 - Reserved
 * - 110 - DDR2 Full Strength
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_DDRCFG field. */
#define SIM_RD_MCR_DDRCFG(base) ((SIM_MCR_REG(base) & SIM_MCR_DDRCFG_MASK) >> SIM_MCR_DDRCFG_SHIFT)
#define SIM_BRD_MCR_DDRCFG(base) (SIM_RD_MCR_DDRCFG(base))

/*! @brief Set the DDRCFG field to a new value. */
#define SIM_WR_MCR_DDRCFG(base, value) (SIM_RMW_MCR(base, SIM_MCR_DDRCFG_MASK, SIM_MCR_DDRCFG(value)))
#define SIM_BWR_MCR_DDRCFG(base, value) (SIM_WR_MCR_DDRCFG(base, value))
/*@}*/

/*!
 * @name Register SIM_MCR, field RCRRSTEN[8] (RW)
 *
 * Values:
 * - 0 - No soft reset to DDR RCR
 * - 1 - Soft reset to DDR RCR
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_RCRRSTEN field. */
#define SIM_RD_MCR_RCRRSTEN(base) ((SIM_MCR_REG(base) & SIM_MCR_RCRRSTEN_MASK) >> SIM_MCR_RCRRSTEN_SHIFT)
#define SIM_BRD_MCR_RCRRSTEN(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_RCRRSTEN_SHIFT))

/*! @brief Set the RCRRSTEN field to a new value. */
#define SIM_WR_MCR_RCRRSTEN(base, value) (SIM_RMW_MCR(base, SIM_MCR_RCRRSTEN_MASK, SIM_MCR_RCRRSTEN(value)))
#define SIM_BWR_MCR_RCRRSTEN(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_RCRRSTEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field RCRRST[9] (RO)
 *
 * Values:
 * - 0 - DDR RCR is not in reset status
 * - 1 - DDR RCR is in reset status
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_RCRRST field. */
#define SIM_RD_MCR_RCRRST(base) ((SIM_MCR_REG(base) & SIM_MCR_RCRRST_MASK) >> SIM_MCR_RCRRST_SHIFT)
#define SIM_BRD_MCR_RCRRST(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_RCRRST_SHIFT))
/*@}*/

/*!
 * @name Register SIM_MCR, field LCDSTART[16] (RW)
 *
 * The LCDC starts from beginning of the frame when this bit is set.
 *
 * Values:
 * - 0 - Stops LCDC display
 * - 1 - Starts LCDC display
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_LCDSTART field. */
#define SIM_RD_MCR_LCDSTART(base) ((SIM_MCR_REG(base) & SIM_MCR_LCDSTART_MASK) >> SIM_MCR_LCDSTART_SHIFT)
#define SIM_BRD_MCR_LCDSTART(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_LCDSTART_SHIFT))

/*! @brief Set the LCDSTART field to a new value. */
#define SIM_WR_MCR_LCDSTART(base, value) (SIM_RMW_MCR(base, SIM_MCR_LCDSTART_MASK, SIM_MCR_LCDSTART(value)))
#define SIM_BWR_MCR_LCDSTART(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_LCDSTART_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field PDBLOOP[29] (RW)
 *
 * Values:
 * - 0 - Provides two seperated minor loop, loop for ADC0/1 and loop for ADC2/3D
 * - 1 - Provides a loop to involve ADC0, ADC1, ADC2 and ADC3.
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_PDBLOOP field. */
#define SIM_RD_MCR_PDBLOOP(base) ((SIM_MCR_REG(base) & SIM_MCR_PDBLOOP_MASK) >> SIM_MCR_PDBLOOP_SHIFT)
#define SIM_BRD_MCR_PDBLOOP(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_PDBLOOP_SHIFT))

/*! @brief Set the PDBLOOP field to a new value. */
#define SIM_WR_MCR_PDBLOOP(base, value) (SIM_RMW_MCR(base, SIM_MCR_PDBLOOP_MASK, SIM_MCR_PDBLOOP(value)))
#define SIM_BWR_MCR_PDBLOOP(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_PDBLOOP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field ULPICLKOBE[30] (RW)
 *
 * Values:
 * - 0 - Internal generated 60MHz ULPI clock is not output to the ULPI_CLK pin.
 * - 1 - Interanl generated 60MHz ULPI clock provide clock for external ULPI phy.
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_ULPICLKOBE field. */
#define SIM_RD_MCR_ULPICLKOBE(base) ((SIM_MCR_REG(base) & SIM_MCR_ULPICLKOBE_MASK) >> SIM_MCR_ULPICLKOBE_SHIFT)
#define SIM_BRD_MCR_ULPICLKOBE(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_ULPICLKOBE_SHIFT))

/*! @brief Set the ULPICLKOBE field to a new value. */
#define SIM_WR_MCR_ULPICLKOBE(base, value) (SIM_RMW_MCR(base, SIM_MCR_ULPICLKOBE_MASK, SIM_MCR_ULPICLKOBE(value)))
#define SIM_BWR_MCR_ULPICLKOBE(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_ULPICLKOBE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MCR, field TRACECLKDIS[31] (RW)
 *
 * Values:
 * - 0 - Enables trace clock.
 * - 1 - Disable trace clock.
 */
/*@{*/
/*! @brief Read current value of the SIM_MCR_TRACECLKDIS field. */
#define SIM_RD_MCR_TRACECLKDIS(base) ((SIM_MCR_REG(base) & SIM_MCR_TRACECLKDIS_MASK) >> SIM_MCR_TRACECLKDIS_SHIFT)
#define SIM_BRD_MCR_TRACECLKDIS(base) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_TRACECLKDIS_SHIFT))

/*! @brief Set the TRACECLKDIS field to a new value. */
#define SIM_WR_MCR_TRACECLKDIS(base, value) (SIM_RMW_MCR(base, SIM_MCR_TRACECLKDIS_MASK, SIM_MCR_TRACECLKDIS(value)))
#define SIM_BWR_MCR_TRACECLKDIS(base, value) (BITBAND_ACCESS32(&SIM_MCR_REG(base), SIM_MCR_TRACECLKDIS_SHIFT) = (value))
/*@}*/

/*
 * MK70F12 SMC
 *
 * System Mode Controller
 *
 * Registers defined in this header file:
 * - SMC_PMPROT - Power Mode Protection Register
 * - SMC_PMCTRL - Power Mode Control Register
 * - SMC_VLLSCTRL - VLLS Control Register
 * - SMC_PMSTAT - Power Mode Status Register
 */

#define SMC_INSTANCE_COUNT (1U) /*!< Number of instances of the SMC module. */
#define SMC_IDX (0U) /*!< Instance number for SMC. */

/*******************************************************************************
 * SMC_PMPROT - Power Mode Protection Register
 ******************************************************************************/

/*!
 * @brief SMC_PMPROT - Power Mode Protection Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides protection for entry into any low power run or stop
 * mode. The actual enabling of the low power run or stop mode occurs by
 * configuring the power mode control register (PMCTRL). The PMPROT register can be written
 * only once after any system reset. If the MCU is configured for a disallowed
 * or reserved power mode, the MCU remains in its current power mode. For example,
 * if the MCU is in normal RUN mode and AVLP is 0, an attempt to enter VLPR mode
 * using PMCTRL[RUNM] is blocked and the RUNM bits remain 00b, indicating the
 * MCU is still in normal run mode. This register is reset on Chip Reset not VLLS
 * and by reset types that trigger Chip Reset not VLLS. It is unaffected by reset
 * types that do not trigger Chip Reset not VLLS. See the Reset section details
 * for more information.
 */
/*!
 * @name Constants and macros for entire SMC_PMPROT register
 */
/*@{*/
#define SMC_RD_PMPROT(base)      (SMC_PMPROT_REG(base))
#define SMC_WR_PMPROT(base, value) (SMC_PMPROT_REG(base) = (value))
#define SMC_RMW_PMPROT(base, mask, value) (SMC_WR_PMPROT(base, (SMC_RD_PMPROT(base) & ~(mask)) | (value)))
#define SMC_SET_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) |  (value)))
#define SMC_CLR_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) & ~(value)))
#define SMC_TOG_PMPROT(base, value) (SMC_WR_PMPROT(base, SMC_RD_PMPROT(base) ^  (value)))
/*@}*/

