pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * SMC_VLLSCTRL - VLLS Control Register
 ******************************************************************************/

/*!
 * @brief SMC_VLLSCTRL - VLLS Control Register (RW)
 *
 * Reset value: 0x03U
 *
 * The VLLSCTRL register selects which VLLSx mode is entered if STOPM=VLLS and
 * controls power to FlexRAM during VLLS2. This register is reset on Chip POR not
 * VLLS and by reset types that trigger Chip POR not VLLS. It is unaffected by
 * reset types that do not trigger Chip POR not VLLS. See the Reset section
 * details. for more information.
 */
/*!
 * @name Constants and macros for entire SMC_VLLSCTRL register
 */
/*@{*/
#define SMC_RD_VLLSCTRL(base)    (SMC_VLLSCTRL_REG(base))
#define SMC_WR_VLLSCTRL(base, value) (SMC_VLLSCTRL_REG(base) = (value))
#define SMC_RMW_VLLSCTRL(base, mask, value) (SMC_WR_VLLSCTRL(base, (SMC_RD_VLLSCTRL(base) & ~(mask)) | (value)))
#define SMC_SET_VLLSCTRL(base, value) (SMC_WR_VLLSCTRL(base, SMC_RD_VLLSCTRL(base) |  (value)))
#define SMC_CLR_VLLSCTRL(base, value) (SMC_WR_VLLSCTRL(base, SMC_RD_VLLSCTRL(base) & ~(value)))
#define SMC_TOG_VLLSCTRL(base, value) (SMC_WR_VLLSCTRL(base, SMC_RD_VLLSCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SMC_VLLSCTRL bitfields
 */

/*!
 * @name Register SMC_VLLSCTRL, field VLLSM[2:0] (RW)
 *
 * This field controls which VLLS sub-mode to enter if STOPM=VLLS.
 *
 * Values:
 * - 000 - Reserved
 * - 001 - VLLS1
 * - 010 - VLLS2
 * - 011 - VLLS3
 * - 100 - Reserved
 * - 101 - Reserved
 * - 110 - Reserved
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SMC_VLLSCTRL_VLLSM field. */
#define SMC_RD_VLLSCTRL_VLLSM(base) ((SMC_VLLSCTRL_REG(base) & SMC_VLLSCTRL_VLLSM_MASK) >> SMC_VLLSCTRL_VLLSM_SHIFT)
#define SMC_BRD_VLLSCTRL_VLLSM(base) (SMC_RD_VLLSCTRL_VLLSM(base))

/*! @brief Set the VLLSM field to a new value. */
#define SMC_WR_VLLSCTRL_VLLSM(base, value) (SMC_RMW_VLLSCTRL(base, SMC_VLLSCTRL_VLLSM_MASK, SMC_VLLSCTRL_VLLSM(value)))
#define SMC_BWR_VLLSCTRL_VLLSM(base, value) (SMC_WR_VLLSCTRL_VLLSM(base, value))
/*@}*/

/*******************************************************************************
 * SMC_PMSTAT - Power Mode Status Register
 ******************************************************************************/

/*!
 * @brief SMC_PMSTAT - Power Mode Status Register (RO)
 *
 * Reset value: 0x01U
 *
 * PMSTAT is a read-only, one-hot register which indicates the current power
 * mode of the system. This register is reset on Chip POR not VLLS and by reset
 * types that trigger Chip POR not VLLS. It is unaffected by reset types that do not
 * trigger Chip POR not VLLS. See the Reset section details. for more information.
 */
/*!
 * @name Constants and macros for entire SMC_PMSTAT register
 */
/*@{*/
#define SMC_RD_PMSTAT(base)      (SMC_PMSTAT_REG(base))
/*@}*/

/*
 * Constants & macros for individual SMC_PMSTAT bitfields
 */

/*!
 * @name Register SMC_PMSTAT, field PMSTAT[6:0] (RO)
 *
 * When debug is enabled, the PMSTAT will not update to STOP or VLPS
 */
/*@{*/
/*! @brief Read current value of the SMC_PMSTAT_PMSTAT field. */
#define SMC_RD_PMSTAT_PMSTAT(base) ((SMC_PMSTAT_REG(base) & SMC_PMSTAT_PMSTAT_MASK) >> SMC_PMSTAT_PMSTAT_SHIFT)
#define SMC_BRD_PMSTAT_PMSTAT(base) (SMC_RD_PMSTAT_PMSTAT(base))
/*@}*/

/*
 * MK70F12 SPI
 *
 * Deserial Serial Peripheral Interface
 *
 * Registers defined in this header file:
 * - SPI_MCR - DSPI Module Configuration Register
 * - SPI_TCR - DSPI Transfer Count Register
 * - SPI_CTAR - DSPI Clock and Transfer Attributes Register (In Master Mode)
 * - SPI_CTAR_SLAVE - DSPI Clock and Transfer Attributes Register (In Slave Mode)
 * - SPI_SR - DSPI Status Register
 * - SPI_RSER - DSPI DMA/Interrupt Request Select and Enable Register
 * - SPI_PUSHR - DSPI PUSH TX FIFO Register In Master Mode
 * - SPI_PUSHR_SLAVE - DSPI PUSH TX FIFO Register In Slave Mode
 * - SPI_POPR - DSPI POP RX FIFO Register
 * - SPI_TXFR0 - DSPI Transmit FIFO Registers
 * - SPI_TXFR1 - DSPI Transmit FIFO Registers
 * - SPI_TXFR2 - DSPI Transmit FIFO Registers
 * - SPI_TXFR3 - DSPI Transmit FIFO Registers
 * - SPI_RXFR0 - DSPI Receive FIFO Registers
 * - SPI_RXFR1 - DSPI Receive FIFO Registers
 * - SPI_RXFR2 - DSPI Receive FIFO Registers
 * - SPI_RXFR3 - DSPI Receive FIFO Registers
 */

#define SPI_INSTANCE_COUNT (3U) /*!< Number of instances of the SPI module. */
#define SPI0_IDX (0U) /*!< Instance number for SPI0. */
#define SPI1_IDX (1U) /*!< Instance number for SPI1. */
#define SPI2_IDX (2U) /*!< Instance number for SPI2. */

/*******************************************************************************
 * SPI_MCR - DSPI Module Configuration Register
 ******************************************************************************/

/*!
 * @brief SPI_MCR - DSPI Module Configuration Register (RW)
 *
 * Reset value: 0x00004001U
 *
 * Contains bits to configure various attributes associated with DSPI
 * operations. The HALT and MDIS bits can be changed at any time, but they only take effect
 * on the next frame boundary. Only the HALT and MDIS bits in the MCR can be
 * changed, while the DSPI is in the Running state.
 */
/*!
 * @name Constants and macros for entire SPI_MCR register
 */
/*@{*/
#define SPI_RD_MCR(base)         (SPI_MCR_REG(base))
#define SPI_WR_MCR(base, value)  (SPI_MCR_REG(base) = (value))
#define SPI_RMW_MCR(base, mask, value) (SPI_WR_MCR(base, (SPI_RD_MCR(base) & ~(mask)) | (value)))
#define SPI_SET_MCR(base, value) (SPI_WR_MCR(base, SPI_RD_MCR(base) |  (value)))
#define SPI_CLR_MCR(base, value) (SPI_WR_MCR(base, SPI_RD_MCR(base) & ~(value)))
#define SPI_TOG_MCR(base, value) (SPI_WR_MCR(base, SPI_RD_MCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SPI_MCR bitfields
 */

/*!
 * @name Register SPI_MCR, field HALT[0] (RW)
 *
 * Starts and stops DSPI transfers.
 *
 * Values:
 * - 0 - Start transfers.
 * - 1 - Stop transfers.
 */
/*@{*/
/*! @brief Read current value of the SPI_MCR_HALT field. */
#define SPI_RD_MCR_HALT(base) ((SPI_MCR_REG(base) & SPI_MCR_HALT_MASK) >> SPI_MCR_HALT_SHIFT)
#define SPI_BRD_MCR_HALT(base) (BITBAND_ACCESS32(&SPI_MCR_REG(base), SPI_MCR_HALT_SHIFT))

/*! @brief Set the HALT field to a new value. */
#define SPI_WR_MCR_HALT(base, value) (SPI_RMW_MCR(base, SPI_MCR_HALT_MASK, SPI_MCR_HALT(value)))
#define SPI_BWR_MCR_HALT(base, value) (BITBAND_ACCESS32(&SPI_MCR_REG(base), SPI_MCR_HALT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SPI_MCR, field SMPL_PT[9:8] (RW)
 *
 * Controls when the DSPI master samples SIN in Modified Transfer Format. This
 * field is valid only when CPHA bit in CTAR register is 0.
 *
 * Values:
 * - 00 - 0 system clocks between SCK edge and SIN sample
 * - 01 - 1 system clock between SCK edge and SIN sample
 * - 10 - 2 system clocks between SCK edge and SIN sample
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SPI_MCR_SMPL_PT field. */
#define SPI_RD_MCR_SMPL_PT(base) ((SPI_MCR_REG(base) & SPI_MCR_SMPL_PT_MASK) >> SPI_MCR_SMPL_PT_SHIFT)
#define SPI_BRD_MCR_SMPL_PT(base) (SPI_RD_MCR_SMPL_PT(base))

