pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual TSI_GENCS bitfields
 */

/*!
 * @name Register TSI_GENCS, field STPE[0] (RW)
 *
 * TSI STOP Enable while in Low Power Modes (STOP, VLPS, LLS and VLLS{3,2,1})
 *
 * Values:
 * - 0 - Disable TSI when MCU goes into low power modes.
 * - 1 - Allows TSI to continue running in all low power modes.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_STPE field. */
#define TSI_RD_GENCS_STPE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_STPE_MASK) >> TSI_GENCS_STPE_SHIFT)
#define TSI_BRD_GENCS_STPE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STPE_SHIFT))

/*! @brief Set the STPE field to a new value. */
#define TSI_WR_GENCS_STPE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_STPE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_STPE(value)))
#define TSI_BWR_GENCS_STPE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STPE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field STM[1] (RW)
 *
 * Values:
 * - 0 - Software trigger scan.
 * - 1 - Periodical Scan.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_STM field. */
#define TSI_RD_GENCS_STM(base) ((TSI_GENCS_REG(base) & TSI_GENCS_STM_MASK) >> TSI_GENCS_STM_SHIFT)
#define TSI_BRD_GENCS_STM(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STM_SHIFT))

/*! @brief Set the STM field to a new value. */
#define TSI_WR_GENCS_STM(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_STM_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_STM(value)))
#define TSI_BWR_GENCS_STM(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_STM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ESOR[4] (RW)
 *
 * Values:
 * - 0 - Out-of-Range interrupt is allowed.
 * - 1 - End-of-Scan interrupt is allowed.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_ESOR field. */
#define TSI_RD_GENCS_ESOR(base) ((TSI_GENCS_REG(base) & TSI_GENCS_ESOR_MASK) >> TSI_GENCS_ESOR_SHIFT)
#define TSI_BRD_GENCS_ESOR(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ESOR_SHIFT))

/*! @brief Set the ESOR field to a new value. */
#define TSI_WR_GENCS_ESOR(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_ESOR_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_ESOR(value)))
#define TSI_BWR_GENCS_ESOR(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ESOR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field ERIE[5] (RW)
 *
 * Caused either by a Short or Overrun Error.
 *
 * Values:
 * - 0 - Interrupt disabled for error.
 * - 1 - Interrupt enabled for error.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_ERIE field. */
#define TSI_RD_GENCS_ERIE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_ERIE_MASK) >> TSI_GENCS_ERIE_SHIFT)
#define TSI_BRD_GENCS_ERIE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ERIE_SHIFT))

/*! @brief Set the ERIE field to a new value. */
#define TSI_WR_GENCS_ERIE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_ERIE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_ERIE(value)))
#define TSI_BWR_GENCS_ERIE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_ERIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIIE[6] (RW)
 *
 * Values:
 * - 0 - Interrupt from TSI is disabled
 * - 1 - Interrupt from TSI is enabled
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_TSIIE field. */
#define TSI_RD_GENCS_TSIIE(base) ((TSI_GENCS_REG(base) & TSI_GENCS_TSIIE_MASK) >> TSI_GENCS_TSIIE_SHIFT)
#define TSI_BRD_GENCS_TSIIE(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIIE_SHIFT))

/*! @brief Set the TSIIE field to a new value. */
#define TSI_WR_GENCS_TSIIE(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_TSIIE_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_TSIIE(value)))
#define TSI_BWR_GENCS_TSIIE(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIIE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field TSIEN[7] (RW)
 *
 * Values:
 * - 0 - TSI module is disabled
 * - 1 - TSI module is enabled
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_TSIEN field. */
#define TSI_RD_GENCS_TSIEN(base) ((TSI_GENCS_REG(base) & TSI_GENCS_TSIEN_MASK) >> TSI_GENCS_TSIEN_SHIFT)
#define TSI_BRD_GENCS_TSIEN(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIEN_SHIFT))

/*! @brief Set the TSIEN field to a new value. */
#define TSI_WR_GENCS_TSIEN(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_TSIEN_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_TSIEN(value)))
#define TSI_BWR_GENCS_TSIEN(base, value) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_TSIEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SWTS[8] (WO)
 *
 * Write a "1" to this bit will start a scan sequence and write a "0" to this
 * bit has no effect.
 */
/*@{*/
/*! @brief Set the SWTS field to a new value. */
#define TSI_WR_GENCS_SWTS(base, value) (TSI_RMW_GENCS(base, (TSI_GENCS_SWTS_MASK | TSI_GENCS_OVRF_MASK | TSI_GENCS_EXTERF_MASK | TSI_GENCS_OUTRGF_MASK | TSI_GENCS_EOSF_MASK), TSI_GENCS_SWTS(value)))
#define TSI_BWR_GENCS_SWTS(base, value) (TSI_WR_GENCS_SWTS(base, value))
/*@}*/

/*!
 * @name Register TSI_GENCS, field SCNIP[9] (RO)
 *
 * "1" indicates a scanning process is in progress,this bit is read-only and
 * changes automatically by the TSI model.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_SCNIP field. */
#define TSI_RD_GENCS_SCNIP(base) ((TSI_GENCS_REG(base) & TSI_GENCS_SCNIP_MASK) >> TSI_GENCS_SCNIP_SHIFT)
#define TSI_BRD_GENCS_SCNIP(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_SCNIP_SHIFT))
/*@}*/

/*!
 * @name Register TSI_GENCS, field OVRF[12] (W1C)
 *
 * Values:
 * - 0 - No over run.
 * - 1 - Over Run occurred.
 */
/*@{*/
/*! @brief Read current value of the TSI_GENCS_OVRF field. */
#define TSI_RD_GENCS_OVRF(base) ((TSI_GENCS_REG(base) & TSI_GENCS_OVRF_MASK) >> TSI_GENCS_OVRF_SHIFT)
#define TSI_BRD_GENCS_OVRF(base) (BITBAND_ACCESS32(&TSI_GENCS_REG(base), TSI_GENCS_OVRF_SHIFT))

