pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * TSI_SCANC - SCAN Control Register
 ******************************************************************************/

/*!
 * @brief TSI_SCANC - SCAN Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_SCANC register
 */
/*@{*/
#define TSI_RD_SCANC(base)       (TSI_SCANC_REG(base))
#define TSI_WR_SCANC(base, value) (TSI_SCANC_REG(base) = (value))
#define TSI_RMW_SCANC(base, mask, value) (TSI_WR_SCANC(base, (TSI_RD_SCANC(base) & ~(mask)) | (value)))
#define TSI_SET_SCANC(base, value) (TSI_WR_SCANC(base, TSI_RD_SCANC(base) |  (value)))
#define TSI_CLR_SCANC(base, value) (TSI_WR_SCANC(base, TSI_RD_SCANC(base) & ~(value)))
#define TSI_TOG_SCANC(base, value) (TSI_WR_SCANC(base, TSI_RD_SCANC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual TSI_SCANC bitfields
 */

/*!
 * @name Register TSI_SCANC, field AMPSC[2:0] (RW)
 *
 * Values:
 * - 000 - Input Clock Source divided by 1.
 * - 001 - Input Clock Source divided by 2.
 * - 010 - Input Clock Source divided by 4.
 * - 011 - Input Clock Source divided by 8.
 * - 100 - Input Clock Source divided by 16.
 * - 101 - Input Clock Source divided by 32.
 * - 110 - Input Clock Source divided by 64.
 * - 111 - Input Clock Source divided by 128.
 */
/*@{*/
/*! @brief Read current value of the TSI_SCANC_AMPSC field. */
#define TSI_RD_SCANC_AMPSC(base) ((TSI_SCANC_REG(base) & TSI_SCANC_AMPSC_MASK) >> TSI_SCANC_AMPSC_SHIFT)
#define TSI_BRD_SCANC_AMPSC(base) (TSI_RD_SCANC_AMPSC(base))

/*! @brief Set the AMPSC field to a new value. */
#define TSI_WR_SCANC_AMPSC(base, value) (TSI_RMW_SCANC(base, TSI_SCANC_AMPSC_MASK, TSI_SCANC_AMPSC(value)))
#define TSI_BWR_SCANC_AMPSC(base, value) (TSI_WR_SCANC_AMPSC(base, value))
/*@}*/

/*!
 * @name Register TSI_SCANC, field AMCLKS[4:3] (RW)
 *
 * Values:
 * - 00 - LPOSCCLK
 * - 01 - MCGIRCLK.
 * - 10 - OSC0ERCLK.
 * - 11 - Not valid.
 */
/*@{*/
/*! @brief Read current value of the TSI_SCANC_AMCLKS field. */
#define TSI_RD_SCANC_AMCLKS(base) ((TSI_SCANC_REG(base) & TSI_SCANC_AMCLKS_MASK) >> TSI_SCANC_AMCLKS_SHIFT)
#define TSI_BRD_SCANC_AMCLKS(base) (TSI_RD_SCANC_AMCLKS(base))

/*! @brief Set the AMCLKS field to a new value. */
#define TSI_WR_SCANC_AMCLKS(base, value) (TSI_RMW_SCANC(base, TSI_SCANC_AMCLKS_MASK, TSI_SCANC_AMCLKS(value)))
#define TSI_BWR_SCANC_AMCLKS(base, value) (TSI_WR_SCANC_AMCLKS(base, value))
/*@}*/

/*!
 * @name Register TSI_SCANC, field SMOD[15:8] (RW)
 *
 * Values:
 * - 00000000 - Continue Scan.
 */
/*@{*/
/*! @brief Read current value of the TSI_SCANC_SMOD field. */
#define TSI_RD_SCANC_SMOD(base) ((TSI_SCANC_REG(base) & TSI_SCANC_SMOD_MASK) >> TSI_SCANC_SMOD_SHIFT)
#define TSI_BRD_SCANC_SMOD(base) (TSI_RD_SCANC_SMOD(base))

/*! @brief Set the SMOD field to a new value. */
#define TSI_WR_SCANC_SMOD(base, value) (TSI_RMW_SCANC(base, TSI_SCANC_SMOD_MASK, TSI_SCANC_SMOD(value)))
#define TSI_BWR_SCANC_SMOD(base, value) (TSI_WR_SCANC_SMOD(base, value))
/*@}*/

/*!
 * @name Register TSI_SCANC, field EXTCHRG[19:16] (RW)
 *
 * Values:
 * - 0000 - 2 uA charge current.
 * - 0001 - 4 uA charge current.
 * - 0010 - 6 uA charge current.
 * - 0011 - 8 uA charge current.
 * - 0100 - 10 uA charge current.
 * - 0101 - 12 uA charge current.
 * - 0110 - 14 uA charge current.
 * - 0111 - 16 uA charge current.
 * - 1000 - 18 uA charge current.
 * - 1001 - 20 uA charge current.
 * - 1010 - 22 uA charge current.
 * - 1011 - 24 uA charge current.
 * - 1100 - 26 uA charge current.
 * - 1101 - 28 uA charge current.
 * - 1110 - 30 uA charge current.
 * - 1111 - 32 uA charge current.
 */
/*@{*/
/*! @brief Read current value of the TSI_SCANC_EXTCHRG field. */
#define TSI_RD_SCANC_EXTCHRG(base) ((TSI_SCANC_REG(base) & TSI_SCANC_EXTCHRG_MASK) >> TSI_SCANC_EXTCHRG_SHIFT)
#define TSI_BRD_SCANC_EXTCHRG(base) (TSI_RD_SCANC_EXTCHRG(base))

/*! @brief Set the EXTCHRG field to a new value. */
#define TSI_WR_SCANC_EXTCHRG(base, value) (TSI_RMW_SCANC(base, TSI_SCANC_EXTCHRG_MASK, TSI_SCANC_EXTCHRG(value)))
#define TSI_BWR_SCANC_EXTCHRG(base, value) (TSI_WR_SCANC_EXTCHRG(base, value))
/*@}*/

/*!
 * @name Register TSI_SCANC, field REFCHRG[27:24] (RW)
 *
 * Values:
 * - 0000 - 2 uA charge current.
 * - 0001 - 4 uA charge current.
 * - 0010 - 6 uA charge current.
 * - 0011 - 8 uA charge current.
 * - 0100 - 10 uA charge current.
 * - 0101 - 12 uA charge current.
 * - 0110 - 14 uA charge current.
 * - 0111 - 16 uA charge current.
 * - 1000 - 18 uA charge current.
 * - 1001 - 20 uA charge current.
 * - 1010 - 22 uA charge current.
 * - 1011 - 24 uA charge current.
 * - 1100 - 26 uA charge current.
 * - 1101 - 28 uA charge current.
 * - 1110 - 30 uA charge current.
 * - 1111 - 32 uA charge current.
 */
/*@{*/
/*! @brief Read current value of the TSI_SCANC_REFCHRG field. */
#define TSI_RD_SCANC_REFCHRG(base) ((TSI_SCANC_REG(base) & TSI_SCANC_REFCHRG_MASK) >> TSI_SCANC_REFCHRG_SHIFT)
#define TSI_BRD_SCANC_REFCHRG(base) (TSI_RD_SCANC_REFCHRG(base))

/*! @brief Set the REFCHRG field to a new value. */
#define TSI_WR_SCANC_REFCHRG(base, value) (TSI_RMW_SCANC(base, TSI_SCANC_REFCHRG_MASK, TSI_SCANC_REFCHRG(value)))
#define TSI_BWR_SCANC_REFCHRG(base, value) (TSI_WR_SCANC_REFCHRG(base, value))
/*@}*/

/*******************************************************************************
 * TSI_PEN - Pin Enable Register
 ******************************************************************************/

/*!
 * @brief TSI_PEN - Pin Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Do not change the settings when TSIEN is 1.
 */
/*!
 * @name Constants and macros for entire TSI_PEN register
 */
/*@{*/
#define TSI_RD_PEN(base)         (TSI_PEN_REG(base))
#define TSI_WR_PEN(base, value)  (TSI_PEN_REG(base) = (value))
#define TSI_RMW_PEN(base, mask, value) (TSI_WR_PEN(base, (TSI_RD_PEN(base) & ~(mask)) | (value)))
#define TSI_SET_PEN(base, value) (TSI_WR_PEN(base, TSI_RD_PEN(base) |  (value)))
#define TSI_CLR_PEN(base, value) (TSI_WR_PEN(base, TSI_RD_PEN(base) & ~(value)))
#define TSI_TOG_PEN(base, value) (TSI_WR_PEN(base, TSI_RD_PEN(base) ^  (value)))
/*@}*/

