pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * UART_CPW - UART CEA709.1-B Collision Pulse Width
 ******************************************************************************/

/*!
 * @brief UART_CPW - UART CEA709.1-B Collision Pulse Width (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_CPW register
 */
/*@{*/
#define UART_RD_CPW(base)        (UART_CPW_REG(base))
#define UART_WR_CPW(base, value) (UART_CPW_REG(base) = (value))
#define UART_RMW_CPW(base, mask, value) (UART_WR_CPW(base, (UART_RD_CPW(base) & ~(mask)) | (value)))
#define UART_SET_CPW(base, value) (UART_WR_CPW(base, UART_RD_CPW(base) |  (value)))
#define UART_CLR_CPW(base, value) (UART_WR_CPW(base, UART_RD_CPW(base) & ~(value)))
#define UART_TOG_CPW(base, value) (UART_WR_CPW(base, UART_RD_CPW(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_RIDT - UART CEA709.1-B Receive Indeterminate Time
 ******************************************************************************/

/*!
 * @brief UART_RIDT - UART CEA709.1-B Receive Indeterminate Time (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RIDT register
 */
/*@{*/
#define UART_RD_RIDT(base)       (UART_RIDT_REG(base))
#define UART_WR_RIDT(base, value) (UART_RIDT_REG(base) = (value))
#define UART_RMW_RIDT(base, mask, value) (UART_WR_RIDT(base, (UART_RD_RIDT(base) & ~(mask)) | (value)))
#define UART_SET_RIDT(base, value) (UART_WR_RIDT(base, UART_RD_RIDT(base) |  (value)))
#define UART_CLR_RIDT(base, value) (UART_WR_RIDT(base, UART_RD_RIDT(base) & ~(value)))
#define UART_TOG_RIDT(base, value) (UART_WR_RIDT(base, UART_RD_RIDT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time
 ******************************************************************************/

/*!
 * @brief UART_TIDT - UART CEA709.1-B Transmit Indeterminate Time (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TIDT register
 */
/*@{*/
#define UART_RD_TIDT(base)       (UART_TIDT_REG(base))
#define UART_WR_TIDT(base, value) (UART_TIDT_REG(base) = (value))
#define UART_RMW_TIDT(base, mask, value) (UART_WR_TIDT(base, (UART_RD_TIDT(base) & ~(mask)) | (value)))
#define UART_SET_TIDT(base, value) (UART_WR_TIDT(base, UART_RD_TIDT(base) |  (value)))
#define UART_CLR_TIDT(base, value) (UART_WR_TIDT(base, UART_RD_TIDT(base) & ~(value)))
#define UART_TOG_TIDT(base, value) (UART_WR_TIDT(base, UART_RD_TIDT(base) ^  (value)))
/*@}*/

/*
 * MK70F12 USB
 *
 * Universal Serial Bus, OTG Capable Controller
 *
 * Registers defined in this header file:
 * - USB_PERID - Peripheral ID Register
 * - USB_IDCOMP - Peripheral ID Complement Register
 * - USB_REV - Peripheral Revision Register
 * - USB_ADDINFO - Peripheral Additional Info Register
 * - USB_OTGISTAT - OTG Interrupt Status Register
 * - USB_OTGICR - OTG Interrupt Control Register
 * - USB_OTGSTAT - OTG Status Register
 * - USB_OTGCTL - OTG Control Register
 * - USB_ISTAT - Interrupt Status Register
 * - USB_INTEN - Interrupt Enable Register
 * - USB_ERRSTAT - Error Interrupt Status Register
 * - USB_ERREN - Error Interrupt Enable Register
 * - USB_STAT - Status Register
 * - USB_CTL - Control Register
 * - USB_ADDR - Address Register
 * - USB_BDTPAGE1 - BDT Page Register 1
 * - USB_FRMNUML - Frame Number Register Low
 * - USB_FRMNUMH - Frame Number Register High
 * - USB_TOKEN - Token Register
 * - USB_SOFTHLD - SOF Threshold Register
 * - USB_BDTPAGE2 - BDT Page Register 2
 * - USB_BDTPAGE3 - BDT Page Register 3
 * - USB_ENDPT - Endpoint Control Register
 * - USB_USBCTRL - USB Control Register
 * - USB_OBSERVE - USB OTG Observe Register
 * - USB_CONTROL - USB OTG Control Register
 * - USB_USBTRC0 - USB Transceiver Control Register 0
 * - USB_USBFRMADJUST - Frame Adjust Register
 */

#define USB_INSTANCE_COUNT (1U) /*!< Number of instances of the USB module. */
#define USB0_IDX (0U) /*!< Instance number for USB0. */

/*******************************************************************************
 * USB_PERID - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief USB_PERID - Peripheral ID Register (RO)
 *
 * Reset value: 0x04U
 *
 * The Peripheral ID Register reads back the value of 0x04. This value is
 * defined for the USB Peripheral.
 */
/*!
 * @name Constants and macros for entire USB_PERID register
 */
/*@{*/
#define USB_RD_PERID(base)       (USB_PERID_REG(base))
/*@}*/

/*
 * Constants & macros for individual USB_PERID bitfields
 */

/*!
 * @name Register USB_PERID, field ID[5:0] (RO)
 *
 * These bits always read 0x04 (00_0100)
 */
/*@{*/
/*! @brief Read current value of the USB_PERID_ID field. */
#define USB_RD_PERID_ID(base) ((USB_PERID_REG(base) & USB_PERID_ID_MASK) >> USB_PERID_ID_SHIFT)
#define USB_BRD_PERID_ID(base) (USB_RD_PERID_ID(base))
/*@}*/

/*******************************************************************************
 * USB_IDCOMP - Peripheral ID Complement Register
 ******************************************************************************/

/*!
 * @brief USB_IDCOMP - Peripheral ID Complement Register (RO)
 *
 * Reset value: 0xFBU
 *
 * The Peripheral ID Complement Register reads back the complement of the
 * Peripheral ID Register. For the USB Peripheral, this is the value 0xFB.
 */
/*!
 * @name Constants and macros for entire USB_IDCOMP register
 */
/*@{*/
#define USB_RD_IDCOMP(base)      (USB_IDCOMP_REG(base))
/*@}*/

/*
 * Constants & macros for individual USB_IDCOMP bitfields
 */

/*!
 * @name Register USB_IDCOMP, field NID[5:0] (RO)
 *
 * Ones complement of peripheral identification bits.
 */
/*@{*/
/*! @brief Read current value of the USB_IDCOMP_NID field. */
#define USB_RD_IDCOMP_NID(base) ((USB_IDCOMP_REG(base) & USB_IDCOMP_NID_MASK) >> USB_IDCOMP_NID_SHIFT)
#define USB_BRD_IDCOMP_NID(base) (USB_RD_IDCOMP_NID(base))
/*@}*/

