pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBDCD_TIMER1 -
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER1 -  (RW)
 *
 * Reset value: 0x000A0028U
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER1 register
 */
/*@{*/
#define USBDCD_RD_TIMER1(base)   (USBDCD_TIMER1_REG(base))
#define USBDCD_WR_TIMER1(base, value) (USBDCD_TIMER1_REG(base) = (value))
#define USBDCD_RMW_TIMER1(base, mask, value) (USBDCD_WR_TIMER1(base, (USBDCD_RD_TIMER1(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) |  (value)))
#define USBDCD_CLR_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) & ~(value)))
#define USBDCD_TOG_TIMER1(base, value) (USBDCD_WR_TIMER1(base, USBDCD_RD_TIMER1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER1 bitfields
 */

/*!
 * @name Register USBDCD_TIMER1, field TVDPSRC_ON[9:0] (RW)
 *
 * Sets the amount of time (in ms) that VDP_SRC, IDM_SINK, and the D-/VDAT_REF
 * comparator are enabled and connected to the D+/D- lines during the charging
 * port detection phase of the sequence. Valid values are 1-1023, but the USB
 * Battery Charging Specification requires a minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER1_TVDPSRC_ON field. */
#define USBDCD_RD_TIMER1_TVDPSRC_ON(base) ((USBDCD_TIMER1_REG(base) & USBDCD_TIMER1_TVDPSRC_ON_MASK) >> USBDCD_TIMER1_TVDPSRC_ON_SHIFT)
#define USBDCD_BRD_TIMER1_TVDPSRC_ON(base) (USBDCD_RD_TIMER1_TVDPSRC_ON(base))

/*! @brief Set the TVDPSRC_ON field to a new value. */
#define USBDCD_WR_TIMER1_TVDPSRC_ON(base, value) (USBDCD_RMW_TIMER1(base, USBDCD_TIMER1_TVDPSRC_ON_MASK, USBDCD_TIMER1_TVDPSRC_ON(value)))
#define USBDCD_BWR_TIMER1_TVDPSRC_ON(base, value) (USBDCD_WR_TIMER1_TVDPSRC_ON(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER1, field TDCD_DBNC[25:16] (RW)
 *
 * Sets the amount of time (in ms) to debounce the D+ signal during the data pin
 * contact detection phase (while IDP_SRC and RDM_DWN are enabled). Valid values
 * are 1-1023, but the USB Battery Charging Specification requires a minimum
 * value of 10 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER1_TDCD_DBNC field. */
#define USBDCD_RD_TIMER1_TDCD_DBNC(base) ((USBDCD_TIMER1_REG(base) & USBDCD_TIMER1_TDCD_DBNC_MASK) >> USBDCD_TIMER1_TDCD_DBNC_SHIFT)
#define USBDCD_BRD_TIMER1_TDCD_DBNC(base) (USBDCD_RD_TIMER1_TDCD_DBNC(base))

/*! @brief Set the TDCD_DBNC field to a new value. */
#define USBDCD_WR_TIMER1_TDCD_DBNC(base, value) (USBDCD_RMW_TIMER1(base, USBDCD_TIMER1_TDCD_DBNC_MASK, USBDCD_TIMER1_TDCD_DBNC(value)))
#define USBDCD_BWR_TIMER1_TDCD_DBNC(base, value) (USBDCD_WR_TIMER1_TDCD_DBNC(base, value))
/*@}*/

/*******************************************************************************
 * USBDCD_TIMER2 -
 ******************************************************************************/

/*!
 * @brief USBDCD_TIMER2 -  (RW)
 *
 * Reset value: 0x00280001U
 *
 * TIMER2 contains timing parameters. Note that register values can be written
 * that are not compliant with the USB Battery Charging Specification v1.1, so
 * care should be taken when overwriting the default values.
 */
/*!
 * @name Constants and macros for entire USBDCD_TIMER2 register
 */
/*@{*/
#define USBDCD_RD_TIMER2(base)   (USBDCD_TIMER2_REG(base))
#define USBDCD_WR_TIMER2(base, value) (USBDCD_TIMER2_REG(base) = (value))
#define USBDCD_RMW_TIMER2(base, mask, value) (USBDCD_WR_TIMER2(base, (USBDCD_RD_TIMER2(base) & ~(mask)) | (value)))
#define USBDCD_SET_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) |  (value)))
#define USBDCD_CLR_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) & ~(value)))
#define USBDCD_TOG_TIMER2(base, value) (USBDCD_WR_TIMER2(base, USBDCD_RD_TIMER2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBDCD_TIMER2 bitfields
 */

/*!
 * @name Register USBDCD_TIMER2, field CHECK_DM[3:0] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after the device
 * connects to the USB bus (software enables the D+ pullup) until checking the state of
 * the D- line to determine the type of charging port. Valid values are 1-15ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_CHECK_DM field. */
#define USBDCD_RD_TIMER2_CHECK_DM(base) ((USBDCD_TIMER2_REG(base) & USBDCD_TIMER2_CHECK_DM_MASK) >> USBDCD_TIMER2_CHECK_DM_SHIFT)
#define USBDCD_BRD_TIMER2_CHECK_DM(base) (USBDCD_RD_TIMER2_CHECK_DM(base))

/*! @brief Set the CHECK_DM field to a new value. */
#define USBDCD_WR_TIMER2_CHECK_DM(base, value) (USBDCD_RMW_TIMER2(base, USBDCD_TIMER2_CHECK_DM_MASK, USBDCD_TIMER2_CHECK_DM(value)))
#define USBDCD_BWR_TIMER2_CHECK_DM(base, value) (USBDCD_WR_TIMER2_CHECK_DM(base, value))
/*@}*/

/*!
 * @name Register USBDCD_TIMER2, field TVDPSRC_CON[25:16] (RW)
 *
 * Sets the amount of time (in ms) that the module waits after charging port
 * detection before system software should enable the D+ pullup to connect to the
 * USB host. Valid values are 1-1023, but the USB Battery Charging Specification
 * requires a minimum value of 40 ms.
 */
/*@{*/
/*! @brief Read current value of the USBDCD_TIMER2_TVDPSRC_CON field. */
#define USBDCD_RD_TIMER2_TVDPSRC_CON(base) ((USBDCD_TIMER2_REG(base) & USBDCD_TIMER2_TVDPSRC_CON_MASK) >> USBDCD_TIMER2_TVDPSRC_CON_SHIFT)
#define USBDCD_BRD_TIMER2_TVDPSRC_CON(base) (USBDCD_RD_TIMER2_TVDPSRC_CON(base))

/*! @brief Set the TVDPSRC_CON field to a new value. */
#define USBDCD_WR_TIMER2_TVDPSRC_CON(base, value) (USBDCD_RMW_TIMER2(base, USBDCD_TIMER2_TVDPSRC_CON_MASK, USBDCD_TIMER2_TVDPSRC_CON(value)))
#define USBDCD_BWR_TIMER2_TVDPSRC_CON(base, value) (USBDCD_WR_TIMER2_TVDPSRC_CON(base, value))
/*@}*/

/*
 * MK70F12 USBHS
 *
 * USB HS/FS/LS OTG Controller
 *
 * Registers defined in this header file:
 * - USBHS_ID - Identification Register
 * - USBHS_HWGENERAL - General Hardware Parameters Register
 * - USBHS_HWHOST - Host Hardware Parameters Register
 * - USBHS_HWDEVICE - Device Hardware Parameters Register
 * - USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register
 * - USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register
 * - USBHS_GPTIMER0LD - General Purpose Timer n Load Register
 * - USBHS_GPTIMER0CTL - General Purpose Timer n Control Register
 * - USBHS_GPTIMER1LD - General Purpose Timer n Load Register
 * - USBHS_GPTIMER1CTL - General Purpose Timer n Control Register
 * - USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
 * - USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
 * - USBHS_HCSPARAMS - Host Controller Structural Parameters Register
 * - USBHS_HCCPARAMS - Host Controller Capability Parameters Register
 * - USBHS_DCIVERSION - Device Controller Interface Version
 * - USBHS_DCCPARAMS - Device Controller Capability Parameters
 * - USBHS_USBCMD - USB Command Register
 * - USBHS_USBSTS - USB Status Register
 * - USBHS_USBINTR - USB Interrupt Enable Register
 * - USBHS_FRINDEX - Frame Index Register
 * - USBHS_DEVICEADDR - Device Address Register
 * - USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
 * - USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register
 * - USBHS_EPLISTADDR - Endpoint List Address Register
 * - USBHS_TTCTRL - Host TT Asynchronous Buffer Control
 * - USBHS_BURSTSIZE - Master Interface Data Burst Size Register
 * - USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register
 * - USBHS_ULPI_VIEWPORT - ULPI Register Access
 * - USBHS_ENDPTNAK - Endpoint NAK Register
 * - USBHS_ENDPTNAKEN - Endpoint NAK Enable Register
 * - USBHS_CONFIGFLAG - Configure Flag Register
 * - USBHS_PORTSC1 - Port Status and Control Registers
 * - USBHS_OTGSC - On-the-Go Status and Control Register
 * - USBHS_USBMODE - USB Mode Register
 * - USBHS_EPSETUPSR - Endpoint Setup Status Register
 * - USBHS_EPPRIME - Endpoint Initialization Register
 * - USBHS_EPFLUSH - Endpoint Flush Register
 * - USBHS_EPSR - Endpoint Status Register
 * - USBHS_EPCOMPLETE - Endpoint Complete Register
 * - USBHS_EPCR0 - Endpoint Control Register 0
 * - USBHS_EPCR - Endpoint Control Register n
 * - USBHS_USBGENCTRL - USB General Control Register
 */

#define USBHS_INSTANCE_COUNT (1U) /*!< Number of instances of the USBHS module. */
#define USBHS_IDX (0U) /*!< Instance number for USBHS. */

