pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBHS_ID - Identification Register
 ******************************************************************************/

/*!
 * @brief USBHS_ID - Identification Register (RO)
 *
 * Reset value: 0xE461FA05U
 *
 * The ID register provides a simple way to determine if the module is provided
 * in the system. The ID register identifies the module and its revision.
 */
/*!
 * @name Constants and macros for entire USBHS_ID register
 */
/*@{*/
#define USBHS_RD_ID(base)        (USBHS_ID_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_ID bitfields
 */

/*!
 * @name Register USBHS_ID, field ID[5:0] (RO)
 *
 * This number is set to 0x05.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_ID field. */
#define USBHS_RD_ID_ID(base) ((USBHS_ID_REG(base) & USBHS_ID_ID_MASK) >> USBHS_ID_ID_SHIFT)
#define USBHS_BRD_ID_ID(base) (USBHS_RD_ID_ID(base))
/*@}*/

/*!
 * @name Register USBHS_ID, field NID[13:8] (RO)
 *
 * Ones complement version of ID.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_NID field. */
#define USBHS_RD_ID_NID(base) ((USBHS_ID_REG(base) & USBHS_ID_NID_MASK) >> USBHS_ID_NID_SHIFT)
#define USBHS_BRD_ID_NID(base) (USBHS_RD_ID_NID(base))
/*@}*/

/*!
 * @name Register USBHS_ID, field TAG[20:16] (RO)
 *
 * Tag of the module.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_TAG field. */
#define USBHS_RD_ID_TAG(base) ((USBHS_ID_REG(base) & USBHS_ID_TAG_MASK) >> USBHS_ID_TAG_SHIFT)
#define USBHS_BRD_ID_TAG(base) (USBHS_RD_ID_TAG(base))
/*@}*/

/*!
 * @name Register USBHS_ID, field REVISION[24:21] (RO)
 *
 * Revision number of the module.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_REVISION field. */
#define USBHS_RD_ID_REVISION(base) ((USBHS_ID_REG(base) & USBHS_ID_REVISION_MASK) >> USBHS_ID_REVISION_SHIFT)
#define USBHS_BRD_ID_REVISION(base) (USBHS_RD_ID_REVISION(base))
/*@}*/

/*!
 * @name Register USBHS_ID, field VERSION[28:25] (RO)
 *
 * Version of the module.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_VERSION field. */
#define USBHS_RD_ID_VERSION(base) ((USBHS_ID_REG(base) & USBHS_ID_VERSION_MASK) >> USBHS_ID_VERSION_SHIFT)
#define USBHS_BRD_ID_VERSION(base) (USBHS_RD_ID_VERSION(base))
/*@}*/

/*!
 * @name Register USBHS_ID, field VERSIONID[31:29] (RO)
 *
 * Internal version counter.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ID_VERSIONID field. */
#define USBHS_RD_ID_VERSIONID(base) ((USBHS_ID_REG(base) & USBHS_ID_VERSIONID_MASK) >> USBHS_ID_VERSIONID_SHIFT)
#define USBHS_BRD_ID_VERSIONID(base) (USBHS_RD_ID_VERSIONID(base))
/*@}*/

/*******************************************************************************
 * USBHS_HWGENERAL - General Hardware Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HWGENERAL - General Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000085U
 *
 * The HWGENERAL register contains parameters defining the particular
 * implementation of the module.
 */
/*!
 * @name Constants and macros for entire USBHS_HWGENERAL register
 */
/*@{*/
#define USBHS_RD_HWGENERAL(base) (USBHS_HWGENERAL_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HWGENERAL bitfields
 */

/*!
 * @name Register USBHS_HWGENERAL, field PHYM[8:6] (RO)
 *
 * Indicates USB transceiver interface used. Always reads 010. 010 ULPI only
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWGENERAL_PHYM field. */
#define USBHS_RD_HWGENERAL_PHYM(base) ((USBHS_HWGENERAL_REG(base) & USBHS_HWGENERAL_PHYM_MASK) >> USBHS_HWGENERAL_PHYM_SHIFT)
#define USBHS_BRD_HWGENERAL_PHYM(base) (USBHS_RD_HWGENERAL_PHYM(base))
/*@}*/

/*!
 * @name Register USBHS_HWGENERAL, field SM[10:9] (RO)
 *
 * Indicates presence of serial interface. Always 00. 00 Serial engine not
 * present
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWGENERAL_SM field. */
#define USBHS_RD_HWGENERAL_SM(base) ((USBHS_HWGENERAL_REG(base) & USBHS_HWGENERAL_SM_MASK) >> USBHS_HWGENERAL_SM_SHIFT)
#define USBHS_BRD_HWGENERAL_SM(base) (USBHS_RD_HWGENERAL_SM(base))
/*@}*/

/*******************************************************************************
 * USBHS_HWHOST - Host Hardware Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HWHOST - Host Hardware Parameters Register (RO)
 *
 * Reset value: 0x10020001U
 *
 * The HWHOST register provides host hardware parameters for this implementation
 * of the module.
 */
/*!
 * @name Constants and macros for entire USBHS_HWHOST register
 */
/*@{*/
#define USBHS_RD_HWHOST(base)    (USBHS_HWHOST_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HWHOST bitfields
 */

/*!
 * @name Register USBHS_HWHOST, field HC[0] (RO)
 *
 * Always reads as 0b1, indicating the module is host capable.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWHOST_HC field. */
#define USBHS_RD_HWHOST_HC(base) ((USBHS_HWHOST_REG(base) & USBHS_HWHOST_HC_MASK) >> USBHS_HWHOST_HC_SHIFT)
#define USBHS_BRD_HWHOST_HC(base) (BITBAND_ACCESS32(&USBHS_HWHOST_REG(base), USBHS_HWHOST_HC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HWHOST, field NPORT[3:1] (RO)
 *
 * Always 0, indicating the number of ports available (NPORT + 1) for this host
 * implementation.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWHOST_NPORT field. */
#define USBHS_RD_HWHOST_NPORT(base) ((USBHS_HWHOST_REG(base) & USBHS_HWHOST_NPORT_MASK) >> USBHS_HWHOST_NPORT_SHIFT)
#define USBHS_BRD_HWHOST_NPORT(base) (USBHS_RD_HWHOST_NPORT(base))
/*@}*/

/*!
 * @name Register USBHS_HWHOST, field TTASY[23:16] (RO)
 *
 * The number of transaction translator contexts. Always reads as 0x02.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWHOST_TTASY field. */
#define USBHS_RD_HWHOST_TTASY(base) ((USBHS_HWHOST_REG(base) & USBHS_HWHOST_TTASY_MASK) >> USBHS_HWHOST_TTASY_SHIFT)
#define USBHS_BRD_HWHOST_TTASY(base) (USBHS_RD_HWHOST_TTASY(base))
/*@}*/

/*!
 * @name Register USBHS_HWHOST, field TTPER[31:24] (RO)
 *
 * The number of supported transaction translator periodic contexts. Always
 * reads as 0x10 (16 contexts supported).
 */
/*@{*/
/*! @brief Read current value of the USBHS_HWHOST_TTPER field. */
#define USBHS_RD_HWHOST_TTPER(base) ((USBHS_HWHOST_REG(base) & USBHS_HWHOST_TTPER_MASK) >> USBHS_HWHOST_TTPER_SHIFT)
#define USBHS_BRD_HWHOST_TTPER(base) (USBHS_RD_HWHOST_TTPER(base))
/*@}*/

