pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual USBHS_GPTIMER0LD bitfields
 */

/*!
 * @name Register USBHS_GPTIMER0LD, field GPTLD[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER0LD_GPTLD field. */
#define USBHS_RD_GPTIMER0LD_GPTLD(base) ((USBHS_GPTIMER0LD_REG(base) & USBHS_GPTIMER0LD_GPTLD_MASK) >> USBHS_GPTIMER0LD_GPTLD_SHIFT)
#define USBHS_BRD_GPTIMER0LD_GPTLD(base) (USBHS_RD_GPTIMER0LD_GPTLD(base))

/*! @brief Set the GPTLD field to a new value. */
#define USBHS_WR_GPTIMER0LD_GPTLD(base, value) (USBHS_RMW_GPTIMER0LD(base, USBHS_GPTIMER0LD_GPTLD_MASK, USBHS_GPTIMER0LD_GPTLD(value)))
#define USBHS_BWR_GPTIMER0LD_GPTLD(base, value) (USBHS_WR_GPTIMER0LD_GPTLD(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_GPTIMER0CTL - General Purpose Timer n Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_GPTIMER0CTL - General Purpose Timer n Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnCTL register controls the various functions of the general
 * purpose timers.
 */
/*!
 * @name Constants and macros for entire USBHS_GPTIMER0CTL register
 */
/*@{*/
#define USBHS_RD_GPTIMER0CTL(base) (USBHS_GPTIMER0CTL_REG(base))
#define USBHS_WR_GPTIMER0CTL(base, value) (USBHS_GPTIMER0CTL_REG(base) = (value))
#define USBHS_RMW_GPTIMER0CTL(base, mask, value) (USBHS_WR_GPTIMER0CTL(base, (USBHS_RD_GPTIMER0CTL(base) & ~(mask)) | (value)))
#define USBHS_SET_GPTIMER0CTL(base, value) (USBHS_WR_GPTIMER0CTL(base, USBHS_RD_GPTIMER0CTL(base) |  (value)))
#define USBHS_CLR_GPTIMER0CTL(base, value) (USBHS_WR_GPTIMER0CTL(base, USBHS_RD_GPTIMER0CTL(base) & ~(value)))
#define USBHS_TOG_GPTIMER0CTL(base, value) (USBHS_WR_GPTIMER0CTL(base, USBHS_RD_GPTIMER0CTL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_GPTIMER0CTL bitfields
 */

/*!
 * @name Register USBHS_GPTIMER0CTL, field GPTCNT[23:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER0CTL_GPTCNT field. */
#define USBHS_RD_GPTIMER0CTL_GPTCNT(base) ((USBHS_GPTIMER0CTL_REG(base) & USBHS_GPTIMER0CTL_GPTCNT_MASK) >> USBHS_GPTIMER0CTL_GPTCNT_SHIFT)
#define USBHS_BRD_GPTIMER0CTL_GPTCNT(base) (USBHS_RD_GPTIMER0CTL_GPTCNT(base))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER0CTL, field MODE[24] (RW)
 *
 * Values:
 * - 0 - One shot
 * - 1 - Repeat
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER0CTL_MODE field. */
#define USBHS_RD_GPTIMER0CTL_MODE(base) ((USBHS_GPTIMER0CTL_REG(base) & USBHS_GPTIMER0CTL_MODE_MASK) >> USBHS_GPTIMER0CTL_MODE_SHIFT)
#define USBHS_BRD_GPTIMER0CTL_MODE(base) (BITBAND_ACCESS32(&USBHS_GPTIMER0CTL_REG(base), USBHS_GPTIMER0CTL_MODE_SHIFT))

/*! @brief Set the MODE field to a new value. */
#define USBHS_WR_GPTIMER0CTL_MODE(base, value) (USBHS_RMW_GPTIMER0CTL(base, USBHS_GPTIMER0CTL_MODE_MASK, USBHS_GPTIMER0CTL_MODE(value)))
#define USBHS_BWR_GPTIMER0CTL_MODE(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER0CTL_REG(base), USBHS_GPTIMER0CTL_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER0CTL, field RST[30] (WO)
 *
 * Values:
 * - 0 - No action
 * - 1 - Load counter value
 */
/*@{*/
/*! @brief Set the RST field to a new value. */
#define USBHS_WR_GPTIMER0CTL_RST(base, value) (USBHS_RMW_GPTIMER0CTL(base, USBHS_GPTIMER0CTL_RST_MASK, USBHS_GPTIMER0CTL_RST(value)))
#define USBHS_BWR_GPTIMER0CTL_RST(base, value) (USBHS_WR_GPTIMER0CTL_RST(base, value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER0CTL, field RUN[31] (RW)
 *
 * Values:
 * - 0 - Timer stop
 * - 1 - Timer run
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER0CTL_RUN field. */
#define USBHS_RD_GPTIMER0CTL_RUN(base) ((USBHS_GPTIMER0CTL_REG(base) & USBHS_GPTIMER0CTL_RUN_MASK) >> USBHS_GPTIMER0CTL_RUN_SHIFT)
#define USBHS_BRD_GPTIMER0CTL_RUN(base) (BITBAND_ACCESS32(&USBHS_GPTIMER0CTL_REG(base), USBHS_GPTIMER0CTL_RUN_SHIFT))

/*! @brief Set the RUN field to a new value. */
#define USBHS_WR_GPTIMER0CTL_RUN(base, value) (USBHS_RMW_GPTIMER0CTL(base, USBHS_GPTIMER0CTL_RUN_MASK, USBHS_GPTIMER0CTL_RUN(value)))
#define USBHS_BWR_GPTIMER0CTL_RUN(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER0CTL_REG(base), USBHS_GPTIMER0CTL_RUN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_GPTIMER1LD - General Purpose Timer n Load Register
 ******************************************************************************/

/*!
 * @brief USBHS_GPTIMER1LD - General Purpose Timer n Load Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnLD register contains the timer duration or load value.
 */
/*!
 * @name Constants and macros for entire USBHS_GPTIMER1LD register
 */
/*@{*/
#define USBHS_RD_GPTIMER1LD(base) (USBHS_GPTIMER1LD_REG(base))
#define USBHS_WR_GPTIMER1LD(base, value) (USBHS_GPTIMER1LD_REG(base) = (value))
#define USBHS_RMW_GPTIMER1LD(base, mask, value) (USBHS_WR_GPTIMER1LD(base, (USBHS_RD_GPTIMER1LD(base) & ~(mask)) | (value)))
#define USBHS_SET_GPTIMER1LD(base, value) (USBHS_WR_GPTIMER1LD(base, USBHS_RD_GPTIMER1LD(base) |  (value)))
#define USBHS_CLR_GPTIMER1LD(base, value) (USBHS_WR_GPTIMER1LD(base, USBHS_RD_GPTIMER1LD(base) & ~(value)))
#define USBHS_TOG_GPTIMER1LD(base, value) (USBHS_WR_GPTIMER1LD(base, USBHS_RD_GPTIMER1LD(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_GPTIMER1LD bitfields
 */

/*!
 * @name Register USBHS_GPTIMER1LD, field GPTLD[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1LD_GPTLD field. */
#define USBHS_RD_GPTIMER1LD_GPTLD(base) ((USBHS_GPTIMER1LD_REG(base) & USBHS_GPTIMER1LD_GPTLD_MASK) >> USBHS_GPTIMER1LD_GPTLD_SHIFT)
#define USBHS_BRD_GPTIMER1LD_GPTLD(base) (USBHS_RD_GPTIMER1LD_GPTLD(base))

/*! @brief Set the GPTLD field to a new value. */
#define USBHS_WR_GPTIMER1LD_GPTLD(base, value) (USBHS_RMW_GPTIMER1LD(base, USBHS_GPTIMER1LD_GPTLD_MASK, USBHS_GPTIMER1LD_GPTLD(value)))
#define USBHS_BWR_GPTIMER1LD_GPTLD(base, value) (USBHS_WR_GPTIMER1LD_GPTLD(base, value))
/*@}*/

