pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBHS_GPTIMER1CTL - General Purpose Timer n Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_GPTIMER1CTL - General Purpose Timer n Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnCTL register controls the various functions of the general
 * purpose timers.
 */
/*!
 * @name Constants and macros for entire USBHS_GPTIMER1CTL register
 */
/*@{*/
#define USBHS_RD_GPTIMER1CTL(base) (USBHS_GPTIMER1CTL_REG(base))
#define USBHS_WR_GPTIMER1CTL(base, value) (USBHS_GPTIMER1CTL_REG(base) = (value))
#define USBHS_RMW_GPTIMER1CTL(base, mask, value) (USBHS_WR_GPTIMER1CTL(base, (USBHS_RD_GPTIMER1CTL(base) & ~(mask)) | (value)))
#define USBHS_SET_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) |  (value)))
#define USBHS_CLR_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) & ~(value)))
#define USBHS_TOG_GPTIMER1CTL(base, value) (USBHS_WR_GPTIMER1CTL(base, USBHS_RD_GPTIMER1CTL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_GPTIMER1CTL bitfields
 */

/*!
 * @name Register USBHS_GPTIMER1CTL, field GPTCNT[23:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_GPTCNT field. */
#define USBHS_RD_GPTIMER1CTL_GPTCNT(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_GPTCNT_MASK) >> USBHS_GPTIMER1CTL_GPTCNT_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_GPTCNT(base) (USBHS_RD_GPTIMER1CTL_GPTCNT(base))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field MODE[24] (RW)
 *
 * Values:
 * - 0 - One shot
 * - 1 - Repeat
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_MODE field. */
#define USBHS_RD_GPTIMER1CTL_MODE(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_MODE_MASK) >> USBHS_GPTIMER1CTL_MODE_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_MODE(base) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_MODE_SHIFT))

/*! @brief Set the MODE field to a new value. */
#define USBHS_WR_GPTIMER1CTL_MODE(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_MODE_MASK, USBHS_GPTIMER1CTL_MODE(value)))
#define USBHS_BWR_GPTIMER1CTL_MODE(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_MODE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field RST[30] (WO)
 *
 * Values:
 * - 0 - No action
 * - 1 - Load counter value
 */
/*@{*/
/*! @brief Set the RST field to a new value. */
#define USBHS_WR_GPTIMER1CTL_RST(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_RST_MASK, USBHS_GPTIMER1CTL_RST(value)))
#define USBHS_BWR_GPTIMER1CTL_RST(base, value) (USBHS_WR_GPTIMER1CTL_RST(base, value))
/*@}*/

/*!
 * @name Register USBHS_GPTIMER1CTL, field RUN[31] (RW)
 *
 * Values:
 * - 0 - Timer stop
 * - 1 - Timer run
 */
/*@{*/
/*! @brief Read current value of the USBHS_GPTIMER1CTL_RUN field. */
#define USBHS_RD_GPTIMER1CTL_RUN(base) ((USBHS_GPTIMER1CTL_REG(base) & USBHS_GPTIMER1CTL_RUN_MASK) >> USBHS_GPTIMER1CTL_RUN_SHIFT)
#define USBHS_BRD_GPTIMER1CTL_RUN(base) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_RUN_SHIFT))

/*! @brief Set the RUN field to a new value. */
#define USBHS_WR_GPTIMER1CTL_RUN(base, value) (USBHS_RMW_GPTIMER1CTL(base, USBHS_GPTIMER1CTL_RUN_MASK, USBHS_GPTIMER1CTL_RUN(value)))
#define USBHS_BWR_GPTIMER1CTL_RUN(base, value) (BITBAND_ACCESS32(&USBHS_GPTIMER1CTL_REG(base), USBHS_GPTIMER1CTL_RUN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
 ******************************************************************************/

/*!
 * @brief USBHS_USB_SBUSCFG - System Bus Interface Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The System Bus Interface Configuration (USB_SBUSCFG) register contains the
 * control for the system bus interface.
 */
/*!
 * @name Constants and macros for entire USBHS_USB_SBUSCFG register
 */
/*@{*/
#define USBHS_RD_USB_SBUSCFG(base) (USBHS_USB_SBUSCFG_REG(base))
#define USBHS_WR_USB_SBUSCFG(base, value) (USBHS_USB_SBUSCFG_REG(base) = (value))
#define USBHS_RMW_USB_SBUSCFG(base, mask, value) (USBHS_WR_USB_SBUSCFG(base, (USBHS_RD_USB_SBUSCFG(base) & ~(mask)) | (value)))
#define USBHS_SET_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) |  (value)))
#define USBHS_CLR_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) & ~(value)))
#define USBHS_TOG_USB_SBUSCFG(base, value) (USBHS_WR_USB_SBUSCFG(base, USBHS_RD_USB_SBUSCFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USB_SBUSCFG bitfields
 */

/*!
 * @name Register USBHS_USB_SBUSCFG, field BURSTMODE[2:0] (RW)
 *
 * Selects the options for the burst signal of the Master Interface. In all
 * cases where the unspecified length burst is allowed, single accesses may also
 * occur; this is mostly true when the transaction is not 32-bit aligned. Two
 * consecutive single accesses should not happen. When an INCRx burst size is selected
 * and the transfer is not multiple of the INCRx burst, the burst is decomposed in
 * the different ways. With BURSTMODE[2] = 1, the smaller bursts is unspecified
 * length. with BURSTMODE[2] = 0, the smaller bursts are smaller INCRx or
 * singles. For example, if it were required at a given time to transfer 22 words of
 * information, for the following values of BURSTMODE the master sequences are: 101
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + INCR unspec. length. 110 INCR8 + INCR8
 * + INCR4 + INCR unspec. length. 111 INCR16 + INCR4 + INCR unspec. length. 001
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + SINGLE + SINGLE. 010 INCR8 + INCR8 +
 * INCR4 + SINGLE + SINGLE. 011 INCR16 + INCR4 + SINGLE + SINGLE. When this field
 * is different from zero, the values in the TXBURST/RXBURST bitfields in the
 * USB_BURSTSIZE register are ignored by the controller. Internally the BURSTMODE is
 * set to the value of the INCRx burst. Since this has a direct relation with
 * the burst sizes you must be careful with AHB burst selected. Although the
 * TXBURST/RXBURST are bypassed, this register can be written/read with no effect while
 * the BURSTMODE field is non-zero. Setting the BURSTMODE value to 000 might
 * cause bus allocation during BULK or ISO transfers. Changing this BURSTMODE field
 * while a transaction is in progress yields undefined results. One possible way
 * to prevent undefined results is to clear the Run/Stop (RS) bit in the
 * USB_USBCMD register, after the HCHALTED is detected in USB_USBSTS.
 *
 * Values:
 * - 000 - INCR burst of unspecified length
 * - 001 - INCR4, non-multiple transfers of INCR4 is decomposed into singles.
 * - 010 - INCR8, non-multiple transfers of INCR8, is decomposed into INCR4 or
 *     singles.
 * - 011 - INCR16, non-multiple transfers of INCR16, is decomposed into INCR8,
 *     INCR4 or singles.
 * - 100 - Reserved, do not use.
 * - 101 - INCR4, non-multiple transfers of INCR4 is decomposed into smaller
 *     unspecified length bursts.
 * - 110 - INCR8, non-multiple transfers of INCR8 is decomposed into smaller
 *     unspecified length bursts.
 * - 111 - INCR16, non-multiple transfers of INCR16 is decomposed into smaller
 *     unspecified length bursts.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USB_SBUSCFG_BURSTMODE field. */
#define USBHS_RD_USB_SBUSCFG_BURSTMODE(base) ((USBHS_USB_SBUSCFG_REG(base) & USBHS_USB_SBUSCFG_BURSTMODE_MASK) >> USBHS_USB_SBUSCFG_BURSTMODE_SHIFT)
#define USBHS_BRD_USB_SBUSCFG_BURSTMODE(base) (USBHS_RD_USB_SBUSCFG_BURSTMODE(base))

