pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the BURSTMODE field to a new value. */
#define USBHS_WR_USB_SBUSCFG_BURSTMODE(base, value) (USBHS_RMW_USB_SBUSCFG(base, USBHS_USB_SBUSCFG_BURSTMODE_MASK, USBHS_USB_SBUSCFG_BURSTMODE(value)))
#define USBHS_BWR_USB_SBUSCFG_BURSTMODE(base, value) (USBHS_WR_USB_SBUSCFG_BURSTMODE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
 ******************************************************************************/

/*!
 * @brief USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register (RO)
 *
 * Reset value: 0x01000040U
 *
 * Contains the CAPLENGTH field used as an offset to add to the register base
 * address to find the beginning of the operational register space, the location of
 * the USBCMD register. Also contains a BCD encoding of the EHCI revision number
 * supported by this OTG controller. The most-significant byte of the HCIVERSION
 * field represents a major revision; the least-significant byte is the minor
 * revision.
 */
/*!
 * @name Constants and macros for entire USBHS_HCIVERSION register
 */
/*@{*/
#define USBHS_RD_HCIVERSION(base) (USBHS_HCIVERSION_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HCIVERSION bitfields
 */

/*!
 * @name Register USBHS_HCIVERSION, field CAPLENGTH[7:0] (RO)
 *
 * Always reads as 0x40.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCIVERSION_CAPLENGTH field. */
#define USBHS_RD_HCIVERSION_CAPLENGTH(base) ((USBHS_HCIVERSION_REG(base) & USBHS_HCIVERSION_CAPLENGTH_MASK) >> USBHS_HCIVERSION_CAPLENGTH_SHIFT)
#define USBHS_BRD_HCIVERSION_CAPLENGTH(base) (USBHS_RD_HCIVERSION_CAPLENGTH(base))
/*@}*/

/*!
 * @name Register USBHS_HCIVERSION, field HCIVERSION[31:16] (RO)
 *
 * Value is reads as 0x0100, indicating version 1.0.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCIVERSION_HCIVERSION field. */
#define USBHS_RD_HCIVERSION_HCIVERSION(base) ((USBHS_HCIVERSION_REG(base) & USBHS_HCIVERSION_HCIVERSION_MASK) >> USBHS_HCIVERSION_HCIVERSION_SHIFT)
#define USBHS_BRD_HCIVERSION_HCIVERSION(base) (USBHS_RD_HCIVERSION_HCIVERSION(base))
/*@}*/

/*******************************************************************************
 * USBHS_HCSPARAMS - Host Controller Structural Parameters Register
 ******************************************************************************/

/*!
 * @brief USBHS_HCSPARAMS - Host Controller Structural Parameters Register (RO)
 *
 * Reset value: 0x00010011U
 *
 * This register contains structural parameters such as the number of downstream
 * ports.
 */
/*!
 * @name Constants and macros for entire USBHS_HCSPARAMS register
 */
/*@{*/
#define USBHS_RD_HCSPARAMS(base) (USBHS_HCSPARAMS_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_HCSPARAMS bitfields
 */

/*!
 * @name Register USBHS_HCSPARAMS, field N_PORTS[3:0] (RO)
 *
 * Indicates number of physical downstream ports implemented for host
 * applications. Field value determines how many addressable port registers in the
 * operational register. Always reads as 0x1.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PORTS field. */
#define USBHS_RD_HCSPARAMS_N_PORTS(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PORTS_MASK) >> USBHS_HCSPARAMS_N_PORTS_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PORTS(base) (USBHS_RD_HCSPARAMS_N_PORTS(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field PPC[4] (RO)
 *
 * Indicates whether host controller supports port power control. Always reads
 * as 0b1.
 *
 * Values:
 * - 1 - Ports have power port switches
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_PPC field. */
#define USBHS_RD_HCSPARAMS_PPC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_PPC_MASK) >> USBHS_HCSPARAMS_PPC_SHIFT)
#define USBHS_BRD_HCSPARAMS_PPC(base) (BITBAND_ACCESS32(&USBHS_HCSPARAMS_REG(base), USBHS_HCSPARAMS_PPC_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_PCC[11:8] (RO)
 *
 * Indicates number of ports supported per internal companion controller. This
 * field reads as 0x0 because no companion controllers are present.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PCC field. */
#define USBHS_RD_HCSPARAMS_N_PCC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PCC_MASK) >> USBHS_HCSPARAMS_N_PCC_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PCC(base) (USBHS_RD_HCSPARAMS_N_PCC(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_CC[15:12] (RO)
 *
 * Indicates number of companion controllers associated with USBHS controller.
 * Always cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_CC field. */
#define USBHS_RD_HCSPARAMS_N_CC(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_CC_MASK) >> USBHS_HCSPARAMS_N_CC_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_CC(base) (USBHS_RD_HCSPARAMS_N_CC(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field PI[16] (RO)
 *
 * Indicates whether the ports support port indicator control. Always set.
 *
 * Values:
 * - 0 - No port indicator fields
 * - 1 - The port status and control registers include a R/W field for
 *     controlling the state of the port indicator
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_PI field. */
#define USBHS_RD_HCSPARAMS_PI(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_PI_MASK) >> USBHS_HCSPARAMS_PI_SHIFT)
#define USBHS_BRD_HCSPARAMS_PI(base) (BITBAND_ACCESS32(&USBHS_HCSPARAMS_REG(base), USBHS_HCSPARAMS_PI_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_PTT[23:20] (RO)
 *
 * Non-EHCI field. Indicates number of ports assigned to each transaction
 * translator within host controller.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_PTT field. */
#define USBHS_RD_HCSPARAMS_N_PTT(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_PTT_MASK) >> USBHS_HCSPARAMS_N_PTT_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_PTT(base) (USBHS_RD_HCSPARAMS_N_PTT(base))
/*@}*/

/*!
 * @name Register USBHS_HCSPARAMS, field N_TT[27:24] (RO)
 *
 * Non-EHCI field. Indicates number of embedded transaction translators
 * associated with host controller. This field always reads as 0x0. See section "Embedded
 * Transaction Translator Function," for more information on embedded
 * transaction translators.
 */
/*@{*/
/*! @brief Read current value of the USBHS_HCSPARAMS_N_TT field. */
#define USBHS_RD_HCSPARAMS_N_TT(base) ((USBHS_HCSPARAMS_REG(base) & USBHS_HCSPARAMS_N_TT_MASK) >> USBHS_HCSPARAMS_N_TT_SHIFT)
#define USBHS_BRD_HCSPARAMS_N_TT(base) (USBHS_RD_HCSPARAMS_N_TT(base))
/*@}*/

