pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual USBHS_DEVICEADDR bitfields
 */

/*!
 * @name Register USBHS_DEVICEADDR, field USBADRA[24] (RW)
 *
 * This field provides a mechanism for staging the device address in advance.
 * After the status phase of the SET_ADDRESS descriptor, the DCD has 2 ms to
 * program the USBADR field. This mechanism ensures this specification is met when the
 * DCD cannot write to the device address within 2 ms from the SET_ADDRESS status
 * phase. If the DCD writes the USBADR with USBADRA equaling 1 after the
 * SET_ADDRESS data phase (before the prime of the status phase), the USBADR is
 * programmed instantly at the correct time and meets the 2 ms USB requirement. Hardware
 * automatically clears this bit on the following conditions: IN is ACKed to
 * endpoint 0. (USBADR is updated from staging register.) OUT/SETUP occur to endpoint
 * 0. (USBADR is not updated.) Device Reset occurs. (USBADR is reset to 0.)
 *
 * Values:
 * - 0 - Writes to USBADR are instantaneous.
 * - 1 - When this bit is written to a 1 at the same time or before USBADR is
 *     written, the write to the USBADR field is staged and held in a hidden
 *     register. After an IN occurs on endpoint 0 and is ACKed, USBADR is loaded from
 *     the holding register.
 */
/*@{*/
/*! @brief Read current value of the USBHS_DEVICEADDR_USBADRA field. */
#define USBHS_RD_DEVICEADDR_USBADRA(base) ((USBHS_DEVICEADDR_REG(base) & USBHS_DEVICEADDR_USBADRA_MASK) >> USBHS_DEVICEADDR_USBADRA_SHIFT)
#define USBHS_BRD_DEVICEADDR_USBADRA(base) (BITBAND_ACCESS32(&USBHS_DEVICEADDR_REG(base), USBHS_DEVICEADDR_USBADRA_SHIFT))

/*! @brief Set the USBADRA field to a new value. */
#define USBHS_WR_DEVICEADDR_USBADRA(base, value) (USBHS_RMW_DEVICEADDR(base, USBHS_DEVICEADDR_USBADRA_MASK, USBHS_DEVICEADDR_USBADRA(value)))
#define USBHS_BWR_DEVICEADDR_USBADRA(base, value) (BITBAND_ACCESS32(&USBHS_DEVICEADDR_REG(base), USBHS_DEVICEADDR_USBADRA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_DEVICEADDR, field USBADR[31:25] (RW)
 *
 * This field corresponds to the USB device address.
 */
/*@{*/
/*! @brief Read current value of the USBHS_DEVICEADDR_USBADR field. */
#define USBHS_RD_DEVICEADDR_USBADR(base) ((USBHS_DEVICEADDR_REG(base) & USBHS_DEVICEADDR_USBADR_MASK) >> USBHS_DEVICEADDR_USBADR_SHIFT)
#define USBHS_BRD_DEVICEADDR_USBADR(base) (USBHS_RD_DEVICEADDR_USBADR(base))

/*! @brief Set the USBADR field to a new value. */
#define USBHS_WR_DEVICEADDR_USBADR(base, value) (USBHS_RMW_DEVICEADDR(base, USBHS_DEVICEADDR_USBADR_MASK, USBHS_DEVICEADDR_USBADR(value)))
#define USBHS_BWR_DEVICEADDR_USBADR(base, value) (USBHS_WR_DEVICEADDR_USBADR(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
 ******************************************************************************/

/*!
 * @brief USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the beginning address of the periodic frame list in
 * the system memory. The host controller driver loads this register prior to
 * starting the schedule execution by the controller. The memory structure referenced
 * by this physical memory pointer assumes to be 4-Kbyte aligned. The contents
 * combine with the FRINDEX register to enable the controller to step through the
 * periodic frame list in sequence. The host and device mode functions share this
 * register. In host mode, it is the PERIODICLISTBASE register; in device mode,
 * it is the DEVICEADDR register. See section "Device Address Register
 * (DEVICEADDR)," for more information.
 */
/*!
 * @name Constants and macros for entire USBHS_PERIODICLISTBASE register
 */
/*@{*/
#define USBHS_RD_PERIODICLISTBASE(base) (USBHS_PERIODICLISTBASE_REG(base))
#define USBHS_WR_PERIODICLISTBASE(base, value) (USBHS_PERIODICLISTBASE_REG(base) = (value))
#define USBHS_RMW_PERIODICLISTBASE(base, mask, value) (USBHS_WR_PERIODICLISTBASE(base, (USBHS_RD_PERIODICLISTBASE(base) & ~(mask)) | (value)))
#define USBHS_SET_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) |  (value)))
#define USBHS_CLR_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) & ~(value)))
#define USBHS_TOG_PERIODICLISTBASE(base, value) (USBHS_WR_PERIODICLISTBASE(base, USBHS_RD_PERIODICLISTBASE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_PERIODICLISTBASE bitfields
 */

/*!
 * @name Register USBHS_PERIODICLISTBASE, field PERBASE[31:12] (RW)
 *
 * These bits correspond to memory address signal [31:12]. Used only in the host
 * mode.
 */
/*@{*/
/*! @brief Read current value of the USBHS_PERIODICLISTBASE_PERBASE field. */
#define USBHS_RD_PERIODICLISTBASE_PERBASE(base) ((USBHS_PERIODICLISTBASE_REG(base) & USBHS_PERIODICLISTBASE_PERBASE_MASK) >> USBHS_PERIODICLISTBASE_PERBASE_SHIFT)
#define USBHS_BRD_PERIODICLISTBASE_PERBASE(base) (USBHS_RD_PERIODICLISTBASE_PERBASE(base))

/*! @brief Set the PERBASE field to a new value. */
#define USBHS_WR_PERIODICLISTBASE_PERBASE(base, value) (USBHS_RMW_PERIODICLISTBASE(base, USBHS_PERIODICLISTBASE_PERBASE_MASK, USBHS_PERIODICLISTBASE_PERBASE(value)))
#define USBHS_BWR_PERIODICLISTBASE_PERBASE(base, value) (USBHS_WR_PERIODICLISTBASE_PERBASE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register
 ******************************************************************************/

/*!
 * @brief USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The ASYNCLISTADDR register contains the address of the next asynchronous
 * queue head to executed by the host. The host and device mode functions share this
 * register. In host mode, it is the ASYNCLISTADDR register; in device mode, it
 * is the EPLISTADDR register. See section "Endpoint List Address Register
 * (EPLISTADDR)," for more information.
 */
/*!
 * @name Constants and macros for entire USBHS_ASYNCLISTADDR register
 */
/*@{*/
#define USBHS_RD_ASYNCLISTADDR(base) (USBHS_ASYNCLISTADDR_REG(base))
#define USBHS_WR_ASYNCLISTADDR(base, value) (USBHS_ASYNCLISTADDR_REG(base) = (value))
#define USBHS_RMW_ASYNCLISTADDR(base, mask, value) (USBHS_WR_ASYNCLISTADDR(base, (USBHS_RD_ASYNCLISTADDR(base) & ~(mask)) | (value)))
#define USBHS_SET_ASYNCLISTADDR(base, value) (USBHS_WR_ASYNCLISTADDR(base, USBHS_RD_ASYNCLISTADDR(base) |  (value)))
#define USBHS_CLR_ASYNCLISTADDR(base, value) (USBHS_WR_ASYNCLISTADDR(base, USBHS_RD_ASYNCLISTADDR(base) & ~(value)))
#define USBHS_TOG_ASYNCLISTADDR(base, value) (USBHS_WR_ASYNCLISTADDR(base, USBHS_RD_ASYNCLISTADDR(base) ^  (value)))
/*@}*/

