pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*
 * Constants & macros for individual USBHS_ASYNCLISTADDR bitfields
 */

/*!
 * @name Register USBHS_ASYNCLISTADDR, field ASYBASE[31:5] (RW)
 *
 * These bits correspond to memory address signal [31:5]. This field may only
 * reference a queue head (QH). Used only in host mode.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ASYNCLISTADDR_ASYBASE field. */
#define USBHS_RD_ASYNCLISTADDR_ASYBASE(base) ((USBHS_ASYNCLISTADDR_REG(base) & USBHS_ASYNCLISTADDR_ASYBASE_MASK) >> USBHS_ASYNCLISTADDR_ASYBASE_SHIFT)
#define USBHS_BRD_ASYNCLISTADDR_ASYBASE(base) (USBHS_RD_ASYNCLISTADDR_ASYBASE(base))

/*! @brief Set the ASYBASE field to a new value. */
#define USBHS_WR_ASYNCLISTADDR_ASYBASE(base, value) (USBHS_RMW_ASYNCLISTADDR(base, USBHS_ASYNCLISTADDR_ASYBASE_MASK, USBHS_ASYNCLISTADDR_ASYBASE(value)))
#define USBHS_BWR_ASYNCLISTADDR_ASYBASE(base, value) (USBHS_WR_ASYNCLISTADDR_ASYBASE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_EPLISTADDR - Endpoint List Address Register
 ******************************************************************************/

/*!
 * @brief USBHS_EPLISTADDR - Endpoint List Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. For device mode, this
 * register contains the address of the endpoint list top in system memory. The
 * memory structure referenced by this physical memory pointer assumes to be
 * 64-bytes. The queue head is actually a 48-byte structure, but must be aligned on
 * 64-byte boundary. However, the EPBASE field has a granularity of 2 Kbytes; in
 * practice, the queue head should be 2-Kbyte aligned. The host and device mode
 * functions share this register. In device mode, it is the EPLISTADDR register; in
 * host mode, it is the ASYNCLISTADDR register. See section "Current
 * Asynchronous List Address Register (ASYNCLISTADDR)," for more information.
 */
/*!
 * @name Constants and macros for entire USBHS_EPLISTADDR register
 */
/*@{*/
#define USBHS_RD_EPLISTADDR(base) (USBHS_EPLISTADDR_REG(base))
#define USBHS_WR_EPLISTADDR(base, value) (USBHS_EPLISTADDR_REG(base) = (value))
#define USBHS_RMW_EPLISTADDR(base, mask, value) (USBHS_WR_EPLISTADDR(base, (USBHS_RD_EPLISTADDR(base) & ~(mask)) | (value)))
#define USBHS_SET_EPLISTADDR(base, value) (USBHS_WR_EPLISTADDR(base, USBHS_RD_EPLISTADDR(base) |  (value)))
#define USBHS_CLR_EPLISTADDR(base, value) (USBHS_WR_EPLISTADDR(base, USBHS_RD_EPLISTADDR(base) & ~(value)))
#define USBHS_TOG_EPLISTADDR(base, value) (USBHS_WR_EPLISTADDR(base, USBHS_RD_EPLISTADDR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_EPLISTADDR bitfields
 */

/*!
 * @name Register USBHS_EPLISTADDR, field EPBASE[31:11] (RW)
 *
 * Correspond to memory address signals [31:11] References a list of up to 32
 * queue heads (i.e. one queue head per endpoint and direction). Address of the top
 * of the endpoint list.
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPLISTADDR_EPBASE field. */
#define USBHS_RD_EPLISTADDR_EPBASE(base) ((USBHS_EPLISTADDR_REG(base) & USBHS_EPLISTADDR_EPBASE_MASK) >> USBHS_EPLISTADDR_EPBASE_SHIFT)
#define USBHS_BRD_EPLISTADDR_EPBASE(base) (USBHS_RD_EPLISTADDR_EPBASE(base))

/*! @brief Set the EPBASE field to a new value. */
#define USBHS_WR_EPLISTADDR_EPBASE(base, value) (USBHS_RMW_EPLISTADDR(base, USBHS_EPLISTADDR_EPBASE_MASK, USBHS_EPLISTADDR_EPBASE(value)))
#define USBHS_BWR_EPLISTADDR_EPBASE(base, value) (USBHS_WR_EPLISTADDR_EPBASE(base, value))
/*@}*/

/*******************************************************************************
 * USBHS_TTCTRL - Host TT Asynchronous Buffer Control
 ******************************************************************************/

/*!
 * @brief USBHS_TTCTRL - Host TT Asynchronous Buffer Control (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire USBHS_TTCTRL register
 */
/*@{*/
#define USBHS_RD_TTCTRL(base)    (USBHS_TTCTRL_REG(base))
/*@}*/

/*
 * Constants & macros for individual USBHS_TTCTRL bitfields
 */

/*!
 * @name Register USBHS_TTCTRL, field TTHA[30:24] (RO)
 *
 * This field is used to match against the Hub Address field in a QH or siTD to
 * determine if the packet is routed to the internal TT for directly attached
 * FS/LS devices. If the hub address in the QH or siTD does not match this address
 * then the packet is broadcast on the high speed ports destined for a downstream
 * HS hub with the address in the QH or siTD.
 */
/*@{*/
/*! @brief Read current value of the USBHS_TTCTRL_TTHA field. */
#define USBHS_RD_TTCTRL_TTHA(base) ((USBHS_TTCTRL_REG(base) & USBHS_TTCTRL_TTHA_MASK) >> USBHS_TTCTRL_TTHA_SHIFT)
#define USBHS_BRD_TTCTRL_TTHA(base) (USBHS_RD_TTCTRL_TTHA(base))
/*@}*/

/*!
 * @name Register USBHS_TTCTRL, field Reerved[31] (ROZ)
 *
 * Must ne cleared.
 */
/*@{*/
/*! @brief Read current value of the USBHS_TTCTRL_Reerved field. */
#define USBHS_RD_TTCTRL_Reerved(base) ((USBHS_TTCTRL_REG(base) & USBHS_TTCTRL_Reerved_MASK) >> USBHS_TTCTRL_Reerved_SHIFT)
#define USBHS_BRD_TTCTRL_Reerved(base) (BITBAND_ACCESS32(&USBHS_TTCTRL_REG(base), USBHS_TTCTRL_Reerved_SHIFT))
/*@}*/

/*******************************************************************************
 * USBHS_BURSTSIZE - Master Interface Data Burst Size Register
 ******************************************************************************/

/*!
 * @brief USBHS_BURSTSIZE - Master Interface Data Burst Size Register (RW)
 *
 * Reset value: 0x00008080U
 *
 * This register is not defined in the EHCI specification. BURSTSIZE dynamically
 * controls the burst size during data movement on the initiator (master)
 * interface.
 */
/*!
 * @name Constants and macros for entire USBHS_BURSTSIZE register
 */
/*@{*/
#define USBHS_RD_BURSTSIZE(base) (USBHS_BURSTSIZE_REG(base))
#define USBHS_WR_BURSTSIZE(base, value) (USBHS_BURSTSIZE_REG(base) = (value))
#define USBHS_RMW_BURSTSIZE(base, mask, value) (USBHS_WR_BURSTSIZE(base, (USBHS_RD_BURSTSIZE(base) & ~(mask)) | (value)))
#define USBHS_SET_BURSTSIZE(base, value) (USBHS_WR_BURSTSIZE(base, USBHS_RD_BURSTSIZE(base) |  (value)))
#define USBHS_CLR_BURSTSIZE(base, value) (USBHS_WR_BURSTSIZE(base, USBHS_RD_BURSTSIZE(base) & ~(value)))
#define USBHS_TOG_BURSTSIZE(base, value) (USBHS_WR_BURSTSIZE(base, USBHS_RD_BURSTSIZE(base) ^  (value)))
/*@}*/

