pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBHS_ULPI_VIEWPORT - ULPI Register Access
 ******************************************************************************/

/*!
 * @brief USBHS_ULPI_VIEWPORT - ULPI Register Access (RW)
 *
 * Reset value: 0x00000000U
 *
 * The register provides indirect access to the ULPI PHY register set. Although
 * the controller modules perform access to the ULPI PHY register set, there may
 * be circumstances where software may need direct access. Be advised that writes
 * to the ULPI through the ULPI viewport can substantially harm standard USB
 * operations. Currently no usage model has been defined where software should need
 * to execute writes directly to the ULPI. Executing read operations though the
 * ULPI viewport should have no harmful side effects to standard USB operations.
 * Also, if the ULPI interface is not enabled, this register is always read
 * cleared. There are two operations that can be performed with the ULPI viewport,
 * wake-up and read/write operations. The wake-up operation is used to put the ULPI
 * interface into normal operation mode and re-enable the clock if necessary. A
 * wake-up operation is required before accessing the registers when the ULPI
 * interface is operating in low power mode, serial mode, or carkit mode. The ULPI
 * state can be determined by reading the sync state bit (ULPI_SS). If this bit is
 * set, then the ULPI interface is running in normal operating mode and can accept
 * read/write operations. If ULPI_SS is cleared, then read/write operations are
 * not executed. Undefined behavior results if a read or write operation is
 * performed when ULPI_SS is cleared. To execute a wake-up operation, write all
 * 32-bits of the ULPI VIEWPORT where ULPI_PORT is constructed appropriately and the
 * ULPI_WU bit is set and the ULPI_RUN bit is cleared. Poll the ULPI VIEWPORT until
 * ULPI_WU is cleared for the operation to complete. To execute a read or write
 * operation, write all 32-bits of the ULPI VIEWPORT where ULPI_DATWR, ULPI_ADDR,
 * ULPI_PORT, ULPI_RW are constructed appropriately and the ULPI_RUN bit is set.
 * Poll the ULPI VIEWPORT until ULPI_RUN is cleared for the operation to
 * complete. For read operations, ULPI_DATRD is valid after ULPI_RUN is cleared. The
 * polling method above can be replaced with interrupts using the ULPI interrupt
 * defined in the USBSTS and USBINTR registers. When a wake-up or read/write
 * operation completes, the ULPI interrupt is set.
 */
/*!
 * @name Constants and macros for entire USBHS_ULPI_VIEWPORT register
 */
/*@{*/
#define USBHS_RD_ULPI_VIEWPORT(base) (USBHS_ULPI_VIEWPORT_REG(base))
#define USBHS_WR_ULPI_VIEWPORT(base, value) (USBHS_ULPI_VIEWPORT_REG(base) = (value))
#define USBHS_RMW_ULPI_VIEWPORT(base, mask, value) (USBHS_WR_ULPI_VIEWPORT(base, (USBHS_RD_ULPI_VIEWPORT(base) & ~(mask)) | (value)))
#define USBHS_SET_ULPI_VIEWPORT(base, value) (USBHS_WR_ULPI_VIEWPORT(base, USBHS_RD_ULPI_VIEWPORT(base) |  (value)))
#define USBHS_CLR_ULPI_VIEWPORT(base, value) (USBHS_WR_ULPI_VIEWPORT(base, USBHS_RD_ULPI_VIEWPORT(base) & ~(value)))
#define USBHS_TOG_ULPI_VIEWPORT(base, value) (USBHS_WR_ULPI_VIEWPORT(base, USBHS_RD_ULPI_VIEWPORT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_ULPI_VIEWPORT bitfields
 */

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_DATWR[7:0] (RW)
 *
 * When a write operation is commanded, the data to be sent is written to this
 * field.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_DATWR field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_DATWR(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_DATWR_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_DATWR_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_DATWR(base) (USBHS_RD_ULPI_VIEWPORT_ULPI_DATWR(base))

/*! @brief Set the ULPI_DATWR field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_DATWR(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_DATWR_MASK, USBHS_ULPI_VIEWPORT_ULPI_DATWR(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_DATWR(base, value) (USBHS_WR_ULPI_VIEWPORT_ULPI_DATWR(base, value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_DATRD[15:8] (RO)
 *
 * After a read operation completes, the result is placed in this field.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_DATRD field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_DATRD(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_DATRD_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_DATRD_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_DATRD(base) (USBHS_RD_ULPI_VIEWPORT_ULPI_DATRD(base))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_ADDR[23:16] (RW)
 *
 * When a read or write operation is commanded, the address of the operation is
 * written to this field.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_ADDR field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_ADDR(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_ADDR_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_ADDR_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_ADDR(base) (USBHS_RD_ULPI_VIEWPORT_ULPI_ADDR(base))

/*! @brief Set the ULPI_ADDR field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_ADDR(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_ADDR_MASK, USBHS_ULPI_VIEWPORT_ULPI_ADDR(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_ADDR(base, value) (USBHS_WR_ULPI_VIEWPORT_ULPI_ADDR(base, value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_PORT[26:24] (RW)
 *
 * For wake-up or read/write operations this value selects the port number to
 * which the ULPI PHY is attached. Valid values are 0 and 1.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_PORT field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_PORT(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_PORT_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_PORT_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_PORT(base) (USBHS_RD_ULPI_VIEWPORT_ULPI_PORT(base))

