pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the ULPI_PORT field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_PORT(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_PORT_MASK, USBHS_ULPI_VIEWPORT_ULPI_PORT(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_PORT(base, value) (USBHS_WR_ULPI_VIEWPORT_ULPI_PORT(base, value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_SS[27] (RW)
 *
 * Represents the state of the ULPI interface. Before reading this bit, the
 * ULPI_PORT field should be set accordingly if used with the multi-port host.
 * Otherwise, this field should always remain 0.
 *
 * Values:
 * - 0 - Any other state (that is, carkit, serial, low power)
 * - 1 - Normal sync state
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_SS field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_SS(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_SS_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_SS(base) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT))

/*! @brief Set the ULPI_SS field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_SS(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_SS_MASK, USBHS_ULPI_VIEWPORT_ULPI_SS(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_SS(base, value) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_SS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_RW[29] (RW)
 *
 * Selects between running a read or write operation to the ULPI.
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_RW field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_RW(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_RW_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_RW(base) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT))

/*! @brief Set the ULPI_RW field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_RW(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_RW_MASK, USBHS_ULPI_VIEWPORT_ULPI_RW(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_RW(base, value) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_RW_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_RUN[30] (RW)
 *
 * Setting this bit begins a read/write operation. This bit automatically clears
 * after the read/write is complete. After this bit is set, it can not be
 * cleared by software. The driver must never execute a wake-up and a read/write
 * operation at the same time.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_RUN field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_RUN(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_RUN_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_RUN(base) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT))

/*! @brief Set the ULPI_RUN field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_RUN(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_RUN_MASK, USBHS_ULPI_VIEWPORT_ULPI_RUN(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_RUN(base, value) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_RUN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_WU[31] (RW)
 *
 * Setting this bit begins the wake-up operation. This bit automatically clears
 * after the wake-up is complete. After this bit is set, it can not be cleared by
 * software. The driver must never execute a wake-up and a read/write operation
 * at the same time.
 */
/*@{*/
/*! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_WU field. */
#define USBHS_RD_ULPI_VIEWPORT_ULPI_WU(base) ((USBHS_ULPI_VIEWPORT_REG(base) & USBHS_ULPI_VIEWPORT_ULPI_WU_MASK) >> USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT)
#define USBHS_BRD_ULPI_VIEWPORT_ULPI_WU(base) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT))

/*! @brief Set the ULPI_WU field to a new value. */
#define USBHS_WR_ULPI_VIEWPORT_ULPI_WU(base, value) (USBHS_RMW_ULPI_VIEWPORT(base, USBHS_ULPI_VIEWPORT_ULPI_WU_MASK, USBHS_ULPI_VIEWPORT_ULPI_WU(value)))
#define USBHS_BWR_ULPI_VIEWPORT_ULPI_WU(base, value) (BITBAND_ACCESS32(&USBHS_ULPI_VIEWPORT_REG(base), USBHS_ULPI_VIEWPORT_ULPI_WU_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_ENDPTNAK - Endpoint NAK Register
 ******************************************************************************/

/*!
 * @brief USBHS_ENDPTNAK - Endpoint NAK Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire USBHS_ENDPTNAK register
 */
/*@{*/
#define USBHS_RD_ENDPTNAK(base)  (USBHS_ENDPTNAK_REG(base))
#define USBHS_WR_ENDPTNAK(base, value) (USBHS_ENDPTNAK_REG(base) = (value))
#define USBHS_RMW_ENDPTNAK(base, mask, value) (USBHS_WR_ENDPTNAK(base, (USBHS_RD_ENDPTNAK(base) & ~(mask)) | (value)))
#define USBHS_SET_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) |  (value)))
#define USBHS_CLR_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) & ~(value)))
#define USBHS_TOG_ENDPTNAK(base, value) (USBHS_WR_ENDPTNAK(base, USBHS_RD_ENDPTNAK(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_ENDPTNAK bitfields
 */

/*!
 * @name Register USBHS_ENDPTNAK, field EPRN[3:0] (W1C)
 *
 * Each RX endpoint has 1 bit in this field. The bit is set when the device
 * sends a NAK handshake on a received OUT or PING token for the corresponding
 * endpoint. EPRN[3]-Endpoint #3 EPRN[2]-Endpoint #2 EPRN[1]-Endpoint #1
 * EPRN[0]-Endpoint #0
 */
/*@{*/
/*! @brief Read current value of the USBHS_ENDPTNAK_EPRN field. */
#define USBHS_RD_ENDPTNAK_EPRN(base) ((USBHS_ENDPTNAK_REG(base) & USBHS_ENDPTNAK_EPRN_MASK) >> USBHS_ENDPTNAK_EPRN_SHIFT)
#define USBHS_BRD_ENDPTNAK_EPRN(base) (USBHS_RD_ENDPTNAK_EPRN(base))

