pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBHS_OTGSC - On-the-Go Status and Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_OTGSC - On-the-Go Status and Control Register (RW)
 *
 * Reset value: 0x00001020U
 *
 * This register is not defined in the EHCI specification. The host controller
 * implements one OTGSC register corresponding to port 0 of the host controller.
 * The OTGSC register has four sections: OTG interrupt enables (read/write) OTG
 * interrupt status (read/write to clear) OTG status inputs (read-only) OTG
 * controls (read/write) The status inputs de-bounce using a 1 ms time constant. Values
 * on the status inputs that do not persist for more than 1 ms do not cause an
 * update of the status inputs or an OTG interrupt.
 */
/*!
 * @name Constants and macros for entire USBHS_OTGSC register
 */
/*@{*/
#define USBHS_RD_OTGSC(base)     (USBHS_OTGSC_REG(base))
#define USBHS_WR_OTGSC(base, value) (USBHS_OTGSC_REG(base) = (value))
#define USBHS_RMW_OTGSC(base, mask, value) (USBHS_WR_OTGSC(base, (USBHS_RD_OTGSC(base) & ~(mask)) | (value)))
#define USBHS_SET_OTGSC(base, value) (USBHS_WR_OTGSC(base, USBHS_RD_OTGSC(base) |  (value)))
#define USBHS_CLR_OTGSC(base, value) (USBHS_WR_OTGSC(base, USBHS_RD_OTGSC(base) & ~(value)))
#define USBHS_TOG_OTGSC(base, value) (USBHS_WR_OTGSC(base, USBHS_RD_OTGSC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_OTGSC bitfields
 */

/*!
 * @name Register USBHS_OTGSC, field VD[0] (RW)
 *
 * Setting this bit causes VBUS to discharge through a resistor.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_VD field. */
#define USBHS_RD_OTGSC_VD(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_VD_MASK) >> USBHS_OTGSC_VD_SHIFT)
#define USBHS_BRD_OTGSC_VD(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_VD_SHIFT))

/*! @brief Set the VD field to a new value. */
#define USBHS_WR_OTGSC_VD(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_VD_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_VD(value)))
#define USBHS_BWR_OTGSC_VD(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_VD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field VC[1] (RW)
 *
 * Setting this bit causes the VBUS line to charge. This is used for VBus
 * pulsing during SRP.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_VC field. */
#define USBHS_RD_OTGSC_VC(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_VC_MASK) >> USBHS_OTGSC_VC_SHIFT)
#define USBHS_BRD_OTGSC_VC(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_VC_SHIFT))

/*! @brief Set the VC field to a new value. */
#define USBHS_WR_OTGSC_VC(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_VC_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_VC(value)))
#define USBHS_BWR_OTGSC_VC(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_VC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field HAAR[2] (RW)
 *
 * Values:
 * - 0 - Disabled.
 * - 1 - Enable automatic reset after connect on host port.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_HAAR field. */
#define USBHS_RD_OTGSC_HAAR(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_HAAR_MASK) >> USBHS_OTGSC_HAAR_SHIFT)
#define USBHS_BRD_OTGSC_HAAR(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_HAAR_SHIFT))

/*! @brief Set the HAAR field to a new value. */
#define USBHS_WR_OTGSC_HAAR(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_HAAR_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_HAAR(value)))
#define USBHS_BWR_OTGSC_HAAR(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_HAAR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field OT[3] (RW)
 *
 * This bit must be set with the OTG module in device mode.
 *
 * Values:
 * - 0 - Disable pull-down on DM
 * - 1 - Enable pull-down on DM
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_OT field. */
#define USBHS_RD_OTGSC_OT(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_OT_MASK) >> USBHS_OTGSC_OT_SHIFT)
#define USBHS_BRD_OTGSC_OT(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_OT_SHIFT))

/*! @brief Set the OT field to a new value. */
#define USBHS_WR_OTGSC_OT(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_OT_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_OT(value)))
#define USBHS_BWR_OTGSC_OT(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_OT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field DP[4] (RW)
 *
 * Values:
 * - 0 - The pull-up on DP is not asserted
 * - 1 - The pull-up on DP is asserted for data pulsing during SRP
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_DP field. */
#define USBHS_RD_OTGSC_DP(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_DP_MASK) >> USBHS_OTGSC_DP_SHIFT)
#define USBHS_BRD_OTGSC_DP(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DP_SHIFT))

/*! @brief Set the DP field to a new value. */
#define USBHS_WR_OTGSC_DP(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_DP_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_DP(value)))
#define USBHS_BWR_OTGSC_DP(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field IDPU[5] (RW)
 *
 * Provides control over the ID pull-up resistor.
 *
 * Values:
 * - 0 - Disable pull-up. ID input not sampled.
 * - 1 - Enable pull-up
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_IDPU field. */
#define USBHS_RD_OTGSC_IDPU(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_IDPU_MASK) >> USBHS_OTGSC_IDPU_SHIFT)
#define USBHS_BRD_OTGSC_IDPU(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDPU_SHIFT))

/*! @brief Set the IDPU field to a new value. */
#define USBHS_WR_OTGSC_IDPU(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_IDPU_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_IDPU(value)))
#define USBHS_BWR_OTGSC_IDPU(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDPU_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field HABA[7] (RW)
 *
 * Values:
 * - 0 - Disabled.
 * - 1 - Enable automatic B-disconnect to A-connect sequence.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_HABA field. */
#define USBHS_RD_OTGSC_HABA(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_HABA_MASK) >> USBHS_OTGSC_HABA_SHIFT)
#define USBHS_BRD_OTGSC_HABA(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_HABA_SHIFT))

/*! @brief Set the HABA field to a new value. */
#define USBHS_WR_OTGSC_HABA(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_HABA_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_HABA(value)))
#define USBHS_BWR_OTGSC_HABA(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_HABA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field ID[8] (RO)
 *
 * Values:
 * - 0 - A device
 * - 1 - B device
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_ID field. */
#define USBHS_RD_OTGSC_ID(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_ID_MASK) >> USBHS_OTGSC_ID_SHIFT)
#define USBHS_BRD_OTGSC_ID(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ID_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field AVV[9] (RO)
 *
 * Values:
 * - 0 - VBus is below A VBus valid threshold
 * - 1 - VBus is above A VBus valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_AVV field. */
#define USBHS_RD_OTGSC_AVV(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_AVV_MASK) >> USBHS_OTGSC_AVV_SHIFT)
#define USBHS_BRD_OTGSC_AVV(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_AVV_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field ASV[10] (RO)
 *
 * Values:
 * - 0 - VBus is below A session valid threshold
 * - 1 - VBus is above A session valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_ASV field. */
#define USBHS_RD_OTGSC_ASV(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_ASV_MASK) >> USBHS_OTGSC_ASV_SHIFT)
#define USBHS_BRD_OTGSC_ASV(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ASV_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSV[11] (RO)
 *
 * Values:
 * - 0 - VBus is below B session valid threshold
 * - 1 - VBus is above B session valid threshold
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSV field. */
#define USBHS_RD_OTGSC_BSV(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSV_MASK) >> USBHS_OTGSC_BSV_SHIFT)
#define USBHS_BRD_OTGSC_BSV(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSV_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSE[12] (RO)
 *
 * Values:
 * - 0 - VBus is above B session end threshold
 * - 1 - VBus is below B session end threshold
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSE field. */
#define USBHS_RD_OTGSC_BSE(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSE_MASK) >> USBHS_OTGSC_BSE_SHIFT)
#define USBHS_BRD_OTGSC_BSE(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSE_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field MST[13] (RO)
 *
 * This bit toggles once per millisecond.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_MST field. */
#define USBHS_RD_OTGSC_MST(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_MST_MASK) >> USBHS_OTGSC_MST_SHIFT)
#define USBHS_BRD_OTGSC_MST(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_MST_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field DPS[14] (RO)
 *
 * Values:
 * - 0 - No pulsing on port
 * - 1 - Pulsing detected on port
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_DPS field. */
#define USBHS_RD_OTGSC_DPS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_DPS_MASK) >> USBHS_OTGSC_DPS_SHIFT)
#define USBHS_BRD_OTGSC_DPS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DPS_SHIFT))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field IDIS[16] (W1C)
 *
 * Indicates when a change on the ID input is detected. Software must write a 1
 * to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_IDIS field. */
#define USBHS_RD_OTGSC_IDIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_IDIS_MASK) >> USBHS_OTGSC_IDIS_SHIFT)
#define USBHS_BRD_OTGSC_IDIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDIS_SHIFT))

/*! @brief Set the IDIS field to a new value. */
#define USBHS_WR_OTGSC_IDIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_IDIS(value)))
#define USBHS_BWR_OTGSC_IDIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_IDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field AVVIS[17] (W1C)
 *
 * Indicates when VBUS rises above or falls below the VBUS valid threshold (4.4
 * VDC) on an A device. Software must write a 1 to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_AVVIS field. */
#define USBHS_RD_OTGSC_AVVIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_AVVIS_MASK) >> USBHS_OTGSC_AVVIS_SHIFT)
#define USBHS_BRD_OTGSC_AVVIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_AVVIS_SHIFT))

/*! @brief Set the AVVIS field to a new value. */
#define USBHS_WR_OTGSC_AVVIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_AVVIS(value)))
#define USBHS_BWR_OTGSC_AVVIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_AVVIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field ASVIS[18] (W1C)
 *
 * Indicates when VBUS rises above or falls below the A session valid threshold
 * (0.8 VDC). Software must write a 1 to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_ASVIS field. */
#define USBHS_RD_OTGSC_ASVIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_ASVIS_MASK) >> USBHS_OTGSC_ASVIS_SHIFT)
#define USBHS_BRD_OTGSC_ASVIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ASVIS_SHIFT))

/*! @brief Set the ASVIS field to a new value. */
#define USBHS_WR_OTGSC_ASVIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_ASVIS(value)))
#define USBHS_BWR_OTGSC_ASVIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_ASVIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSVIS[19] (W1C)
 *
 * Indicates when VBUS rises above or falls below the B session valid threshold
 * (0.8 VDC). Software must write a 1 to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSVIS field. */
#define USBHS_RD_OTGSC_BSVIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSVIS_MASK) >> USBHS_OTGSC_BSVIS_SHIFT)
#define USBHS_BRD_OTGSC_BSVIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSVIS_SHIFT))

/*! @brief Set the BSVIS field to a new value. */
#define USBHS_WR_OTGSC_BSVIS(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_BSVIS(value)))
#define USBHS_BWR_OTGSC_BSVIS(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSVIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_OTGSC, field BSEIS[20] (W1C)
 *
 * Indicates when VBUS falls below the B session end threshold. Software must
 * write a 1 to clear this bit.
 */
/*@{*/
/*! @brief Read current value of the USBHS_OTGSC_BSEIS field. */
#define USBHS_RD_OTGSC_BSEIS(base) ((USBHS_OTGSC_REG(base) & USBHS_OTGSC_BSEIS_MASK) >> USBHS_OTGSC_BSEIS_SHIFT)
#define USBHS_BRD_OTGSC_BSEIS(base) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_BSEIS_SHIFT))

