pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the DPIE field to a new value. */
#define USBHS_WR_OTGSC_DPIE(base, value) (USBHS_RMW_OTGSC(base, (USBHS_OTGSC_DPIE_MASK | USBHS_OTGSC_IDIS_MASK | USBHS_OTGSC_AVVIS_MASK | USBHS_OTGSC_ASVIS_MASK | USBHS_OTGSC_BSVIS_MASK | USBHS_OTGSC_BSEIS_MASK | USBHS_OTGSC_MSS_MASK | USBHS_OTGSC_DPIS_MASK), USBHS_OTGSC_DPIE(value)))
#define USBHS_BWR_OTGSC_DPIE(base, value) (BITBAND_ACCESS32(&USBHS_OTGSC_REG(base), USBHS_OTGSC_DPIE_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * USBHS_USBMODE - USB Mode Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBMODE - USB Mode Register (RW)
 *
 * Reset value: 0x00005000U
 *
 * This register is not defined in the EHCI specification. It controls the
 * operating mode of the module.
 */
/*!
 * @name Constants and macros for entire USBHS_USBMODE register
 */
/*@{*/
#define USBHS_RD_USBMODE(base)   (USBHS_USBMODE_REG(base))
#define USBHS_WR_USBMODE(base, value) (USBHS_USBMODE_REG(base) = (value))
#define USBHS_RMW_USBMODE(base, mask, value) (USBHS_WR_USBMODE(base, (USBHS_RD_USBMODE(base) & ~(mask)) | (value)))
#define USBHS_SET_USBMODE(base, value) (USBHS_WR_USBMODE(base, USBHS_RD_USBMODE(base) |  (value)))
#define USBHS_CLR_USBMODE(base, value) (USBHS_WR_USBMODE(base, USBHS_RD_USBMODE(base) & ~(value)))
#define USBHS_TOG_USBMODE(base, value) (USBHS_WR_USBMODE(base, USBHS_RD_USBMODE(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBMODE bitfields
 */

/*!
 * @name Register USBHS_USBMODE, field CM[1:0] (RW)
 *
 * This register can be written only once after reset. If necessary to switch
 * modes, software must reset the controller by writing to the USBCMD[RST] bit
 * before reprogramming this register. The USBHS module must be initialized to the
 * desired operating mode after reset.
 *
 * Values:
 * - 00 - Idle (default for the USBHS module)
 * - 01 - Reserved
 * - 10 - Device controller
 * - 11 - Host controller
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBMODE_CM field. */
#define USBHS_RD_USBMODE_CM(base) ((USBHS_USBMODE_REG(base) & USBHS_USBMODE_CM_MASK) >> USBHS_USBMODE_CM_SHIFT)
#define USBHS_BRD_USBMODE_CM(base) (USBHS_RD_USBMODE_CM(base))

/*! @brief Set the CM field to a new value. */
#define USBHS_WR_USBMODE_CM(base, value) (USBHS_RMW_USBMODE(base, USBHS_USBMODE_CM_MASK, USBHS_USBMODE_CM(value)))
#define USBHS_BWR_USBMODE_CM(base, value) (USBHS_WR_USBMODE_CM(base, value))
/*@}*/

/*!
 * @name Register USBHS_USBMODE, field ES[2] (RW)
 *
 * Controls the byte ordering of the transfer buffers to match the host
 * microprocessor bus architecture. The bit fields in the register interface and the DMA
 * data structures (including the setup buffer within the device QH) are
 * unaffected by the value of this bit, because they are based upon 32-bit words.
 *
 * Values:
 * - 0 - Little endian. First byte referenced in least significant byte of
 *     32-bit word.
 * - 1 - Big endian. First byte referenced in most significant byte of 32-bit
 *     word.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBMODE_ES field. */
#define USBHS_RD_USBMODE_ES(base) ((USBHS_USBMODE_REG(base) & USBHS_USBMODE_ES_MASK) >> USBHS_USBMODE_ES_SHIFT)
#define USBHS_BRD_USBMODE_ES(base) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_ES_SHIFT))

/*! @brief Set the ES field to a new value. */
#define USBHS_WR_USBMODE_ES(base, value) (USBHS_RMW_USBMODE(base, USBHS_USBMODE_ES_MASK, USBHS_USBMODE_ES(value)))
#define USBHS_BWR_USBMODE_ES(base, value) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_ES_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBMODE, field SLOM[3] (RW)
 *
 * For the module in device mode, this bit controls behavior of the setup lock
 * mechanism. See section "Control Endpoint Operation."
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBMODE_SLOM field. */
#define USBHS_RD_USBMODE_SLOM(base) ((USBHS_USBMODE_REG(base) & USBHS_USBMODE_SLOM_MASK) >> USBHS_USBMODE_SLOM_SHIFT)
#define USBHS_BRD_USBMODE_SLOM(base) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_SLOM_SHIFT))

/*! @brief Set the SLOM field to a new value. */
#define USBHS_WR_USBMODE_SLOM(base, value) (USBHS_RMW_USBMODE(base, USBHS_USBMODE_SLOM_MASK, USBHS_USBMODE_SLOM(value)))
#define USBHS_BWR_USBMODE_SLOM(base, value) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_SLOM_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBMODE, field SDIS[4] (RW)
 *
 * Host mode: Setting this bit ensures that overruns/underruns of the latency
 * FIFO are eliminated for low bandwidth systems where the RX and TX buffers are
 * sufficient to contain the entire packet. Enabling stream disable also has the
 * effect of ensuring the TX latency fills to capacity before the packet launches
 * onto the USB. Time duration to pre-fill the FIFO becomes significant when
 * stream disable is active. See TXFILLTUNING to characterize the adjustments needed
 * for the scheduler when using this feature. Also, in systems with high system
 * bus utilization, setting this bit ensures no overruns or underruns during
 * operation at the expense of link utilization. SDIS can be left clear and the rules
 * under the description of the TXFILLTUNING register can limit underruns/overruns
 * for those who desire optimal link performance. Device mode: Setting this bit
 * disables double priming on RX and TX for low bandwidth systems. This mode
 * ensures that when the RX and TX buffers are sufficient to contain an entire packet
 * that the standard double buffering scheme is disabled to prevent
 * overruns/underruns in bandwidth limited systems. In high-speed mode, all packets received
 * are responded to with a NYET handshake when stream disable is active.
 *
 * Values:
 * - 0 - Inactive
 * - 1 - Active
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBMODE_SDIS field. */
#define USBHS_RD_USBMODE_SDIS(base) ((USBHS_USBMODE_REG(base) & USBHS_USBMODE_SDIS_MASK) >> USBHS_USBMODE_SDIS_SHIFT)
#define USBHS_BRD_USBMODE_SDIS(base) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_SDIS_SHIFT))

/*! @brief Set the SDIS field to a new value. */
#define USBHS_WR_USBMODE_SDIS(base, value) (USBHS_RMW_USBMODE(base, USBHS_USBMODE_SDIS_MASK, USBHS_USBMODE_SDIS(value)))
#define USBHS_BWR_USBMODE_SDIS(base, value) (BITBAND_ACCESS32(&USBHS_USBMODE_REG(base), USBHS_USBMODE_SDIS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBMODE, field TXHSD[14:12] (RW)
 *
 * Controls the value of TX to TX HS Interpacket Delay by changing the internal
 * delay count. The value of the global TX to TX interpacket delay depends on
 * this internal counter and on the intrinsic PHY TX End Delay and TX Start Delay
 * values. The TX to TX interpacket gap must be within the interval [88,192] bit
 * times. 88 <= Controller internal delay - Tx End Delay + Tx Start Delay <= 192
 * (HS bit times) Below are the values of the internal controller counter in terms
 * of PHY clock cycles.
 *
 * Values:
 * - 000 - 10
 * - 001 - 11
 * - 010 - 12
 * - 011 - 13
 * - 100 - 14
 * - 101 - 15
 * - 110 - 16
 * - 111 - 17
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBMODE_TXHSD field. */
#define USBHS_RD_USBMODE_TXHSD(base) ((USBHS_USBMODE_REG(base) & USBHS_USBMODE_TXHSD_MASK) >> USBHS_USBMODE_TXHSD_SHIFT)
#define USBHS_BRD_USBMODE_TXHSD(base) (USBHS_RD_USBMODE_TXHSD(base))

/*! @brief Set the TXHSD field to a new value. */
#define USBHS_WR_USBMODE_TXHSD(base, value) (USBHS_RMW_USBMODE(base, USBHS_USBMODE_TXHSD_MASK, USBHS_USBMODE_TXHSD(value)))
#define USBHS_BWR_USBMODE_TXHSD(base, value) (USBHS_WR_USBMODE_TXHSD(base, value))
/*@}*/

