pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*! @brief Set the RXS field to a new value. */
#define USBHS_WR_EPCR_RXS(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXS_MASK, USBHS_EPCR_RXS(value)))
#define USBHS_BWR_EPCR_RXS(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXD[1] (RW)
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXD field. */
#define USBHS_RD_EPCR_RXD(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXD_MASK) >> USBHS_EPCR_RXD_SHIFT)
#define USBHS_BRD_EPCR_RXD(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXD_SHIFT))

/*! @brief Set the RXD field to a new value. */
#define USBHS_WR_EPCR_RXD(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXD_MASK, USBHS_EPCR_RXD(value)))
#define USBHS_BWR_EPCR_RXD(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXT[3:2] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXT field. */
#define USBHS_RD_EPCR_RXT(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXT_MASK) >> USBHS_EPCR_RXT_SHIFT)
#define USBHS_BRD_EPCR_RXT(base, index) (USBHS_RD_EPCR_RXT(base, index))

/*! @brief Set the RXT field to a new value. */
#define USBHS_WR_EPCR_RXT(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXT_MASK, USBHS_EPCR_RXT(value)))
#define USBHS_BWR_EPCR_RXT(base, index, value) (USBHS_WR_EPCR_RXT(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXI[5] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXI field. */
#define USBHS_RD_EPCR_RXI(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXI_MASK) >> USBHS_EPCR_RXI_SHIFT)
#define USBHS_BRD_EPCR_RXI(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXI_SHIFT))

/*! @brief Set the RXI field to a new value. */
#define USBHS_WR_EPCR_RXI(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXI_MASK, USBHS_EPCR_RXI(value)))
#define USBHS_BWR_EPCR_RXI(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXR[6] (WO)
 */
/*@{*/
/*! @brief Set the RXR field to a new value. */
#define USBHS_WR_EPCR_RXR(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXR_MASK, USBHS_EPCR_RXR(value)))
#define USBHS_BWR_EPCR_RXR(base, index, value) (USBHS_WR_EPCR_RXR(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field RXE[7] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_RXE field. */
#define USBHS_RD_EPCR_RXE(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_RXE_MASK) >> USBHS_EPCR_RXE_SHIFT)
#define USBHS_BRD_EPCR_RXE(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXE_SHIFT))

/*! @brief Set the RXE field to a new value. */
#define USBHS_WR_EPCR_RXE(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_RXE_MASK, USBHS_EPCR_RXE(value)))
#define USBHS_BWR_EPCR_RXE(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_RXE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXS[16] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXS field. */
#define USBHS_RD_EPCR_TXS(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXS_MASK) >> USBHS_EPCR_TXS_SHIFT)
#define USBHS_BRD_EPCR_TXS(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXS_SHIFT))

/*! @brief Set the TXS field to a new value. */
#define USBHS_WR_EPCR_TXS(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXS_MASK, USBHS_EPCR_TXS(value)))
#define USBHS_BWR_EPCR_TXS(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXD[17] (RW)
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXD field. */
#define USBHS_RD_EPCR_TXD(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXD_MASK) >> USBHS_EPCR_TXD_SHIFT)
#define USBHS_BRD_EPCR_TXD(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXD_SHIFT))

/*! @brief Set the TXD field to a new value. */
#define USBHS_WR_EPCR_TXD(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXD_MASK, USBHS_EPCR_TXD(value)))
#define USBHS_BWR_EPCR_TXD(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXT[19:18] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXT field. */
#define USBHS_RD_EPCR_TXT(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXT_MASK) >> USBHS_EPCR_TXT_SHIFT)
#define USBHS_BRD_EPCR_TXT(base, index) (USBHS_RD_EPCR_TXT(base, index))

/*! @brief Set the TXT field to a new value. */
#define USBHS_WR_EPCR_TXT(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXT_MASK, USBHS_EPCR_TXT(value)))
#define USBHS_BWR_EPCR_TXT(base, index, value) (USBHS_WR_EPCR_TXT(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXI[21] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXI field. */
#define USBHS_RD_EPCR_TXI(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXI_MASK) >> USBHS_EPCR_TXI_SHIFT)
#define USBHS_BRD_EPCR_TXI(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXI_SHIFT))

/*! @brief Set the TXI field to a new value. */
#define USBHS_WR_EPCR_TXI(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXI_MASK, USBHS_EPCR_TXI(value)))
#define USBHS_BWR_EPCR_TXI(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXR[22] (WO)
 */
/*@{*/
/*! @brief Set the TXR field to a new value. */
#define USBHS_WR_EPCR_TXR(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXR_MASK, USBHS_EPCR_TXR(value)))
#define USBHS_BWR_EPCR_TXR(base, index, value) (USBHS_WR_EPCR_TXR(base, index, value))
/*@}*/

/*!
 * @name Register USBHS_EPCR, field TXE[23] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_EPCR_TXE field. */
#define USBHS_RD_EPCR_TXE(base, index) ((USBHS_EPCR_REG(base, index) & USBHS_EPCR_TXE_MASK) >> USBHS_EPCR_TXE_SHIFT)
#define USBHS_BRD_EPCR_TXE(base, index) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXE_SHIFT))

/*! @brief Set the TXE field to a new value. */
#define USBHS_WR_EPCR_TXE(base, index, value) (USBHS_RMW_EPCR(base, index, USBHS_EPCR_TXE_MASK, USBHS_EPCR_TXE(value)))
#define USBHS_BWR_EPCR_TXE(base, index, value) (BITBAND_ACCESS32(&USBHS_EPCR_REG(base, index), USBHS_EPCR_TXE_SHIFT) = (value))
/*@}*/

