pyocd/FlashAlgo/source/freescale/devices/MK70F12/MK70F12_extension.h
/*******************************************************************************
 * USBHS_USBGENCTRL - USB General Control Register
 ******************************************************************************/

/*!
 * @brief USBHS_USBGENCTRL - USB General Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification.
 */
/*!
 * @name Constants and macros for entire USBHS_USBGENCTRL register
 */
/*@{*/
#define USBHS_RD_USBGENCTRL(base) (USBHS_USBGENCTRL_REG(base))
#define USBHS_WR_USBGENCTRL(base, value) (USBHS_USBGENCTRL_REG(base) = (value))
#define USBHS_RMW_USBGENCTRL(base, mask, value) (USBHS_WR_USBGENCTRL(base, (USBHS_RD_USBGENCTRL(base) & ~(mask)) | (value)))
#define USBHS_SET_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) |  (value)))
#define USBHS_CLR_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) & ~(value)))
#define USBHS_TOG_USBGENCTRL(base, value) (USBHS_WR_USBGENCTRL(base, USBHS_RD_USBGENCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual USBHS_USBGENCTRL bitfields
 */

/*!
 * @name Register USBHS_USBGENCTRL, field WU_IE[0] (RW)
 *
 * This bit is used to enable the low power wakeup interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBGENCTRL_WU_IE field. */
#define USBHS_RD_USBGENCTRL_WU_IE(base) ((USBHS_USBGENCTRL_REG(base) & USBHS_USBGENCTRL_WU_IE_MASK) >> USBHS_USBGENCTRL_WU_IE_SHIFT)
#define USBHS_BRD_USBGENCTRL_WU_IE(base) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_IE_SHIFT))

/*! @brief Set the WU_IE field to a new value. */
#define USBHS_WR_USBGENCTRL_WU_IE(base, value) (USBHS_RMW_USBGENCTRL(base, USBHS_USBGENCTRL_WU_IE_MASK, USBHS_USBGENCTRL_WU_IE(value)))
#define USBHS_BWR_USBGENCTRL_WU_IE(base, value) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_IE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBGENCTRL, field WU_ULPI_EN[1] (RW)
 *
 * This bit is used to enable the wake up from the ULPI I/F.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBGENCTRL_WU_ULPI_EN field. */
#define USBHS_RD_USBGENCTRL_WU_ULPI_EN(base) ((USBHS_USBGENCTRL_REG(base) & USBHS_USBGENCTRL_WU_ULPI_EN_MASK) >> USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT)
#define USBHS_BRD_USBGENCTRL_WU_ULPI_EN(base) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT))

/*! @brief Set the WU_ULPI_EN field to a new value. */
#define USBHS_WR_USBGENCTRL_WU_ULPI_EN(base, value) (USBHS_RMW_USBGENCTRL(base, USBHS_USBGENCTRL_WU_ULPI_EN_MASK, USBHS_USBGENCTRL_WU_ULPI_EN(value)))
#define USBHS_BWR_USBGENCTRL_WU_ULPI_EN(base, value) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_ULPI_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register USBHS_USBGENCTRL, field WU_INT_CLR[5] (RW)
 *
 * Values:
 * - 0 - Default, no action.
 * - 1 - Clear the wake-up interrupt.
 */
/*@{*/
/*! @brief Read current value of the USBHS_USBGENCTRL_WU_INT_CLR field. */
#define USBHS_RD_USBGENCTRL_WU_INT_CLR(base) ((USBHS_USBGENCTRL_REG(base) & USBHS_USBGENCTRL_WU_INT_CLR_MASK) >> USBHS_USBGENCTRL_WU_INT_CLR_SHIFT)
#define USBHS_BRD_USBGENCTRL_WU_INT_CLR(base) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_INT_CLR_SHIFT))

/*! @brief Set the WU_INT_CLR field to a new value. */
#define USBHS_WR_USBGENCTRL_WU_INT_CLR(base, value) (USBHS_RMW_USBGENCTRL(base, USBHS_USBGENCTRL_WU_INT_CLR_MASK, USBHS_USBGENCTRL_WU_INT_CLR(value)))
#define USBHS_BWR_USBGENCTRL_WU_INT_CLR(base, value) (BITBAND_ACCESS32(&USBHS_USBGENCTRL_REG(base), USBHS_USBGENCTRL_WU_INT_CLR_SHIFT) = (value))
/*@}*/

/*
 * MK70F12 VREF
 *
 * Voltage Reference
 *
 * Registers defined in this header file:
 * - VREF_TRM - VREF Trim Register
 * - VREF_SC - VREF Status and Control Register
 */

#define VREF_INSTANCE_COUNT (1U) /*!< Number of instances of the VREF module. */
#define VREF_IDX (0U) /*!< Instance number for VREF. */

/*******************************************************************************
 * VREF_TRM - VREF Trim Register
 ******************************************************************************/

/*!
 * @brief VREF_TRM - VREF Trim Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains bits that contain the trim data for the Voltage
 * Reference.
 */
/*!
 * @name Constants and macros for entire VREF_TRM register
 */
/*@{*/
#define VREF_RD_TRM(base)        (VREF_TRM_REG(base))
#define VREF_WR_TRM(base, value) (VREF_TRM_REG(base) = (value))
#define VREF_RMW_TRM(base, mask, value) (VREF_WR_TRM(base, (VREF_RD_TRM(base) & ~(mask)) | (value)))
#define VREF_SET_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) |  (value)))
#define VREF_CLR_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) & ~(value)))
#define VREF_TOG_TRM(base, value) (VREF_WR_TRM(base, VREF_RD_TRM(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual VREF_TRM bitfields
 */

/*!
 * @name Register VREF_TRM, field TRIM[5:0] (RW)
 *
 * Upon reset this value is loaded with a factory trim value. These bits change
 * the resulting VREF by approximately +/- 0.5 mV for each step. Min = minimum
 * and max = maximum voltage reference output. For minimum and maximum voltage
 * reference output values, refer to the Data Sheet for this chip.
 *
 * Values:
 * - 000000 - Min
 * - 111111 - Max
 */
/*@{*/
/*! @brief Read current value of the VREF_TRM_TRIM field. */
#define VREF_RD_TRM_TRIM(base) ((VREF_TRM_REG(base) & VREF_TRM_TRIM_MASK) >> VREF_TRM_TRIM_SHIFT)
#define VREF_BRD_TRM_TRIM(base) (VREF_RD_TRM_TRIM(base))

/*! @brief Set the TRIM field to a new value. */
#define VREF_WR_TRM_TRIM(base, value) (VREF_RMW_TRM(base, VREF_TRM_TRIM_MASK, VREF_TRM_TRIM(value)))
#define VREF_BWR_TRM_TRIM(base, value) (VREF_WR_TRM_TRIM(base, value))
/*@}*/

/*******************************************************************************
 * VREF_SC - VREF Status and Control Register
 ******************************************************************************/

/*!
 * @brief VREF_SC - VREF Status and Control Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains the control bits used to enable the internal voltage
 * reference and to select the VREF mode to be used.
 */
/*!
 * @name Constants and macros for entire VREF_SC register
 */
/*@{*/
#define VREF_RD_SC(base)         (VREF_SC_REG(base))
#define VREF_WR_SC(base, value)  (VREF_SC_REG(base) = (value))
#define VREF_RMW_SC(base, mask, value) (VREF_WR_SC(base, (VREF_RD_SC(base) & ~(mask)) | (value)))
#define VREF_SET_SC(base, value) (VREF_WR_SC(base, VREF_RD_SC(base) |  (value)))
#define VREF_CLR_SC(base, value) (VREF_WR_SC(base, VREF_RD_SC(base) & ~(value)))
#define VREF_TOG_SC(base, value) (VREF_WR_SC(base, VREF_RD_SC(base) ^  (value)))
/*@}*/

